--[[
-- File: RaidDebuffs_Legion.lua
-- Author: enderneko (enderneko-dev@outlook.com)
-- File Created: 2022/08/05 16:05:39 +0800
-- Last Modified: 2022/08/05 17:42:47 +0800
--]]

local _, Cell = ...
local F = Cell.funcs

local debuffs = {
    [822] = { -- 破碎群岛
        [1790] = { -- 鬼母阿娜
        },
        [1956] = { -- 阿波克隆
        },
        [1883] = { -- 布鲁塔卢斯
        },
        [1774] = { -- 卡拉米尔
        },
        [1789] = { -- 冷血的杜贡
        },
        [1795] = { -- 浮骸
        },
        [1770] = { -- 胡墨格里斯
        },
        [1769] = { -- 勒凡图斯
        },
        [1884] = { -- 马利费库斯
        },
        [1783] = { -- 魔王纳扎克
        },
        [1749] = { -- 尼索格
        },
        [1763] = { -- 沙索斯
        },
        [1885] = { -- 丝瓦什
        },
        [1756] = { -- 夺魂者
        },
        [1796] = { -- 凋零者吉姆
        },
    },

    [768] = { -- 翡翠梦魇
        ["general"] = {
        },
        [1703] = { -- 尼珊德拉
        },
        [1738] = { -- 伊格诺斯，腐蚀之心
        },
        [1744] = { -- 艾乐瑞瑟·雷弗拉尔
        },
        [1667] = { -- 乌索克
        },
        [1704] = { -- 梦魇之龙
        },
        [1750] = { -- 塞纳留斯
        },
        [1726] = { -- 萨维斯
        },
    },

    [861] = { -- 勇气试炼
        ["general"] = {
        },
        [1819] = { -- 奥丁
        },
        [1830] = { -- 高姆
        },
        [1829] = { -- 海拉
        },
    },

    [786] = { -- 暗夜要塞
        ["general"] = {
        },
        [1706] = { -- 斯考匹隆
        },
        [1725] = { -- 时空畸体
        },
        [1731] = { -- 崔利艾克斯
        },
        [1751] = { -- 魔剑士奥鲁瑞尔
        },
        [1762] = { -- 提克迪奥斯
        },
        [1713] = { -- 克洛苏斯
        },
        [1761] = { -- 高级植物学家特尔安
        },
        [1732] = { -- 占星师艾塔乌斯
        },
        [1743] = { -- 大魔导师艾利桑德
        },
        [1737] = { -- 古尔丹
        },
    },

    [875] = { -- 萨格拉斯之墓
        ["general"] = {
        },
        [1862] = { -- 格罗斯
        },
        [1867] = { -- 恶魔审判庭
        },
        [1856] = { -- 哈亚坦
        },
        [1903] = { -- 月之姐妹
        },
        [1861] = { -- 主母萨丝琳
        },
        [1896] = { -- 绝望的聚合体
        },
        [1897] = { -- 戒卫侍女
        },
        [1873] = { -- 堕落的化身
        },
        [1898] = { -- 基尔加丹
        },
    },

    [959] = { -- 侵入点
        ["general"] = {
        },
        [2010] = { -- 主母芙努娜
        },
        [2011] = { -- 妖女奥露拉黛儿
        },
        [2012] = { -- 审判官梅托
        },
        [2013] = { -- 奥库拉鲁斯
        },
        [2014] = { -- 索塔纳索尔
        },
        [2015] = { -- 深渊领主维尔姆斯
        },
    },

    [946] = { -- 安托鲁斯，燃烧王座
        ["general"] = {
        },
        [1992] = { -- 加洛西灭世者
        },
        [1987] = { -- 萨格拉斯的恶犬
        },
        [1997] = { -- 安托兰统帅议会
        },
        [1985] = { -- 传送门守护者哈萨贝尔
        },
        [2025] = { -- 生命的缚誓者艾欧娜尔
        },
        [2009] = { -- 猎魂者伊墨纳尔
        },
        [2004] = { -- 金加洛斯
        },
        [1983] = { -- 瓦里玛萨斯
        },
        [1986] = { -- 破坏魔女巫会
        },
        [1984] = { -- 阿格拉玛
        },
        [2031] = { -- 寂灭者阿古斯
        },
    },

    [727] = { -- 噬魂之喉
        ["general"] = {
        },
        [1502] = { -- 堕落君王伊米隆
        },
        [1512] = { -- 哈布隆
        },
        [1663] = { -- 海拉
        },
    },

    [767] = { -- 奈萨里奥的巢穴
        ["general"] = {
        },
        [1662] = { -- 洛克莫拉
        },
        [1665] = { -- 乌拉罗格·塑山
        },
        [1673] = { -- 纳拉萨斯
        },
        [1687] = { -- 地底之王达古尔
        },
    },

    [707] = { -- 守望者地窟
        ["general"] = {
        },
        [1467] = { -- 提拉宋·萨瑟利尔
        },
        [1695] = { -- 审判官托蒙托鲁姆
        },
        [1468] = { -- 阿什高姆
        },
        [1469] = { -- 格雷泽
        },
        [1470] = { -- 科达娜·邪歌
        },
    },

    [945] = { -- 执政团之座
        ["general"] = {
        },
        [1979] = { -- 晋升者祖拉尔
        },
        [1980] = { -- 萨普瑞什
        },
        [1981] = { -- 总督奈扎尔
        },
        [1982] = { -- 鲁拉
        },
    },

    [900] = { -- 永夜大教堂
        ["general"] = {
        },
        [1905] = { -- 阿格洛诺克斯
        },
        [1906] = { -- 轻蔑的萨什比特
        },
        [1904] = { -- 多玛塔克斯
        },
        [1878] = { -- 孟菲斯托斯
        },
    },

    [777] = { -- 突袭紫罗兰监狱
        ["general"] = {
        },
        [1693] = { -- 溃面
        },
        [1694] = { -- 颤栗之喉
        },
        [1702] = { -- 鲜血公主萨安娜
        },
        [1686] = { -- 夺心者卡什
        },
        [1688] = { -- 米尔菲丝·法力风暴
        },
        [1696] = { -- 阿努贝斯特
        },
        [1697] = { -- 赛尔奥隆
        },
        [1711] = { -- 邪能领主贝图格
        },
    },

    [800] = { -- 群星庭院
        ["general"] = {
        },
        [1718] = { -- 巡逻队长加多
        },
        [1719] = { -- 塔丽克萨·火冠
        },
        [1720] = { -- 顾问麦兰杜斯
        },
    },

    [716] = { -- 艾萨拉之眼
        ["general"] = {
        },
        [1480] = { -- 督军帕杰什
        },
        [1490] = { -- 积怨夫人
        },
        [1491] = { -- 深须国王
        },
        [1479] = { -- 瑟芬崔斯克
        },
        [1492] = { -- 艾萨拉之怒
        },
    },

    [721] = { -- 英灵殿
        ["general"] = {
        },
        [1485] = { -- 海姆达尔
        },
        [1486] = { -- 赫娅
        },
        [1487] = { -- 芬雷尔
        },
        [1488] = { -- 神王斯科瓦尔德
        },
        [1489] = { -- 奥丁
        },
    },

    [860] = { -- 重返卡拉赞
        ["general"] = {
        },
        [1820] = { -- 歌剧院：魔法坏女巫
        },
        [1826] = { -- 歌剧院：西部故事
        },
        [1827] = { -- 歌剧院：美女与野兽
        },
        [1825] = { -- 贞节圣女
        },
        [1835] = { -- 猎手阿图门
        },
        [1837] = { -- 莫罗斯
        },
        [1836] = { -- 馆长
        },
        [1817] = { -- 麦迪文之影
        },
        [1818] = { -- 魔力吞噬者
        },
        [1838] = { -- 监视者维兹艾德姆
        },
    },

    [726] = { -- 魔法回廊
        ["general"] = {
        },
        [1497] = { -- 伊凡尔
        },
        [1498] = { -- 科蒂拉克斯
        },
        [1499] = { -- 萨卡尔将军
        },
        [1500] = { -- 纳尔提拉
        },
        [1501] = { -- 顾问凡多斯
        },
    },

    [762] = { -- 黑心林地
        ["general"] = {
        },
        [1654] = { -- 大德鲁伊格兰达里斯
        },
        [1655] = { -- 橡树之心
        },
        [1656] = { -- 德萨隆
        },
        [1657] = { -- 萨维斯之影
        },
    },

    [740] = { -- 黑鸦堡垒
        ["general"] = {
        },
        [1518] = { -- 融合之魂
        },
        [1653] = { -- 伊莉萨娜·拉文凯斯
        },
        [1664] = { -- 可恨的斯麦斯帕
        },
        [1672] = { -- 库塔洛斯·拉文凯斯
        },
    },
}

F:LoadBuiltInDebuffs(debuffs)