---------------------------------------------------------------------
-- File: RaidDebuffs_TWW.lua
-- Author: enderneko (enderneko-dev@outlook.com)
-- Created : 2024-07-20 14:35 +08:00
-- Modified: 2024-07-20 14:38 +08:00
---------------------------------------------------------------------

local _, Cell = ...
local F = Cell.funcs

local debuffs = {
    [1278] = { -- 卡兹阿加
        ["general"] = {
        },
        [2637] = { -- 考尔达克，休眠的保护者
        },
        [2635] = { -- 惊魂聚合体
        },
        [2636] = { -- 修拉伊，地渊之海的暴虐者
        },
        [2625] = { -- 欧尔塔，破碎山峦
        },
    },

    [1273] = { -- 尼鲁巴尔王宫
        ["general"] = {
        },
        [2607] = { -- 噬灭者乌格拉克斯
        },
        [2611] = { -- 血缚恐魔
        },
        [2599] = { -- 苏雷吉队长席克兰
        },
        [2609] = { -- 拉夏南
        },
        [2612] = { -- 虫巢扭曲者欧维纳克斯
        },
        [2601] = { -- 节点女亲王凯威扎
        },
        [2608] = { -- 流丝之庭
        },
        [2602] = { -- 安苏雷克女王
        },
    },

    [1274] = { -- 千丝之城
        ["general"] = {
        },
        [2594] = { -- 演说者基克斯威兹克
        },
        [2595] = { -- 女王之牙
        },
        [2600] = { -- 凝结聚合体
        },
        [2596] = { -- 大捻接师艾佐
        },
    },

    [1267] = { -- 圣焰隐修院
        ["general"] = {
        },
        [2571] = { -- 戴尔克莱上尉
        },
        [2570] = { -- 布朗派克男爵
        },
        [2573] = { -- 隐修院长穆普雷
        },
    },

    [1210] = { -- 暗焰裂口
        ["general"] = {
        },
        [2569] = { -- 老蜡须
        },
        [2559] = { -- 布雷炙孔
        },
        [2560] = { -- 蜡烛之王
        },
        [2561] = { -- 黑暗之主
        },
    },

    [1272] = { -- 燧酿酒庄
        ["general"] = {
        },
        [2586] = { -- 酿造大师阿德里尔
        },
        [2587] = { -- 艾帕
        },
        [2588] = { -- 本克·鸣蜂
        },
        [2589] = { -- 戈尔迪·底爵
        },
    },

    [1269] = { -- 矶石宝库
        ["general"] = {
        },
        [2572] = { -- E.D.N.A.
        },
        [2579] = { -- 斯卡莫拉克
        },
        [2590] = { -- 机械大师布洛克和多利塔
        },
        [2582] = { -- 虚空语者艾里奇
        },
    },

    [1270] = { -- 破晨号
        ["general"] = {
        },
        [2580] = { -- 代言人夏多克朗
        },
        [2581] = { -- 阿努布伊卡基
        },
        [2593] = { -- 拉夏南
        },
    },

    [1271] = { -- 艾拉-卡拉，回响之城
        ["general"] = {
        },
        [2583] = { -- 阿瓦诺克斯
        },
        [2584] = { -- 阿努布泽克特
        },
        [2585] = { -- 收割者吉卡塔尔
        },
    },

    [1268] = { -- 驭雷栖巢
        ["general"] = {
        },
        [2566] = { -- 凯里欧斯
        },
        [2567] = { -- 雷卫戈伦
        },
        [2568] = { -- 虚空石畸体
        },
    },
}

F:LoadBuiltInDebuffs(debuffs)