---------------------------------------------------------------------
-- File: RaidDebuffs_TWW.lua
-- Author: enderneko (enderneko-dev@outlook.com)
-- Created : 2024-07-20 14:35 +08:00
-- Modified: 2025-08-16 12:10 -05:00
---------------------------------------------------------------------

---@class Cell
local Cell = select(2, ...)
local F = Cell.funcs

local debuffs = {
    [1278] = { -- 卡兹阿加 - Khaz Algar
        ["general"] = {
        },
        [2762] = { -- 雷什诺尔，无拘者 - Reshanor, The Untethered
        },
        [2637] = { -- 考尔达克，休眠的保护者 - Kordac, the Dormant Protector
        },
        [2635] = { -- 惊魂聚合体 - Aggregation of Horrors
        },
        [2636] = { -- 修拉伊，地渊之海的暴虐者 - Shurrai, Atrocity of the Undersea
        },
        [2625] = { -- 欧尔塔，破碎山峦 - Orta, the Broken Mountain
        },
        [2683] = { -- 地精教父 - The Gobfather
        },
    },

    [1273] = { -- 尼鲁巴尔王宫 - Nerub-ar Palace
        ["general"] = {
            449693, -- 威吓嚎叫
            459585, -- 致命瞄准
            436910, -- 扭曲之丝
            441382, -- 冰刺
            439198, -- 延宕毒液
            444414, -- 致疫倾泻
            446760, -- 垂涎之握
            433825, -- 鲜血盛宴
            458505, -- 剧毒之刃
            436784, -- 感染虫群
            449698, -- 毒刃创伤
            449705, -- 虚刃创伤
            441116, -- 深重呕吐
            441314, -- 撕裂伤口
            446846, -- 感染胆汁
            453131, -- 酸蚀之球
            454860, -- 感染之伤
            "446268", -- 锁定
            446253, -- 软泥痕迹
            448098, -- 吸取精华
            441630, -- 致死顺劈
            442052, -- 碎甲钢斩
            459923, -- 影丝诅咒
            445413, -- 喧啸
            444956, -- 剧毒释放
            444030, -- 薄纱编织
            444172, -- 荒芜风暴
            441402, -- 凝结寒霜
            459986, -- 奔涌虫群
            448060, -- 嫌恶妖术
            448257, -- 纠缠爆发
            "448148", -- 黑血
        },
        [2607] = { -- 噬灭者乌格拉克斯 - Ulgrax the Devourer
            455831, -- 硬化缠网
            439419, -- 追踪者缠网
            435138, -- 消化酸液
            439037, -- 开膛破肚
            457668, -- 噬肉角力
            434705, -- 暴捶（T）
            436255, -- 主宰冲锋
            438657, -- 巨型块状物
            440904, -- 吞噬
            -435136, -- 剧毒鞭击
            -438012, -- 饥饿之嚎
            -455847, -- 伤痕累累
        },
        [2611] = { -- 血缚恐魔 - The Bloodbound Horror
            443042, -- 异世之握
            443612, -- 阴森呕吐
            442656, -- 呕吐出血
            445518, -- 黑血
            442604, -- 瘀液喷撒
            -445570, -- 无明凋零
            -452245, -- 血液凝阻
            -443305, -- 猩红之雨
        },
        [2599] = { -- 苏雷吉队长席克兰 - Sikran, Captain of the Sureki
            439191, -- 诛灭
            438845, -- 暴露（T）
            435410, -- 相位贯突（T）
            434860, -- 相位之刃
            459273, -- 宇宙碎片
            459785, -- 宇宙残渣
            "458277", -- 粉碎横扫（15码内易伤）
            "-464442", -- 粉碎横扫
        },
        [2609] = { -- 拉夏南 - Rasha'nan
            456170, -- 喷射丝线
            460789, -- 粘稠蛛丝
            439815, -- 被感染的子嗣
            439786, -- 酸液翻腾
            439787, -- 酸蚀昏迷
            458067, -- 野蛮创伤（T）
            455287, -- 感染撕咬
            439785, -- 腐蚀
            440193, -- 萦绕侵蚀
            439792, -- 粘稠迸发（近战范围内没有人）
            439780, -- 粘性蛛网
            439776, -- 酸液池
        },
        [2612] = { -- 虫巢扭曲者欧维纳克斯 - Broodtwister Ovi'nax
            446349, -- 粘性之网
            "440421", -- 试验性剂量
            "441362", -- 不稳定的混合物（T，爆炸）
            442257, -- 感染
            442250, -- 锁定
            446351, -- 蛛网喷发（定身）
            "442660", -- 试验性剂量（吸奶盾）
            "441368", -- 不稳定的混合物（T，易伤）
            442799, -- 腥红溢流
            450661, -- 腐灼反应（黑血孵化卵）
            443274, -- 不稳定的灌能（全员吸奶盾）
            442437, -- 摄食黑血（全员吸奶盾）
        },
        [2601] = { -- 节点女亲王凯威扎 - Nexus-Princess Ky'veza
            437343, -- 女王之灾
            436870, -- 奇袭
            440576, -- 深凿重创（T）
            440377, -- 虚空溃灭（T）
            436671, -- 冷血弑君
        },
        [2608] = { -- 流丝之庭 - The Silken Court
            -- high
            438708, -- 针刺虫群
            440001, -- 束缚之网
            449857, -- 被刺穿
            450129, -- 熵能废灭
            -- medium
            438773, -- 破碎护壳
            438749, -- 甲虫锁定
            438218, -- 穿刺打击（T）
            438200, -- 毒液箭（T）
            441772, -- 虚空箭（T）
            -- low
            438656, -- 剧毒之雨
            463461, -- 熵能脆弱
            460600, -- 熵能弹幕
            460364, -- 地震岩层
            -- disabled
            -463464, -- 地震脆弱
            -460360, -- 掘进喷发
            -438355, -- 灾变熵能
            -451086, -- 熵能之网
            -454311, -- 倒钩之网
            "-441626", -- 蛛网漩涡
            "-441788", -- 蛛网漩涡
        },
        [2602] = { -- 安苏雷克女王 - Queen Ansurek
            -- high
            437586, -- 活性毒素
            451278, -- 浓缩毒素
            438974, -- 皇谕责罚
            443903, -- 深渊倾注
            447967, -- 晦暗之触
            445152, -- 侍僧精华
            438804, -- 剧毒新星
            445818, -- 吐沫的饕餮者
            -- medium
            464638, -- 泛沫毒素
            448660, -- 酸蚀箭
            "439829", -- 流丝之墓
            436800, -- 液化（T）
            455404, -- 盛宴（T）
            443342, -- 啃噬（T）
            443656, -- 感染（T）
            449236, -- 腐蚀锐牙（T）
            -- low
            441556, -- 反应蒸汽
            445877, -- 泛沫蒸汽
            441872, -- 皇家虫茧
            439536, -- 网刃
            437078, -- 酸池
            441958, -- 勒握流丝
            443403, -- 阴霾
            446012, -- 精华创裂
            447532, -- 麻痹毒液
            448461, -- 寰宇天启
            449944, -- 酸蚀天启
            -- disabled
            -455387, -- 深渊回响
            "-439825", -- 流丝之墓
            -441865, -- 皇家镣铐
            -447170, -- 掠食之丝
            -445623, -- 暴食之丝
            -464628, -- 反应创伤
        },
    },

    [1296] = { -- 解放安德麦 - Liberation of Undermine
        ["general"] = {
        },
        [2639] = { -- 维克茜和磨轮 - Vexie and the Geargrinders
            459978, -- 爆炸之旅！
            465865, -- 坦爆重击
            468216, -- 爆燃纵火
            459678, -- 喷油
            -468147, -- 废气
        },
        [2640] = { -- 血腥大熔炉 - Cauldron of Carnage
            472242, -- 轰焚啸焰炮
            1213690, -- 熔火粘痰
            473983, -- 静电释放
            1214009, -- 流电镜像
            1214039, -- 熔岩池
            463925, -- 残存电流
            -474159, -- 静电充能
            -472222, -- 酷热恨意
            -472225, -- 镀电恨意
        },
        [2641] = { -- 里克·混响 - Rik Reverb
            469380, -- 音波大炮
            466364, -- 增效
            "467108", -- 故障震击（标记）
            "467044", -- 故障震击
            464518, -- 耳鸣（T）
            468119, -- 共振回声
            1217122, -- 残存电伏
        },
        [2642] = { -- 斯提克斯·堆渣 - Stix Bunkjunker
            1218704, -- 原型能源线圈
            461536, -- 滚动的垃圾
            465346, -- 被分拣
            472893, -- 焚化
            464112, -- 崩摧（T）
            473119, -- 超短引线
            1217954, -- 熔毁
            1219384, -- 废铁火箭
            466748, -- 感染撕咬
            464248, -- 滚烫垃圾
            464854, -- 垃圾堆
            465611, -- 碾过
            -1218343, -- 剧毒烟雾
        },
        [2653] = { -- 链齿狂人洛肯斯多 - Sprocketmonger Lockenstock
            471308, -- 猛爆器MK II型
            1217261, -- 钻透！
            1216509, -- 起钻
            1214878, -- 纵火派对包（T）
            465917, -- 重力停滞（T）
            1218342, -- 不稳定的碎片（易伤）
            1216406, -- 动荡爆炸
            1218319, -- 虚空爆炸
            1221320, -- 激活发明！
            466235, -- 缆线输电
            -465232, -- 声波爆轰
        },
        [2644] = { -- 独臂盗匪 - The One-Armed Bandit
            471927, -- 凋零烈焰
            465009, -- 易爆凝视
            465325, -- 热火朝天
            460472, -- 重棒登场（T）
            460164, -- 污秽排放
            460847, -- 电波冲击
            472783, -- 礼券：震击
            472828, -- 礼券：烈焰
            472837, -- 礼券：炸弹
            472832, -- 礼券：硬币
            460576, -- 震撼力场
            461390, -- 烈焰与硬币
            -460444, -- 豪客（奖励）
        },
        [2645] = { -- 穆格·兹伊，安保头子 - Mug'Zee, Heads of Security
            467380, -- 地精制导火箭
            "472631", -- 震地牢狱
            466476, -- 霜裂冰靴
            1224674, -- 霜裂长矛
            466509, -- 风暴手指枪
            466545, -- 祈祷与乱射
            "1215488", -- 衰变光束（叠加）
            472354, -- 锁定
            466517, -- 风暴雷云
            469601, -- 双厄射击（T）
            469375, -- 炸药载荷（T）
            469391, -- 贯通创伤（T）
            467202, -- 纯金滴露（T）
            467225, -- 固态黄金
            469076, -- 辐射疫病（易伤）
            472061, -- 不稳定的蛛形地雷（易伤）
            469043, -- 灼烧弹片
            474554, -- 震动大地
            472057, -- 烫手污物
            470089, -- 熔火真金池
            "-1215481", -- 衰变光束
            "-1215760", -- 震地牢狱
        },
        [2646] = { -- 铬武大王加里维克斯 - Chrome King Gallywix
            466344, -- 引线弹药筒
            1214749, -- 过载火箭
            466155, -- 工兵的背包
            466834, -- 震击弹幕
            469362, -- 充能的极巨大炸弹
            1216444, -- 超大更猛炸弹轰击（T）
            466246, -- 集中爆破（T）
            466154, -- 爆破燃烧（T）
            467064, -- 自尊重挫（T）
            1220375, -- 技巧射击（T）
            1224669, -- 连环机炮（T）
            1216845, -- 扳手（T）
            467184, -- 压制
            1220761, -- 机械工程师的弹药筒
            471603, -- 裂破弹药筒
            466338, -- 急转飞射火箭
            469326, -- 极巨大冲击
            469404, -- 极巨大爆破
            469795, -- 极巨大炸弹爆炸
            1215209, -- 破坏区域
        },
    },

    [1302] = { -- 法力熔炉：欧米伽 - Manaforge Omega
        ["general"] = {
            346109, -- Face Hug
            346115, -- Upset Stomach
            1215904, -- Volatile Mana
            1216172, -- Poisoned Blood
            1223222, -- Arcane Gash
            1223235, -- Arcane Sludge
            1223615, -- Cursed Gaze
            1223667, -- Void Glare
            1223723, -- Glare Splatter
            1223944, -- Phase Feast
            1224114, -- Toxic Eruption
            1224343, -- Shattered Shards
            1224977, -- Arcing Mana
            1225219, -- Mana Exhaust
            1226277, -- Entropic Howl
            1226440, -- Bound
            1226788, -- Entropic Terror
            1226903, -- Harvesting Slice
            1226915, -- Sticky Silk
            1226951, -- Arcane Infusion
            1227710, -- Abyssal Surge
            1229325, -- Oblivion
            1231059, -- Essence Implosion
            1237725, -- Energy Surge
            1238844, -- Echo Barrage
            1238960, -- Bonemelt
            1239269, -- Fel Inferno
            1241137, -- Refracted Entropy
            1241795, -- Mana Pipe
            1241901, -- Mass Binding
            1242212, -- Burning Aftermath
            1246022, -- Attuned Spillage
            1246053, -- Omega Fueled
            1248319, -- Inhibiting Touch
            1248435, -- Arcane Touch
        },
        [2684] = { -- 集能哨兵 - Plexus Sentinel
            1218625, -- Displacement Matrix
            1218669, -- Energy Cutter
            1219248, -- Arcane Radiation
            1219354, -- Potent Mana Residue
            1219439, -- Obliteration Arcanocannon
            1219459, -- Manifest Matrices
            1219531, -- Eradicating Salvo
            1219607, -- Eradicating Salvo
            1220610, -- Protocol: Purge
            1233110, -- Purging Lightning
            1233449, -- Holding a Mouse
            1233999, -- Obliteration Arcanocannon
            1235545, -- Energy Overload
            1237725, -- Energy Surge
            1250671, -- Arcanomatrix Sieve
        },
        [2686] = { -- 卢米萨尔 - Loom'ithar
            1226311, -- Infusion Tether
            1226366, -- Living Silk
            1226395, -- Overinfusion Burst
            1226721, -- Silken Snare
            1227163, -- Writhing Wave
            1227784, -- Arcane Outrage
            1237212, -- Piercing Strand
            1237307, -- Lair Weaving
            1243771, -- Arcane Ichor
            1247045, -- Hyper Infusion
        },
        [2685] = { -- 缚魂者娜欣达利 - Soulbinder Naazindhri
            1223859, -- Arcane Expulsion
            1225626, -- Soulfire Convergence
            1226827, -- Soulrend Orb
            1227049, -- Voidblade Ambush
            1227051, -- Voidblade Ambush
            1227052, -- Void Burst
            1227276, -- Soulfray Annihilation
            1227277, -- Soulfray Annihilation
            1237607, -- Mystic Lash
            1237725, -- Energy Surge
            1241357, -- Soulfray Annihilation
            1242071, -- Arcane Expulsion
            1242086, -- Arcane Energy
            1242088, -- Arcane Expulsion
            1246531, -- Arcane Sigils
            1248464, -- Mystic Lash
            1248979, -- Voidblade Ambush
            1249065, -- Soulfire Convergence
            1250008, -- Shatterpulse
        },
        [2687] = { -- 熔炉编织者阿拉兹 - Forgeweaver Araz
            1228168, -- Silencing Tempest
            1228188, -- Silencing Tempest
            1228214, -- Astral Harvest
            1228506, -- Overwhelming Power
            1232412, -- Focusing Iris
            1233076, -- Dark Singularity
            1233979, -- Astral Harvest
            1234324, -- Photon Blast
            1240705, -- Astral Burn
        },
        [2688] = { -- 狩魂猎手 - The Soul Hunters
            1218103, -- Eye Beam
            1218122, -- Eye Beam
            1221490, -- Fel-Singed
            1222232, -- Devourer's Ire
            1222307, -- Consume
            1222310, -- Unending Hunger
            1223042, -- Fel Rush
            1223725, -- Fel Inferno
            1225130, -- Felblade
            1226493, -- Shattered Soul
            1227811, -- The Hunt
            1227847, -- The Hunt
            1233105, -- Dark Residue
            1233381, -- Withering Flames
            1233968, -- Event Horizon
            1235045, -- Encroaching Oblivion
            1241908, -- Fracture
            1241917, -- Frailty
            1241946, -- Frailty
            1242284, -- Soulcrush
            1245384, -- Fel Inferno
        },
        [2747] = { -- 弗兰克提鲁斯 - Fractillus
            1224414, -- Crystalline Shockwave
            1227373, -- Shattershell
            1227378, -- Crystal Encasement
            1231871, -- Shockwave Slam
            1233411, -- Crystalline Shockwave
            1241137, -- Refracted Entropy
            1247424, -- Null Consumption
            1250600, -- Void Lightning
        },
        [2690] = { -- 节点之王萨哈达尔 - Nexus-King Salhadaar
            1224795, -- Conquer
            1224816, -- Vanquish
            1225444, -- Atomized
            1226042, -- Starkiller Nova
            1226362, -- Twilight Scar
            1226413, -- Starshattered
            1227470, -- Besiege
            1227549, -- Banishment
            1228056, -- Reap
            1228081, -- Nexus Beams
            1228196, -- Dimension Breath
            1231097, -- Cosmic Rip
            1234529, -- Cosmic Maw
            1234539, -- Dimension Glare
            1237725, -- Energy Surge
            1252803, -- Self-Destruct
        },
        [2691] = { -- 诸界吞噬者迪门修斯 - Dimensius, the All-Devouring
            1228206, -- Excess Mass
            1228207, -- Collective Gravity
            1229325, -- Oblivion
            1230168, -- Mortal Fragility
            1230674, -- Spaghettification
            1231002, -- Dark Energy
            1232394, -- Gravity Well
            1234054, -- Shadowquake
            1234266, -- Cosmic Fragility
            1235114, -- Soaring Reshii
            1235303, -- Harbinger's Embrace
            1237097, -- Astrophysical Jet
            1237325, -- Gamma Burst
            1237696, -- Debris Field
            1238773, -- Extinction
            1239270, -- Voidwarding
            1243577, -- Reverse Gravity
            1243609, -- Airborne
            1243699, -- Spatial Fragment
            1245292, -- Destabilized
            1246145, -- Touch of Oblivion
            1246542, -- Null Binding
            1246930, -- Stellar Core
            1250055, -- Voidgrasp
        },
    },

    [1274] = { -- 千丝之城 - City of Threads
        ["general"] = {
            443401, -- 剧毒打击
            443437, -- 疑之影
            443438, -- 怀疑
            450783, -- 香水投掷
            443432, -- 流丝缠缚
            -- 443430, -- 流丝缠缚
            446718, -- 晦幽纺纱
            443435, -- 扭曲思绪
            448047, -- 裹体之网
            451426, -- 纱网弹幕
            461630, -- 毒性喷吐
            451239, -- 残暴戳刺
            451295, -- 虚空奔袭
            452151, -- 严酷戳刺
            443509, -- 贪婪之虫
            445812, -- 黑暗弹幕
            443427, -- 蛛网箭
            451309, -- 女王之眼
            -- 448305, -- 窃取之力
        },
        [2594] = { -- 演说者基克斯威兹克 - Orator Krix'vizk
            448561, -- 疑之影
            434779, -- 惊魂恫吓
            448562, -- 怀疑
            434722, -- 压制
            434926, -- 残存影响
            440310, -- 压迫之链
        },
        [2595] = { -- 女王之牙 - Fangs of the Queen
            440238, -- 寒冰镰刀
            439692, -- 暮落
            441298, -- 冰冻之血
            440107, -- 飞刀投掷
        },
        [2600] = { -- 凝结聚合体 - The Coaglamation
            442285, -- 腐化附层
            461842, -- 溢流猛击
            -- 461989, -- 溢流猛击
            445435, -- 黑血
        },
        [2596] = { -- 大捻接师艾佐 - Izo, the Grand Splicer
            439324, -- 晦幽纺纱
            439646, -- 汰劣程序
            439341, -- 捻接
        },
    },

    [1267] = { -- 圣焰隐修院 - Priory of the Sacred Flame
        ["general"] = {
            424420, -- 余烬冲击
            424621, -- 蛮力重击
            427635, -- 痛苦撕裂
            453461, -- 铁蒺藜
            424426, -- 跃进打击
            427621, -- 穿刺
            435148, -- 炽热打击
            -- 435165, -- 炽热打击
            444705, -- 神圣风暴
            448787, --纯净
            426964, -- 致死打击
            451764, -- 辉耀烈焰
            427900, -- 熔岩池
            427473, -- 烈焰风暴
            424430, -- 奉献
            427897, -- 热浪
            448492, -- 雷霆一击
        },
        [2571] = { -- 戴尔克莱上尉 - Captain Dailcry
            427583, -- 忏悔
            447272, -- 掷矛
            424414, -- 贯穿护甲
            447439, -- 野蛮重殴
            -- 447443, -- 野蛮重殴
            448515, -- 神圣审判
        },
        [2570] = { -- 布朗派克男爵 - Baron Braunpyke
            423051, -- 灼烧之光
            446403, --牺牲烈焰
            -- 446657, -- 灼烧之光
            423015, -- 谴罚者之盾
            -- 446649, -- 谴罚者之盾
        },
        [2573] = { -- 隐修院长穆普雷 - Prioress Murrpray
            428170, -- 盲目之光
            451606, -- 神圣烈焰
            425556, -- 神圣之地
        },
    },

    [1210] = { -- 暗焰裂口 - Darkflame Cleft
        ["general"] = {
            469620, -- 蠕行暗影
            423654, -- 真疼！
            426883, -- 梆！
            428650, -- 燃烧反冲
            426277, -- 只手擒拿
            426295, -- 烈焰系链
            427929, -- 恶毒啮咬
            428019, -- 闪点
            440653, -- 激涌之蜡
            424322, -- 爆炸烈焰
            "420307", -- 烛光
        },
        [2569] = { -- 老蜡须 - Ol' Waxbeard
            423693, -- 诱引烛焰
            422245, -- 穿岩凿
            443694, -- 粗制武器
        },
        [2559] = { -- 布雷炙孔 - Blazikon
            421817, -- 点芯弹幕
            -- 421638, -- 点芯弹幕
            1218308, -- 燃焰地狱火
            424223, -- 点燃
        },
        [2560] = { -- 蜡烛之王 - The Candle King
            426145, -- 偏执失心
            422648, -- 暗焰之锄
            421146, -- 投掷暗焰
            421067, -- 熔化蜡油
            426127, -- 黑暗之光
        },
        [2561] = { -- 黑暗之主 - The Darkness
            421653, -- 被诅咒的蜡油
            427015, -- 暗影冲击
            1214523, -- 饕餮虚空
            461460, -- 热浪激增
            427180, -- 畏惧晦幽
            426943, -- 晦幽骤兴
            422806, -- 扼息暗影
            "422807", -- 烛光
        },
    },

    [1272] = { -- 燧酿酒庄 - Cinderbrew Meadery
        ["general"] = {
            442589, -- 蜂蜡
            435000, -- 飞肉直下
            441397, -- 蜂毒
            449090, -- 鲁莽搬运
            453810, -- 酒精炸药
            463220, -- 烈性酒桶
            439468, -- 风向逆转
            463227, -- 破片入体
            442995, -- 蜂拥惊喜
            440687, -- 蜂蜜齐射
            441179, -- 泛涌蜂蜜
        },
        [2586] = { -- 酿造大师阿德里尔 - Brew Master Aldryr
            445180, -- 横行乱斗
            437956, -- 迸发地狱火
            434707, -- 燧酿飞掷
            432182, -- 投掷燧酿
            434773, -- 杯卑磕砸
            437721, -- 沸燃烈焰
            431897, -- 吵闹喧哗
            432196, -- 滚烫蜜糖
        },
        [2587] = { -- 艾帕 - I'pa
            439325, -- 燃烧发酵
        },
        [2588] = { -- 本克·鸣蜂 - Benk Buzzbee
            "440134", -- 蜂蜜料汁
            439586, -- 振翼之风
            438975, -- 碎肉针刺
            "440141", -- 蜂蜜料汁
        },
        [2589] = { -- 戈尔迪·底爵 - Goldie Baronbottom
            436624, -- 点钞大炮
            "436640", -- 燃焰弹射
            "436644", -- 燃焰弹射
            435789, -- 燧火创伤
        },
    },

    [1269] = { -- 矶石宝库 - The Stonevault
        ["general"] = {
            449455, -- 咆哮恐惧
            429545, -- 噤声齿轮
            448975, -- 重盾奔袭
            425027, -- 地震波
            426308, -- 虚空感染
            427361, -- 破裂
            428887, -- 碾碎
            449154, -- 熔岩迫击炮
            445207, -- 穿透哀嚎
            425974, -- 震地
            -- 464876, -- 震荡跃击
            -- 449129, -- 熔岩重炮
        },
        [2572] = { -- E.D.N.A.
            424889, -- 震地回响
            424795, -- 折光射线
            -- 424893, -- 石盾
            424913, -- 不稳定的爆炸
        },
        [2579] = { -- 斯卡莫拉克 - Skarmorak
            423572, -- 不稳定的能量
            -- 435813, -- 不稳定的能量
            443494, -- 结晶喷发
        },
        [2590] = { -- 机械大师 - Master Machinists
            428547, -- 废料块
            449169, -- 熔岩重炮
            463145, -- 熔岩波
            429999, -- 烈焰废料
            428819, -- 排放口
            -- 443954, -- 排放口
            428161, -- 熔铁之水
        },
        [2582] = { -- 虚空代言人艾里克 - Void Speaker Eirich
            427329, -- 虚空腐蚀
            457465, -- 熵灭
        },
    },

    [1270] = { -- 破晨号 - The Dawnbreaker
        ["general"] = {
            "451115", -- 恐惧猛击
            432448, -- 冥河之种
            451107, -- 迸发虫茧
            451098, -- 黏性新星
            431309, -- 诱捕暗影
            431350, -- 折磨喷发
            431365, -- 折磨光束
            431491, -- 污邪斩击
            451119, -- 深渊轰击
            453345, -- 深渊朽烂
            449332, -- 渗透暗影
            1242681, -- 暗影之刃
        },
        [2580] = { -- 代言人夏多克朗 - Speaker Shadowcrown
            426735, -- 燃烧之影
            453214, -- 黑曜光束
            426736, -- 暗影之幕
            453173, -- 塌缩之夜
        },
        [2581] = { -- 阿努布伊卡基 - Anub'ikkaj
            "427007", -- 恐惧猛击
            431333, -- 折磨射线
            427378, -- 黑暗伤痕
            431494, -- 黑刃之锋
        },
        [2593] = { -- 拉夏南 - Rasha'nan
            434113, -- 喷射丝线
            434576, -- 酸蚀昏迷
            434441, -- 酸液翻腾
            463428, -- 萦绕侵蚀
            434668, -- 火花四射的阿拉希炸弹
            435793, -- 粘稠迸发
            434655, -- 阿拉希炸弹
            434579, -- 腐蚀
            448215, -- 缠网喷吐
            438957, -- 酸液池
            434096, -- 粘性蛛网
        },
    },

    [1271] = { -- 艾拉-卡拉，回响之城 - Ara-Kara, City of Echoes
        ["general"] = {
            "433843", -- 爆发蛛网
            434252, -- 野蛮猛击
            448248, -- 恶臭齐射
            433841, -- 毒液箭雨
            436322, -- 毒液箭
            436401, -- 啊呃！
            438599, -- 放血戳刺
            438825, -- 毒云
            1241694, -- 虫群风暴
            1241785, -- 污血
            -- 433662, -- 抓握之血
        },
        [2583] = { -- 阿瓦诺克斯 - Avanoxx
            436614, -- 裹体之网
            439070, -- 饥肠辘辘
            439200, -- 贪食撕咬
            438618, -- 毒性喷吐
            434830, -- 邪恶缠网
            434083, -- 伏击
        },
        [2584] = { -- 阿努布泽克特 - Anub'zekt
            433740, -- 感染
            442210, -- 流丝束缚
            433781, -- 无休虫群
        },
        [2585] = { -- 收割者吉卡塔尔 - Ki'katal the Harvester
            432031, -- 抓握之血
            "432132", -- 爆发蛛网
            461487, -- 培植毒药
            432227, -- 毒液箭雨
            439680, -- 宇宙奇点
            432119, -- 消隐
        },
    },

    [1268] = { -- 驭雷栖巢 - The Rookery
        ["general"] = {
            430179, -- 渗透腐蚀
            317898, -- 致盲冰雨
            430814, -- 诱集暗影
            427616, -- 能量弹幕
            1214523, -- 饕餮虚空
            467907, -- 溃烂虚空
        },
        [2566] = { -- 凯里欧斯 - Kyrioss
            444250, -- 闪电涌流
            420679, -- 劲吹旋风
            1214324, -- 崩解闪电
        },
        [2567] = { -- 雷卫戈伦 - Stormguard Gorren
            424739, -- 混沌腐蚀
            426160, -- 黑暗引力
            424966, -- 徘徊虚空
            424797, -- 混沌脆弱
        },
        [2568] = { -- 虚空石畸体 - Voidstone Monstrosity
            458082, -- 驭雷者电荷
            429493, -- 释放腐蚀
            433067, -- 渗流碎片
        },
    },

    [1298] = { -- 水闸行动 - Operation: Floodgate
        ["general"] = {
            469799, -- 过载
            462737, -- 黑血创伤
            462771, -- 勘测光束
            472338, -- 勘探之地
            465120, -- 上紧发条
            474351, -- 碎切锯刃
            474388, -- 火焰喷射器
            1213803, -- 钉伤
            1215071, -- 浸电之水
            465830, -- 扭曲鲜血
            468680, -- 炸蟹
            468631, -- 鱼叉
            465820, -- 凶狠噬咬
            1213704, -- 飞艇弹幕
            465813, -- 昏睡毒液
            469811, -- 逆流
            468672, -- 钳夹
        },
        [2648] = { -- 老大娘 - Big M.O.M.M.A.
            473836, -- 电气重碾
            "473354", -- 音爆（目标）
            "473224", -- 音爆（Dot）
            473287, -- 超量电化
        },
        [2649] = { -- 破拆双人组 - Demolition Duo
            473713, -- 动能胶质炸药
            "470022", -- 滚桶冲锋
            "460965", -- 滚桶冲锋
            461994, -- 爆燃
        },
        [2650] = { -- 沼面 - Swampface
            "472819", -- 割喉藤蔓
            472878, -- 淤泥之爪
            473051, -- 汹涌怒涛
        },
        [2651] = { -- 吉泽尔·超震 - Geezle Gigazap
            466188, -- 雷霆重拳
            468815, -- 超力震击
            466124, -- 涡轮增压
            468723, -- 激荡之水
            468616, -- 跃动火花
            465982, -- 涡轮霹雳
            466124, -- 涡轮增压
        },
    },

    [1303] = { -- 奥尔达尼生态圆顶 - Eco-Dome Al'dani
        ["general"] = {
            1236981, -- 干扰手雷
            1221190, -- 暴食瘴气
            1235368, -- 奥术猛袭
            1222202, -- 奥术燃烧
            1222341, -- 幽暗之咬
            1231244, -- 不稳定的核心
            1221483, -- 电弧能量
            -- 1223000, -- 卡雷什之拥
        },
        [2675] = { -- 阿兹希卡 - Azhiccar
            1227745, -- 毒性反刍
            1217446, -- 消化唾沫
        },
        [2676] = { -- 塔尔·巴特和阿瓦兹吉 - Taah'bat and A'wazj
            1236130, -- 束缚的标枪
            1227918, -- 迁跃打击
            1219482, -- 裂隙利爪
        },
        [2677] = { -- 撰魂师 - Soul-Scribe
            1226444, -- 重伤的命运
        },
    },
}

F.LoadBuiltInDebuffs(debuffs)