---------------------------------------------------------------------
-- File: RaidDebuffs_TWW.lua
-- Author: enderneko (enderneko-dev@outlook.com)
-- Created : 2024-07-20 14:35 +08:00
-- Modified: 2024-10-05 22:10 +08:00
---------------------------------------------------------------------

local _, Cell = ...
local F = Cell.funcs

local debuffs = {
    [1278] = { -- 卡兹阿加
        ["general"] = {
        },
        [2637] = { -- 考尔达克，休眠的保护者
        },
        [2635] = { -- 惊魂聚合体
        },
        [2636] = { -- 修拉伊，地渊之海的暴虐者
        },
        [2625] = { -- 欧尔塔，破碎山峦
        },
    },

    [1273] = { -- 尼鲁巴尔王宫 - Nerub-ar Palace
        ["general"] = {
            449693, -- 威吓嚎叫
            459585, -- 致命瞄准
            436910, -- 扭曲之丝
            441382, -- 冰刺
            439198, -- 延宕毒液
            444414, -- 致疫倾泻
            446760, -- 垂涎之握
            433825, -- 鲜血盛宴
            458505, -- 剧毒之刃
            436784, -- 感染虫群
            449698, -- 毒刃创伤
            449705, -- 虚刃创伤
            441116, -- 深重呕吐
            441314, -- 撕裂伤口
            446846, -- 感染胆汁
            453131, -- 酸蚀之球
            454860, -- 感染之伤
            "446268", -- 锁定
            446253, -- 软泥痕迹
            448098, -- 吸取精华
            441630, -- 致死顺劈
            442052, -- 碎甲钢斩
            459923, -- 影丝诅咒
            445413, -- 喧啸
            444956, -- 剧毒释放
            444030, -- 薄纱编织
            444172, -- 荒芜风暴
            441402, -- 凝结寒霜
            459986, -- 奔涌虫群
            448060, -- 嫌恶妖术
            448257, -- 纠缠爆发
            "448148", -- 黑血
        },
        [2607] = { -- 噬灭者乌格拉克斯 - Ulgrax the Devourer
            455831, -- 硬化缠网
            439419, -- 追踪者缠网
            435138, -- 消化酸液
            439037, -- 开膛破肚
            457668, -- 噬肉角力
            434705, -- 暴捶（T）
            436255, -- 主宰冲锋
            438657, -- 巨型块状物
            440904, -- 吞噬
            -435136, -- 剧毒鞭击
            -438012, -- 饥饿之嚎
            -455847, -- 伤痕累累
        },
        [2611] = { -- 血缚恐魔 - The Bloodbound Horror
            443042, -- 异世之握
            443612, -- 阴森呕吐
            442656, -- 呕吐出血
            445518, -- 黑血
            442604, -- 瘀液喷撒
            -445570, -- 无明凋零
            -452245, -- 血液凝阻
            -443305, -- 猩红之雨
        },
        [2599] = { -- 苏雷吉队长席克兰 - Sikran
            439191, -- 诛灭
            438845, -- 暴露（T）
            435410, -- 相位贯突（T）
            434860, -- 相位之刃
            459273, -- 宇宙碎片
            459785, -- 宇宙残渣
            "458277", -- 粉碎横扫（15码内易伤）
            "-464442", -- 粉碎横扫
        },
        [2609] = { -- 拉夏南 - Rasha'nan
            456170, -- 喷射丝线
            460789, -- 粘稠蛛丝
            439815, -- 被感染的子嗣
            439786, -- 酸液翻腾
            439787, -- 酸蚀昏迷
            458067, -- 野蛮创伤（T）
            455287, -- 感染撕咬
            439785, -- 腐蚀
            440193, -- 萦绕侵蚀
            439792, -- 粘稠迸发（近战范围内没有人）
            439780, -- 粘性蛛网
            439776, -- 酸液池
        },
        [2612] = { -- 虫巢扭曲者欧维纳克斯 - Broodtwister Ovi'nax
            446349, -- 粘性之网
            "440421", -- 试验性剂量
            "441362", -- 不稳定的混合物（T，爆炸）
            442257, -- 感染
            442250, -- 锁定
            446351, -- 蛛网喷发（定身）
            "442660", -- 试验性剂量（吸奶盾）
            "441368", -- 不稳定的混合物（T，易伤）
            442799, -- 腥红溢流
            450661, -- 腐灼反应（黑血孵化卵）
            443274, -- 不稳定的灌能（全员吸奶盾）
            442437, -- 摄食黑血（全员吸奶盾）
        },
        [2601] = { -- 节点女亲王凯威扎 - Nexus-Princess Ky'veza
            437343, -- 女王之灾
            436870, -- 奇袭
            440576, -- 深凿重创（T）
            440377, -- 虚空溃灭（T）
            436671, -- 冷血弑君
        },
        [2608] = { -- 流丝之庭 - The Silken Court
            -- high
            438708, -- 针刺虫群
            440001, -- 束缚之网
            449857, -- 被刺穿
            450129, -- 熵能废灭
            -- medium
            438773, -- 破碎护壳
            438749, -- 甲虫锁定
            438218, -- 穿刺打击（T）
            438200, -- 毒液箭（T）
            441772, -- 虚空箭（T）
            -- low
            438656, -- 剧毒之雨
            463461, -- 熵能脆弱
            460600, -- 熵能弹幕
            460364, -- 地震岩层
            -- disabled
            -463464, -- 地震脆弱
            -460360, -- 掘进喷发
            -438355, -- 灾变熵能
            -451086, -- 熵能之网
            -454311, -- 倒钩之网
            "-441626", -- 蛛网漩涡
            "-441788", -- 蛛网漩涡
        },
        [2602] = { -- 安苏雷克女王 - Queen Ansurek
            -- high
            437586, -- 活性毒素
            451278, -- 浓缩毒素
            438974, -- 皇谕责罚
            443903, -- 深渊倾注
            447967, -- 晦暗之触
            445152, -- 侍僧精华
            438804, -- 剧毒新星
            445818, -- 吐沫的饕餮者
            -- medium
            464638, -- 泛沫毒素
            448660, -- 酸蚀箭
            "439829", -- 流丝之墓
            436800, -- 液化（T）
            455404, -- 盛宴（T）
            443342, -- 啃噬（T）
            443656, -- 感染（T）
            449236, -- 腐蚀锐牙（T）
            -- low
            441556, -- 反应蒸汽
            445877, -- 泛沫蒸汽
            441872, -- 皇家虫茧
            439536, -- 网刃
            437078, -- 酸池
            441958, -- 勒握流丝
            443403, -- 阴霾
            446012, -- 精华创裂
            447532, -- 麻痹毒液
            448461, -- 寰宇天启
            449944, -- 酸蚀天启
            -- disabled
            -455387, -- 深渊回响
            "-439825", -- 流丝之墓
            -441865, -- 皇家镣铐
            -447170, -- 掠食之丝
            -445623, -- 暴食之丝
            -464628, -- 反应创伤
        },
    },

    [1274] = { -- 千丝之城
        ["general"] = {
            443401, -- 剧毒打击
            443437, -- 疑之影
            443438, -- 怀疑
            450783, -- 香水投掷
            443432, -- 流丝缠缚
            -- 443430, -- 流丝缠缚
            446718, -- 晦幽纺纱
            443435, -- 扭曲思绪
            448047, -- 裹体之网
            451426, -- 纱网弹幕
            461630, -- 毒性喷吐
            451239, -- 残暴戳刺
            451295, -- 虚空奔袭
            452151, -- 严酷戳刺
            443509, -- 贪婪之虫
            445812, -- 黑暗弹幕
            443427, -- 蛛网箭
            451309, -- 女王之眼
            -- 448305, -- 窃取之力
        },
        [2594] = { -- 演说者基克斯威兹克
            448561, -- 疑之影
            434779, -- 惊魂恫吓
            448562, -- 怀疑
            434722, -- 压制
            434926, -- 残存影响
            440310, -- 压迫之链
        },
        [2595] = { -- 女王之牙
            440238, -- 寒冰镰刀
            439692, -- 暮落
            441298, -- 冰冻之血
            440107, -- 飞刀投掷
        },
        [2600] = { -- 凝结聚合体
            442285, -- 腐化附层
            461842, -- 溢流猛击
            -- 461989, -- 溢流猛击
            445435, -- 黑血
        },
        [2596] = { -- 大捻接师艾佐
            439324, -- 晦幽纺纱
            439646, -- 汰劣程序
            439341, -- 捻接
        },
    },

    [1267] = { -- 圣焰隐修院
        ["general"] = {
            424420, -- 余烬冲击
            424621, -- 蛮力重击
            427635, -- 痛苦撕裂
            453461, -- 铁蒺藜
            424426, -- 跃进打击
            427621, -- 穿刺
            435148, -- 炽热打击
            -- 435165, -- 炽热打击
            444705, -- 神圣风暴
            426964, -- 致死打击
            451764, -- 辉耀烈焰
            427900, -- 熔岩池
            427473, -- 烈焰风暴
            424430, -- 奉献
            427897, -- 热浪
            448492, -- 雷霆一击
        },
        [2571] = { -- 戴尔克莱上尉
            427583, -- 忏悔
            447272, -- 掷矛
            424414, -- 贯穿护甲
            447439, -- 野蛮重殴
            -- 447443, -- 野蛮重殴
            448515, -- 神圣审判
        },
        [2570] = { -- 布朗派克男爵
            423051, -- 灼烧之光
            -- 446657, -- 灼烧之光
            423015, -- 谴罚者之盾
            -- 446649, -- 谴罚者之盾
        },
        [2573] = { -- 隐修院长穆普雷
            451606, -- 神圣烈焰
            425556, -- 神圣之地
        },
    },

    [1210] = { -- 暗焰裂口
        ["general"] = {
            423654, -- 真疼！
            426883, -- 梆！
            428650, -- 燃烧反冲
            426277, -- 只手擒拿
            426295, -- 烈焰系链
            427929, -- 恶毒啮咬
            428019, -- 闪点
            440653, -- 激涌之蜡
            "-420307", -- 烛光
        },
        [2569] = { -- 老蜡须
            423693, -- 诱引烛焰
            422245, -- 穿岩凿
            443694, -- 粗制武器
        },
        [2559] = { -- 布雷炙孔
            421817, -- 点芯弹幕
            -- 421638, -- 点芯弹幕
            424223, -- 点燃
        },
        [2560] = { -- 蜡烛之王
            426145, -- 偏执失心
            422648, -- 暗焰之锄
            421146, -- 投掷暗焰
            421067, -- 熔化蜡油
            426127, -- 黑暗之光
        },
        [2561] = { -- 黑暗之主
            427015, -- 暗影冲击
            461460, -- 热浪激增
            427180, -- 畏惧晦幽
            426943, -- 晦幽骤兴
            422806, -- 扼息暗影
            "-422807", -- 烛光
        },
    },

    [1272] = { -- 燧酿酒庄
        ["general"] = {
            442589, -- 蜂蜡
            435000, -- 飞肉直下
            441397, -- 蜂毒
            449090, -- 鲁莽搬运
            453810, -- 酒精炸药
            463220, -- 烈性酒桶
            439468, -- 风向逆转
            463227, -- 破片入体
            442995, -- 蜂拥惊喜
            440687, -- 蜂蜜齐射
            441179, -- 泛涌蜂蜜
        },
        [2586] = { -- 酿造大师阿德里尔
            437956, -- 迸发地狱火
            434707, -- 燧酿飞掷
            432182, -- 投掷燧酿
            434773, -- 杯卑磕砸
            437721, -- 沸燃烈焰
            431897, -- 吵闹喧哗
            432196, -- 滚烫蜜糖
        },
        [2587] = { -- 艾帕
            439325, -- 燃烧发酵
        },
        [2588] = { -- 本克·鸣蜂
            "440134", -- 蜂蜜料汁
            439586, -- 振翼之风
            438975, -- 碎肉针刺
            "440141", -- 蜂蜜料汁
        },
        [2589] = { -- 戈尔迪·底爵
            436624, -- 点钞大炮
            "436640", -- 燃焰弹射
            "436644", -- 燃焰弹射
        },
    },

    [1269] = { -- 矶石宝库
        ["general"] = {
            449455, -- 咆哮恐惧
            429545, -- 噤声齿轮
            448975, -- 重盾奔袭
            425027, -- 地震波
            426308, -- 虚空感染
            427361, -- 破裂
            428887, -- 碾碎
            449154, -- 熔岩迫击炮
            445207, -- 穿透哀嚎
            464876, -- 震荡跃击
            425974, -- 震地
            -- 449129, -- 熔岩重炮
        },
        [2572] = { -- E.D.N.A.
            424889, -- 震地回响
            424795, -- 折光射线
            -- 424893, -- 石盾
            424913, -- 不稳定的爆炸
        },
        [2579] = { -- 斯卡莫拉克
            423572, -- 不稳定的能量
            -- 435813, -- 不稳定的能量
            443494, -- 结晶喷发
        },
        [2590] = { -- 机械大师
            428547, -- 废料块
            449169, -- 熔岩重炮
            463145, -- 熔岩波
            429999, -- 烈焰废料
            428819, -- 排放口
            -- 443954, -- 排放口
            428161, -- 熔铁之水
        },
        [2582] = { -- 虚空代言人艾里克
            427329, -- 虚空腐蚀
            457465, -- 熵灭
        },
    },

    [1270] = { -- 破晨号
        ["general"] = {
            "451115", -- 恐惧猛击
            432448, -- 冥河之种
            451107, -- 迸发虫茧
            451098, -- 黏性新星
            431309, -- 诱捕暗影
            431350, -- 折磨喷发
            431365, -- 折磨光束
            431491, -- 污邪斩击
            451119, -- 深渊轰击
            453345, -- 深渊朽烂
            449332, -- 渗透暗影
        },
        [2580] = { -- 代言人夏多克朗
            426735, -- 燃烧之影
            453214, -- 黑曜光束
            426736, -- 暗影之幕
            453173, -- 塌缩之夜
        },
        [2581] = { -- 阿努布伊卡基
            "427007", -- 恐惧猛击
            431333, -- 折磨射线
            427378, -- 黑暗伤痕
            431494, -- 黑刃之锋
        },
        [2593] = { -- 拉夏南
            434113, -- 喷射丝线
            434576, -- 酸蚀昏迷
            434441, -- 酸液翻腾
            463428, -- 萦绕侵蚀
            434668, -- 火花四射的阿拉希炸弹
            435793, -- 粘稠迸发
            434655, -- 阿拉希炸弹
            434579, -- 腐蚀
            448215, -- 缠网喷吐
            438957, -- 酸液池
            434096, -- 粘性蛛网
        },
    },

    [1271] = { -- 艾拉-卡拉，回响之城
        ["general"] = {
            "433843", -- 爆发蛛网
            434252, -- 野蛮猛击
            448248, -- 恶臭齐射
            433841, -- 毒液箭雨
            436322, -- 毒液箭
            436401, -- 啊呃！
            438599, -- 放血戳刺
            438825, -- 毒云
            -- 433662, -- 抓握之血
        },
        [2583] = { -- 阿瓦诺克斯
            439070, -- 饥肠辘辘
            439200, -- 贪食撕咬
            438618, -- 毒性喷吐
            434830, -- 邪恶缠网
            434083, -- 伏击
        },
        [2584] = { -- 阿努布泽克特
            433740, -- 感染
            442210, -- 流丝束缚
            433781, -- 无休虫群
        },
        [2585] = { -- 收割者吉卡塔尔
            432031, -- 抓握之血
            "432132", -- 爆发蛛网
            461487, -- 培植毒药
            317898, -- 致盲冰雨
            439680, -- 宇宙奇点
            432119, -- 消隐
        },
    },

    [1268] = { -- 驭雷栖巢
        ["general"] = {
            430179, -- 渗透腐蚀
            317898, -- 致盲冰雨
            430814, -- 诱集暗影
        },
        [2566] = { -- 凯里欧斯
        },
        [2567] = { -- 雷卫戈伦
            424739, -- 混沌腐蚀
            426160, -- 黑暗引力
            424966, -- 徘徊虚空
        },
        [2568] = { -- 虚空石畸体
            458082, -- 驭雷者电荷
            429493, -- 释放腐蚀
            433067, -- 渗流碎片
        },
    },
}

F:LoadBuiltInDebuffs(debuffs)