---------------------------------------------------------------------
-- File: Cell\RaidDebuffs\RaidDebuffs_Classic.lua
-- Author: enderneko (enderneko-dev@outlook.com)
-- Created : 2022-08-05 17:46:11 +08:00
-- Modified: 2026-01-22 19:01 +08:00
---------------------------------------------------------------------

local _, Cell = ...
local F = Cell.funcs

local debuffs = {
    [741] = { -- 熔火之心
        ["general"] = {
            19366, -- 灼烧之焰
            15732, -- 献祭
        },
        [1519] = { -- 鲁西弗隆
            19702, -- 末日迫近
            19703, -- 鲁西弗隆的诅咒
            20604, -- 统御意志
        },
        [1520] = { -- 玛格曼达
            19428, -- 燃烧
            19450, -- 熔岩喷吐
            19408, -- 恐慌
        },
        [1521] = { -- 基赫纳斯
            19717, -- 火焰之雨
            15502, -- 破甲攻击
            19730, -- 打击
            20277, -- 拉格纳罗斯之拳
            19716, -- 基赫纳斯的诅咒
        },
        [1522] = { -- 加尔
            15732, -- 献祭
        },
        [1523] = { -- 沙斯拉尔
            19713, -- 沙斯拉尔的诅咒
        },
        [1524] = { -- 迦顿男爵
            20475, -- 活化炸弹
            19659, -- 点燃法力
        },
        [1525] = { -- 萨弗隆先驱者
            19780, -- 拉格纳罗斯之手
            -- 19776, -- 暗言术:痛
            19777, -- 黑暗打击
            20294, -- 献祭
        },
        [1526] = { -- 焚化者古雷曼格
            13880, -- 熔岩喷溅
            19820, -- 裂伤
            20228, -- 炎爆术
        },
        [1527] = { -- 管理者埃克索图斯
            20229, -- 冲击波
            19369, -- 上古绝望
            19635, -- 煽动烈焰
            19367, -- 枯萎热浪
            19365, -- 上古恐慌
            19776, -- 暗言术:痛
            19393, -- 灵魂燃烧
            47836, -- 腐蚀之种
            55360, -- 活动炸弹
            19372, -- 上古恐惧
        },
        [1528] = { -- 拉格纳罗斯
        },
    },

    [742] = { -- 黑翼之巢
        ["general"] = {
        },
        [1529] = { -- 狂野的拉佐格尔
        },
        [1530] = { -- 堕落的瓦拉斯塔兹
        },
        [1531] = { -- 勒什雷尔
        },
        [1532] = { -- 费尔默
        },
        [1533] = { -- 埃博诺克
        },
        [1534] = { -- 弗莱格尔
        },
        [1535] = { -- 克洛玛古斯
        },
        [1536] = { -- 奈法利安
        },
    },

    [743] = { -- 安其拉废墟
        ["general"] = {
        },
        [1537] = { -- 库林纳克斯
        },
        [1538] = { -- 拉贾克斯将军
        },
        [1539] = { -- 莫阿姆
        },
        [1540] = { -- 吞咽者布鲁
        },
        [1541] = { -- 狩猎者阿亚米斯
        },
        [1542] = { -- 无疤者奥斯里安
        },
    },

    [744] = { -- 安其拉神殿
        ["general"] = {
        },
        [1543] = { -- 预言者斯克拉姆
        },
        [1547] = { -- 安其拉三宝
        },
        [1544] = { -- 沙尔图拉
        },
        [1545] = { -- 顽强的范克瑞斯
        },
        [1548] = { -- 维希度斯
        },
        [1546] = { -- 哈霍兰公主
        },
        [1549] = { -- 双子皇帝
        },
        [1550] = { -- 奥罗
        },
        [1551] = { -- 克苏恩
        },
    },

    [745] = { -- 纳克萨玛斯
        ["general"] = {
        },
        [1552] = { -- 阿努布雷坎
        },
        [1553] = { -- 黑女巫法琳娜
        },
        [1554] = { -- 迈克斯纳
        },
        [1555] = { -- 药剂师诺斯
        },
        [1556] = { -- 肮脏的希尔盖
        },
        [1557] = { -- 洛欧塞布
        },
        [1558] = { -- 教官拉苏维奥斯
        },
        [1559] = { -- 收割者戈提克
        },
        [1560] = { -- 天启四骑士
        },
        [1561] = { -- 帕奇维克
        },
        [15562] = { -- 格罗布鲁斯
        },
        [1563] = { -- 格拉斯
        },
        [1564] = { -- 塔迪乌斯
        },
        [1565] = { -- 萨菲隆
        },
        [1566] = { -- 克尔苏加德
        },
    },

    [309] = { -- 祖尔格拉布
        ["general"] = {
            23931, -- 雷霆一击
            24002, -- 宁神毒药
            24003, -- 宁神毒药
            24011, -- 毒液喷吐
            24063, -- 疾病之云
            24321, -- 酸性血液
            24778, -- 沉睡
            24818, -- 毒性吐息
            24839, -- 酸液吐息
            24840, -- 毒云
        },
        [784] = { -- 高阶祭司温诺希斯
            23849, -- 温诺希斯变形
            23860, -- 神圣之火
            23861, -- 毒云
            23862, -- 毒液喷吐
            23865, -- 寄生蛇
            23895, -- 恢复
            24688, -- 温诺希斯的守护
        },
        [785] = { -- 高阶祭司耶克里克
            22884, -- 心灵尖啸
            23918, -- 音爆
            23919, -- 猛扑
            23952, -- 暗言术：痛
            23953, -- 精神鞭笞
            23966, -- 耶克里克变形
            24004, -- 沉睡
        },
        [786] = { -- 高阶祭司玛尔里
            24084, -- 玛尔里的变形术
            24097, -- 中毒
            24099, -- 毒液箭雨
            24109, -- 放大
            24110, -- 包围之网
            24111, -- 腐蚀毒药
            24300, -- 吸取生命
        },
        [787] = { -- 血领主曼多基尔
            16856, -- 致死打击
            24314, -- 威慑凝视
            24317, -- 破甲
            24318, -- 狂乱
            24573, -- 致死打击
        },
        [788] = { -- 疯狂之缘
            8269, -- 狂乱
            24157, -- 不祥的妖术
            24327, -- 疯狂
            24388, -- 脑部损伤
            24415, -- 减速
            24646, -- 天神下凡
            24664, -- 睡眠
            24674, -- 暗影迷雾
            24683, -- 落雷之云
            24698, -- 凿击
            24699, -- 消失
        },
        [789] = { -- 高阶祭司塞卡尔
            12540, -- 凿击
            21060, -- 致盲
            24331, -- 斜掠
            24332, -- 斜掠
            24333, -- 毁灭
        },
        [790] = { -- 加兹兰卡
            16099, -- 冰霜吐息
            -- 24326, -- 加兹兰卡猛击：直接伤害/击退，没有玩家 aura，RaidDebuffs 无法显示。
        },
        [791] = { -- 高阶祭司娅尔罗
            24190, -- 娅尔罗变形
            24210, -- 娅尔罗的印记
            24212, -- 暗言术：痛
            24223, -- 消失
            24339, -- 感染撕咬
        },
        [792] = { -- 妖术师金度
            17172, -- 妖术
            24053, -- 妖术
            24261, -- 洗脑
            24300, -- 吸取生命
            24306, -- 金度的欺骗
            24600, -- 织网
            24618, -- 吸取生命
        },
        [793] = { -- 哈卡
            24178, -- 哈卡的意志
            24322, -- 血液虹吸
            24323, -- 血液虹吸
            24324, -- 血液虹吸
            24327, -- 疯狂
            24328, -- 堕落之血
            24673, -- 血之诅咒
            24686, -- 玛尔里的守护
            24687, -- 耶克里克的守护
            24688, -- 温诺希斯的守护
            24689, -- 塞卡尔的守护
            24690, -- 娅尔罗的守护
        },
    },

    [234] = { -- 剃刀沼泽
        ["general"] = {
        },
        [896] = { -- 猎手布塔斯克
        },
        [895] = { -- 鲁古格
        },
        [899] = { -- 督军拉姆塔斯
        },
        [900] = { -- 盲眼猎手格罗亚特
        },
        [901] = { -- 卡尔加·刺肋
        },
    },

    [233] = { -- 剃刀高地
        ["general"] = {
        },
        [1142] = { -- 阿鲁克斯
        },
        [433] = { -- 火眼莫德雷斯
        },
        [1143] = { -- 麦什伦
        },
        [1146] = { -- 亡语者布莱克松
        },
        [1141] = { -- 寒冰之王亚门纳尔
        },
    },

    [230] = { -- 厄运之槌
        ["general"] = {
        },
        [402] = { -- 瑟雷姆·刺蹄
        },
        [403] = { -- 海多斯博恩
        },
        [404] = { -- 蕾瑟塔蒂丝
        },
        [405] = { -- 荒野变形者奥兹恩
        },
        [406] = { -- 特迪斯·扭木
        },
        [407] = { -- 伊琳娜·暗木
        },
        [408] = { -- 卡雷迪斯镇长
        },
        [409] = { -- 伊莫塔尔
        },
        [410] = { -- 托塞德林王子
        },
        [411] = { -- 卫兵摩尔达
        },
        [412] = { -- 践踏者克雷格
        },
        [413] = { -- 卫兵芬古斯
        },
        [414] = { -- 卫兵斯里基克
        },
        [415] = { -- 克罗卡斯
        },
        [416] = { -- 观察者克鲁什
        },
        [417] = { -- 戈多克大王
        },
    },

    [240] = { -- 哀嚎洞穴
        ["general"] = {
        },
        [474] = { -- 安娜科德拉
        },
        [476] = { -- 皮萨斯
        },
        [475] = { -- 考布莱恩
        },
        [477] = { -- 克雷什
        },
        [478] = { -- 斯卡姆
        },
        [479] = { -- 瑟芬迪斯
        },
        [480] = { -- 永生者沃尔丹
        },
        [481] = { -- 吞噬者穆坦努斯
        },
    },

    [239] = { -- 奥达曼
        ["general"] = {
        },
        [467] = { -- 鲁维罗什
        },
        [468] = { -- 失踪的矮人
        },
        [469] = { -- 艾隆纳亚
        },
        [748] = { -- 黑曜石哨兵
        },
        [470] = { -- 远古巨石卫士
        },
        [471] = { -- 加加恩·火锤
        },
        [472] = { -- 格瑞姆洛克
        },
        [473] = { -- 阿扎达斯
        },
    },

    [64] = { -- 影牙城堡
        ["general"] = {
        },
        [96] = { -- 灰葬男爵
        },
        [97] = { -- 席瓦莱恩男爵
        },
        [98] = { -- 指挥官斯普林瓦尔
        },
        [99] = { -- 沃登勋爵
        },
        [100] = { -- 高弗雷勋爵
        },
    },

    [226] = { -- 怒焰裂谷
        ["general"] = {
        },
        [694] = { -- 阿达罗格
        },
        [695] = { -- 黑暗萨满柯兰萨
        },
        [696] = { -- 焰喉
        },
        [697] = { -- 熔岩守卫戈多斯
        },
    },

    [236] = { -- 斯坦索姆
        ["general"] = {
        },
        [443] = { -- 弗雷斯特恩
        },
        [445] = { -- 悲惨的提米
        },
        [749] = { -- 指挥官玛洛尔
        },
        [446] = { -- 希望破坏者威利
        },
        [448] = { -- 档案管理员加尔福特
        },
        [449] = { -- 巴纳扎尔
        },
        [450] = { -- 不可宽恕者
        },
        [451] = { -- 安娜丝塔丽男爵夫人
        },
        [452] = { -- 奈鲁布恩坎
        },
        [453] = { -- 苍白的玛勒基
        },
        [454] = { -- 巴瑟拉斯镇长
        },
        [455] = { -- 吞咽者拉姆斯登
        },
        [456] = { -- 奥里克斯·瑞文戴尔领主
        },
    },

    [63] = { -- 死亡矿井
        ["general"] = {
        },
        [89] = { -- 格拉布托克
        },
        [90] = { -- 赫利克斯·破甲
        },
        [91] = { -- 死神5000
        },
        [92] = { -- 撕心狼将军
        },
        [93] = { -- “船长”曲奇
        },
    },

    [232] = { -- 玛拉顿
        ["general"] = {
        },
        [423] = { -- 诺克赛恩
        },
        [424] = { -- 锐刺鞭笞者
        },
        [425] = { -- 工匠吉兹洛克
        },
        [427] = { -- 维利塔恩
        },
        [428] = { -- 被诅咒的塞雷布拉斯
        },
        [429] = { -- 兰斯利德
        },
        [430] = { -- 洛特格里普
        },
        [431] = { -- 瑟莱德丝公主
        },
    },

    [238] = { -- 监狱
        ["general"] = {
        },
        [464] = { -- 霍格
        },
        [465] = { -- 灼热勋爵
        },
        [466] = { -- 兰多菲·摩洛克
        },
    },

    [241] = { -- 祖尔法拉克
        ["general"] = {
        },
        [483] = { -- 加兹瑞拉
        },
        [484] = { -- 安图苏尔
        },
        [485] = { -- 殉教者塞卡
        },
        [486] = { -- 巫医祖穆拉恩
        },
        [487] = { -- 耐克鲁姆和塞瑟斯
        },
        [489] = { -- 乌克兹·沙顶
        },
    },

    [316] = { -- 血色修道院
        ["general"] = {
        },
        [688] = { -- 裂魂者萨尔诺斯
        },
        [671] = { -- 科洛夫修士
        },
        [674] = { -- 大检察官怀特迈恩
        },
    },

    [311] = { -- 血色大厅
        ["general"] = {
        },
        [660] = { -- 驯犬者布兰恩
        },
        [654] = { -- 武器大师哈兰
        },
        [656] = { -- 织焰者孔格勒
        },
    },

    [231] = { -- 诺莫瑞根
        ["general"] = {
        },
        [419] = { -- 格鲁比斯
        },
        [420] = { -- 粘性辐射尘
        },
        [421] = { -- 电刑器6000型
        },
        [418] = { -- 群体打击者9-60
        },
        [422] = { -- 机械师瑟玛普拉格
        },
    },

    [246] = { -- 通灵学院
        ["general"] = {
        },
        [659] = { -- 指导者寒心
        },
        [663] = { -- 詹迪斯·巴罗夫
        },
        [665] = { -- 血骨傀儡
        },
        [666] = { -- 莉莉安·沃斯
        },
        [684] = { -- 黑暗院长加丁
        },
    },

    [237] = { -- 阿塔哈卡神庙
        ["general"] = {
        },
        [457] = { -- 哈卡的化身
        },
        [458] = { -- 预言者迦玛兰
        },
        [459] = { -- 梦境守望者
        },
        [463] = { -- 伊兰尼库斯的阴影
        },
    },

    [227] = { -- 黑暗深渊
        ["general"] = {
        },
        [368] = { -- 加摩拉
        },
        [436] = { -- 多米尼娜
        },
        [426] = { -- 征服者克鲁尔
        },
        [1145] = { -- 苏克
        },
        [447] = { -- 深渊守护者
        },
        [1144] = { -- 刽子手戈尔
        },
        [437] = { -- 暮光领主巴赛尔
        },
        [444] = { -- 阿库麦尔
        },
    },

    [229] = { -- 黑石塔下层
        ["general"] = {
        },
        [388] = { -- 欧莫克大王
        },
        [389] = { -- 暗影猎手沃什加斯
        },
        [390] = { -- 指挥官沃恩
        },
        [391] = { -- 烟网蛛后
        },
        [392] = { -- 尤洛克·暗嚎
        },
        [393] = { -- 军需官兹格雷斯
        },
        [394] = { -- 哈雷肯
        },
        [395] = { -- 奴役者基兹鲁尔
        },
        [396] = { -- 维姆萨拉克
        },
    },

    [228] = { -- 黑石深渊
        ["general"] = {
        },
        [369] = { -- 审讯官格斯塔恩
        },
        [370] = { -- 洛考尔
        },
        [371] = { -- 驯犬者格雷布玛尔
        },
        [372] = { -- 秩序竞技场
        },
        [373] = { -- 控火师罗格雷恩
        },
        [374] = { -- 伊森迪奥斯
        },
        [375] = { -- 典狱官斯迪尔基斯
        },
        [376] = { -- 弗诺斯·达克维尔
        },
        [377] = { -- 贝尔加
        },
        [378] = { -- 怒炉将军
        },
        [379] = { -- 傀儡统帅阿格曼奇
        },
        [380] = { -- 霍尔雷·黑须
        },
        [381] = { -- 法拉克斯
        },
        [383] = { -- 普拉格
        },
        [384] = { -- 弗莱拉斯总大使
        },
        [385] = { -- 黑铁七贤
        },
        [386] = { -- 玛格姆斯
        },
        [387] = { -- 达格兰·索瑞森大帝
        },
    },
}

F.LoadBuiltInDebuffs(debuffs)
