---------------------------------------------------------------------
-- File: Cell\RaidDebuffs\RaidDebuffs_MoP.lua
-- Author: enderneko (enderneko-dev@outlook.com)
-- Created : 2022-08-05 16:10:47 +08:00
-- Modified: 2025-08-04 00:47 +08:00
---------------------------------------------------------------------

local _, Cell = ...
local F = Cell.funcs

local debuffs = {
    [322] = { -- 潘达利亚
        [691] = { -- 怒之煞
        },
        [725] = { -- 萨莱斯的兵团
        },
        [814] = { -- 暴风领主纳拉克
        },
        [826] = { -- 乌达斯塔
        },
        [857] = { -- 朱鹤赤精
        },
        [858] = { -- 青龙玉珑
        },
        [859] = { -- 玄牛砮皂
        },
        [860] = { -- 白虎雪怒
        },
        [861] = { -- 野牛人火神斡耳朵斯
        },
    },

    [317] = { -- 魔古山宝库
        ["general"] = {
        },
        [679] = { -- 石头守卫
            115877, -- 完全石化
            116281, -- 蓝晶冲击
            125206, -- 撕裂肉体
            116199, -- 活体蓝晶
            116301, -- 活体青玉
            116304, -- 活体红玉
            116322, -- 活体紫晶
            130774, -- 紫晶之池
        },
        [689] = { -- 受诅者魔封
            116784, -- 野性火花
            116374, -- 闪电充能
            116577, -- 奥术回响
            116942, -- 烈焰之矛
            131788, -- 闪电鞭笞
            131790, -- 奥术震击
            131792, -- 暗影灼烧
            -116040, -- 震中
        },
        [682] = { -- 缚灵者戈拉亚
            116278, -- 灵魂撕裂
            116161, -- 灵魂越界
            122181, -- 通往灵魂世界的通道
            117723, -- 脆弱灵魂
            122151, -- 巫毒娃娃
        },
        [687] = { -- 先王之魂
            118135, -- 重箭钉体
            118303, -- 注视
            117708, -- 癫狂之吼
            118163, -- 巧取豪夺
            118048, -- 被掠夺
            117829, -- 怯懦
        },
        [726] = { -- 伊拉贡
            117949, -- 封闭回路
            -117878, -- 能量超载
            -117870, -- 泰坦之触
        },
        [677] = { -- 皇帝的意志
            116835, -- 毁灭之弧
            116550, -- 充能粉碎
            116969, -- 践踏
            116829, -- 专注能量
            116525, -- 专注打击
            116778, -- 专注防御
            -116782, -- 泰坦寒气
            -116818, -- 磁力吸附
            -117854, -- 机不可失
            -132422, -- 机不可失
            -117195, -- 磁力吸附
            -- 132425, -- 践踏
        },
    },

    [330] = { -- 恐惧之心
        ["general"] = {
        },
        [745] = { -- 皇家宰相佐尔洛克
            122761, -- 吐气
            123812, -- 狂热信息素
            122706, -- 噪音取消
        },
        [744] = { -- 刀锋领主塔亚克
            123017, -- 无影击
            123474, -- 压制突袭
            123180, -- 疾风步
        },
        [713] = { -- 加拉隆
            122835, -- 信息素
            123081, -- 敏感
            122774, -- 重碾
        },
        [741] = { -- 风领主梅尔加拉克
            121881, -- 琥珀监牢
            121885, -- 琥珀监牢
            123963, -- 库尔提克打击
            122064, -- 腐蚀树脂
            122055, -- 残渣
        },
        [737] = { -- 琥珀塑形者昂舒克
            125502, -- 琥珀信标
            121949, -- 寄生增长
            122395, -- 无法动弹
            124802, -- 易伤
            "122784", -- 生命重塑
            "122370", -- 生命重塑
        },
        [743] = { -- 大女皇夏柯希尔
            123713, -- 女皇的仆从
            "124862", -- 死亡幻像
            "124863", -- 死亡幻像
            123707, -- 女皇邪眼
            124777, -- 毒液炸弹
            123788, -- 恐怖嚎叫
            124849, -- 恐惧吞噬
            123845, -- 恐惧之心
            124097, -- 粘稠树脂
            125390, -- 凝视
            125283, -- 煞能腐蚀
            124821, -- 浸毒护甲
            123184, -- 不谐力场
            126122, -- 腐蚀不谐力场
        },
    },

    [320] = { -- 永春台
        ["general"] = {
        },
        [683] = { -- 无尽守护者
            118186, -- 大型恐惧精华
            117519, -- 煞能之触
            117353, -- 无可抗拒的腐蚀
            118191, -- 堕落精华
            118091, -- 大地污染
            -117235, -- 被净化
        },
        [742] = { -- 烛龙
            122777, -- 梦魇
            123011, -- 暗影恐怖
            123036, -- 惊恐
            122752, -- 暗影吐息
            122768, -- 恐惧之影
            122789, -- 阳光
            123716, -- 灼日圣光
            -- 123012, -- 暗影恐怖
        },
        [729] = { -- 雷施
            123121, -- 喷射
            123705, -- 恐怖迷雾
            -123712, -- 恐怖迷雾
        },
        [709] = { -- 惧之煞
            119086, -- 穿刺之箭
            119775, -- 伸展打击
            120629, -- 因畏惧而蜷缩
            120669, -- 赤裸惊恐
            120388, -- 追寻光芒
            "125786", -- 恐惧吐息
            "119414", -- 恐惧吐息
            "119985", -- 恐惧喷射
            "119983", -- 恐惧喷射
            120519, -- 龙卷水涌
            129147, -- 不祥蔑笑
            -129189, -- 煞能宝珠
        },
    },

    [362] = { -- 雷电王座
        ["general"] = {
        },
        [827] = { -- 击碎者金罗克
            138732, -- 电离反应
            137422, -- 专注闪电
            137371, -- 雷霆投掷
            137162, -- 静电爆炸
            138349, -- 静电创伤
            138006, -- 浸电之水
            138002, -- 流体
            -137507, -- 内爆
        },
        [819] = { -- 赫利东
            136708, -- 岩石凝视
            136512, -- 混乱妖术
            136710, -- 致命瘟疫
            136719, -- 耀眼阳光
            136587, -- 毒箭之雨
            136767, -- 三重穿刺
            140946, -- 恐怖凝视
            136654, -- 撕裂冲锋
            136670, -- 致死打击
            136573, -- 寒冰箭
        },
        [816] = { -- 长者议会
            136857, -- 定身
            "136910", -- 冰寒突击
            "136903", -- 冰寒突击
            136878, -- 诱捕
            136860, -- 流沙
            136922, -- 霜寒刺骨
            137084, -- 身体发热
            137085, -- 透骨之寒

        },
        [825] = { -- 托多斯
            140701, -- 晶化甲壳：临界值！
            137633, -- 晶化甲壳
            134920, -- 震地践踏
        },
        [821] = { -- 墨格瑞拉
            140179, -- 压制
            139822, -- 燃烬
            139857, -- 寒冰洪流
            "139844", -- 极寒冰流
            "139843", -- 极寒冰流
            137731, -- 燃烧血肉
            139840, -- 腐蚀护甲
            139993, -- 魔力散射
            "139922", -- 冰封地面
            "-139909", -- 冰封地面
        },
        [828] = { -- 季鹍
            "134256", -- 黏呼呼的
            140092, -- 感染之爪
            134366, -- 爪掠
            "138309", -- 黏呼呼的
            138319, -- 饲料池
            -140571, -- 伊卡罗斯的教训
        },
        [818] = { -- 遗忘者杜鲁姆
            139202, -- 蓝光追踪
            139204, -- 红光追踪
            133597, -- 黑暗寄生
            137727, -- 生命吸取
            "134626", -- 纠缠凝视
            133768, -- 动脉出血
            133767, -- 严重致伤
            134007, -- 吞噬
            "133731", -- 红光
            "133675", -- 蓝光
            "133737", -- 强光
            "134040", -- 纠缠凝视
            "-133732", -- 红光
            "-133677", -- 蓝光
            "-133738", -- 强光
        },
        [820] = { -- 普利莫修斯
            136181, -- 视力损伤
            136183, -- 迟钝神经键
            136185, -- 脆弱之骨
            136187, -- 困惑心智
            136050, -- 畸形之血
            137000, -- 黑血
            140546, -- 完全变异
            -136186, -- 清醒心智
            -136180, -- 视力敏锐
            -136182, -- 强化神经键
            -136184, -- 厚重之骨
        },
        [824] = { -- 黑暗意志
            138609, -- 物质交换
            138486, -- 锁定
            138659, -- 意志之触
            138691, -- 心能之泉
            136962, -- 心能之环
            138569, -- 爆炸猛击
        },
        [817] = { -- 铁穹
            136192, -- 闪电风暴
            136615, -- 电击
            "135145", -- 冻结
            "136892", -- 冻结
            136193, -- 弧形闪电
            134691, -- 穿刺
            135147, -- 攻击盲区
            137654, -- 旋转狂风
            137668, -- 炽燃余烬
            137669, -- 风暴雷云
            137664, -- 冻结之血
            136577, -- 风暴
            134647, -- 烧灼
        },
        [829] = { -- 神女双天
            136722, -- 催眠孢子
            137341, -- 梦魇兽
            137375, -- 梦魇兽
            137408, -- 烈焰刃舞
            137440, -- 寒冷阴影
            138189, -- 召唤朱鹤之灵
            138254, -- 召唤玄牛之灵
            138264, -- 召唤白虎之灵
            138267, -- 召唤青龙之灵
            -138300, -- 玄牛之韧
        },
        [832] = { -- 雷神
            136295, -- 超载
            "134912", -- 斩首
            "134916", -- 斩首
            136478, -- 熔解削砍
            136853, -- 闪电箭
            139011, -- 命令头盔
            136914, -- 电能震击
            135153, -- 崩解闪电
            136889, -- 暴乱狂风
            137176, -- 导管短路
            "137446", -- 电能释放
            -140208, -- 风蚀
            "-134821", -- 电能释放
        },
        [831] = { -- 莱登
            "138288", -- 不稳定的心能
            "138295", -- 不稳定的心能
            "138297", -- 不稳定的生命
            "138308", -- 不稳定的生命
            138372, -- 生命过敏
            139318, -- 心能过敏
            138333, -- 残酷打击
            138327, -- 吸取心能
            138328, -- 吸取生命
            -138329, -- 释放的心能
        },
    },

    [369] = { -- 决战奥格瑞玛
        ["general"] = {
        },
        [852] = { -- 伊墨苏斯
        },
        [849] = { -- 堕落的守护者
        },
        [866] = { -- 诺鲁什
        },
        [867] = { -- 傲之煞
        },
        [868] = { -- 迦拉卡斯
        },
        [864] = { -- 钢铁战蝎
        },
        [856] = { -- 库卡隆黑暗萨满
        },
        [850] = { -- 纳兹戈林将军
        },
        [846] = { -- 马尔考罗克
        },
        [870] = { -- 潘达利亚战利品
        },
        [851] = { -- 嗜血的索克
        },
        [865] = { -- 攻城匠师黑索
        },
        [853] = { -- 卡拉克西英杰
        },
        [869] = { -- 加尔鲁什·地狱咆哮
        },
    },

    [324] = { -- 围攻砮皂寺
        ["general"] = {
        },
        [693] = { -- 宰相金巴卡
        },
        [738] = { -- 指挥官沃加克
        },
        [692] = { -- 将军帕瓦拉克
        },
        [727] = { -- 翼虫首领尼诺洛克
        },
    },

    [312] = { -- 影踪禅院
        ["general"] = {
        },
        [673] = { -- 古·穿云
        },
        [657] = { -- 雪流大师
        },
        [685] = { -- 狂之煞
        },
        [686] = { -- 祝踏岚
        },
    },

    [303] = { -- 残阳关
        ["general"] = {
        },
        [655] = { -- 破坏者吉普提拉克
        },
        [675] = { -- 突袭者加杜卡
        },
        [676] = { -- 指挥官瑞魔克
        },
        [649] = { -- 莱公
        },
    },

    [316] = { -- 血色修道院
        ["general"] = {
        },
        [688] = { -- 裂魂者萨尔诺斯
        },
        [671] = { -- 科洛夫修士
        },
        [674] = { -- 大检察官怀特迈恩
        },
    },

    [311] = { -- 血色大厅
        ["general"] = {
        },
        [660] = { -- 驯犬者布兰恩
        },
        [654] = { -- 武器大师哈兰
        },
        [656] = { -- 织焰者孔格勒
        },
    },

    [246] = { -- 通灵学院
        ["general"] = {
        },
        [659] = { -- 指导者寒心
        },
        [663] = { -- 詹迪斯·巴罗夫
        },
        [665] = { -- 血骨傀儡
        },
        [666] = { -- 莉莉安·沃斯
        },
        [684] = { -- 黑暗院长加丁
        },
    },

    [313] = { -- 青龙寺
        ["general"] = {
            395859, -- 游荡尖啸
            395872, -- 昏呆独白
            397899, -- 扫堂腿
            397911, -- 毁灭之触
            396007, -- 恶意啄击
            114803, -- 投掷火炬
            396093, -- 野蛮飞跃
            397914, -- 污染迷雾
            396003, -- 领地展示
            396019, -- 震荡打击
            397904, -- 残阳西沉踢
            110125, -- 粉碎决心
        },
        [672] = { -- 贤者马里
            397878, -- 腐化涟漪
            395829, -- 煞能残渣
        },
        [664] = { -- 游学者石步
            -396150, -- 优越感
            -396152, -- 自卑感
        },
        [658] = { -- 刘·焰心
            106823, -- 翔龙猛袭
            106841, -- 青龙猛袭
            107110, -- 玉火
            118540, -- 青龙泛波
        },
        [335] = { -- 疑之煞
            106113, -- 虚无之触
            106290, -- 自疑
        },
    },

    [302] = { -- 风暴烈酒酿造厂
        ["general"] = {
        },
        [668] = { -- 乌克乌克
        },
        [669] = { -- 跳跳大王
        },
        [670] = { -- 破桶而出的炎诛
        },
    },

    [321] = { -- 魔古山宫殿
        ["general"] = {
        },
        [708] = { -- 君王的试炼
        },
        [690] = { -- 杰翰
        },
        [698] = { -- 武器大师席恩
        },
    },
}

if Cell.isMists then
    debuffs[313] = { -- 青龙寺
        ["general"] = {
        },
        [672] = { -- 贤者马里
        },
        [664] = { -- 游学者石步
        },
        [658] = { -- 刘·焰心
        },
        [335] = { -- 疑之煞
        },
    }
end

F.LoadBuiltInDebuffs(debuffs)