--[[
-- File: RaidDebuffs_DF.lua
-- Author: enderneko (enderneko-dev@outlook.com)
-- File Created: 2022/12/05 17:28:20 +0800
-- Last Modified: 2022/12/05 17:51:07 +0800
--]]

local _, Cell = ...
local F = Cell.funcs

local debuffs = {
    [1205] = { -- 巨龙群岛
    ["general"] = {
    },
    [2515] = { -- 斯图恩兰，苍天苦难
    },
    [2506] = { -- 巴斯律孔，页岩之翼
    },
    [2517] = { -- 巴祖阿尔，惊恐烈焰
    },
    [2518] = { -- 利斯卡诺兹，未来灾劫
    },
    },

    [1200] = { -- 化身巨龙牢窟
        ["general"] = {
        },
        [2480] = { -- 艾拉诺格
        },
        [2500] = { -- 泰洛斯
        },
        [2486] = { -- 原始议会
        },
        [2482] = { -- 瑟娜尔丝，冰冷之息
        },
        [2502] = { -- 晋升者达瑟雅
        },
        [2491] = { -- 库洛格·恐怖图腾
        },
        [2493] = { -- 巢穴守护者迪乌尔娜
        },
        [2499] = { -- 莱萨杰丝，噬雷之龙
        },
    },

    [1201] = { -- 艾杰斯亚学院
        ["general"] = {
        },
        [2509] = { -- 维克萨姆斯
        },
        [2512] = { -- 茂林古树
        },
        [2495] = { -- 克罗兹
        },
        [2514] = { -- 多拉苟萨的回响
        },
    },

    [1196] = { -- 蕨皮山谷
        ["general"] = {
        },
        [2471] = { -- 劈爪的战团
        },
        [2473] = { -- 树口
        },
        [2472] = { -- 肠击
        },
        [2474] = { -- 腐朽主母怒眼
        },
    },

    [1204] = { -- 注能大厅
        ["general"] = {
        },
        [2504] = { -- 看护者伊里度斯
        },
        [2507] = { -- 吞喉巨蛙
        },
        [2510] = { -- 不屈者卡金
        },
        [2511] = { -- 原始海啸
        },
    },

    [1199] = { -- 奈萨鲁斯
        ["general"] = {
        },
        [2490] = { -- 查尔加斯，龙鳞之灾
        },
        [2489] = { -- 熔炉主管戈雷克
        },
        [2494] = { -- 岩浆之牙
        },
        [2501] = { -- 督军莎尔佳
        },
    },

    [1202] = { -- 红玉新生法池
        ["general"] = {
        },
        [2488] = { -- 梅莉杜莎·寒妆
        },
        [2485] = { -- 柯姬雅·焰蹄
        },
        [2503] = { -- 基拉卡与厄克哈特·风脉
        },
    },

    [1203] = { -- 碧蓝魔馆
        ["general"] = {
        },
        [2492] = { -- 莱魔
        },
        [2505] = { -- 青刃
        },
        [2483] = { -- 泰拉什·灰翼
        },
        [2508] = { -- 安布雷斯库
        },
    },

    [1198] = { -- 诺库德阻击战
        ["general"] = {
        },
        [2498] = { -- 格拉尼斯
        },
        [2497] = { -- 狂怒风暴
        },
        [2478] = { -- 提拉和马鲁克
        },
        [2477] = { -- 巴拉卡可汗
        },
    },

    [1197] = { -- 奥达曼：提尔的遗产
        ["general"] = {
        },
        [2475] = { -- 失落的矮人
        },
        [2487] = { -- 布罗马奇
        },
        [2484] = { -- 哨兵塔隆达丝
        },
        [2476] = { -- 艾博隆
        },
        [2479] = { -- 时空领主戴欧斯
        },
    },
}

F:LoadBuiltInDebuffs(debuffs)