---------------------------------------------------------------------
-- File: ExpansionData_ruRU.lua
-- Author: enderneko (enderneko-dev@outlook.com)
-- Created : 2024-07-16 10:26 +08:00
-- Modified: 2024-07-16 10:34 +08:00
---------------------------------------------------------------------

if not LOCALE_ruRU then return end

Cell_ExpansionData.locale = "ruRU"

Cell_ExpansionData.expansions = {
    "Dragonflight",
    "Темные Земли",
    "Battle for Azeroth",
    "Legion",
    "Warlords of Draenor",
    "Mists of Pandaria",
    "Cataclysm",
    "Wrath of the Lich King",
    "Burning Crusade",
    "Классические подземелья",
}

Cell_ExpansionData.data = {
    ["Battle for Azeroth"] = {
        {
            ["id"] = 1028,
            ["image"] = 2178279,
            ["name"] = "Азерот",
            ["bosses"] = {
                {
                    ["id"] = 2378,
                    ["image"] = 3284400,
                    ["name"] = "Великая императрица Шек'зара",
                },
                {
                    ["id"] = 2381,
                    ["image"] = 3284401,
                    ["name"] = "Вук'лаз Землелом",
                },
                {
                    ["id"] = 2363,
                    ["image"] = 3012063,
                    ["name"] = "Векемара",
                },
                {
                    ["id"] = 2362,
                    ["image"] = 3012061,
                    ["name"] = "Страж душ Улмат",
                },
                {
                    ["id"] = 2329,
                    ["image"] = 2497782,
                    ["name"] = "Ивус Лесной Властелин",
                },
                {
                    ["id"] = 2212,
                    ["image"] = 2176752,
                    ["name"] = "\"Львиный рык\"",
                },
                {
                    ["id"] = 2139,
                    ["image"] = 2176755,
                    ["name"] = "Т'зейн",
                },
                {
                    ["id"] = 2141,
                    ["image"] = 2176734,
                    ["name"] = "Джи'арак",
                },
                {
                    ["id"] = 2197,
                    ["image"] = 2176731,
                    ["name"] = "Градовый голем",
                },
                {
                    ["id"] = 2198,
                    ["image"] = 2176760,
                    ["name"] = "Вестник войны Йенаж",
                },
                {
                    ["id"] = 2199,
                    ["image"] = 2176716,
                    ["name"] = "Лазуретос, Крылатый Тайфун",
                },
                {
                    ["id"] = 2210,
                    ["image"] = 2176723,
                    ["name"] = "Дюнный пожиратель Краулок",
                },
            },
        },
        {
            ["id"] = 1031,
            ["image"] = 2178277,
            ["name"] = "Ульдир",
            ["bosses"] = {
                {
                    ["id"] = 2168,
                    ["image"] = 2176749,
                    ["name"] = "Талок",
                },
                {
                    ["id"] = 2167,
                    ["image"] = 2176741,
                    ["name"] = "МАТРИАРХ",
                },
                {
                    ["id"] = 2146,
                    ["image"] = 2176725,
                    ["name"] = "Зловонный пожиратель",
                },
                {
                    ["id"] = 2169,
                    ["image"] = 2176761,
                    ["name"] = "Зек'воз, глашатай Н'Зота",
                },
                {
                    ["id"] = 2166,
                    ["image"] = 2176757,
                    ["name"] = "Вектис",
                },
                {
                    ["id"] = 2195,
                    ["image"] = 2176762,
                    ["name"] = "Зул Перерожденный",
                },
                {
                    ["id"] = 2194,
                    ["image"] = 2176742,
                    ["name"] = "Митракс Развоплотитель",
                },
                {
                    ["id"] = 2147,
                    ["image"] = 2176728,
                    ["name"] = "Г'уун",
                },
            },
        },
        {
            ["id"] = 1176,
            ["image"] = 2482729,
            ["name"] = "Битва за Дазар'алор",
            ["bosses"] = {
                {
                    ["id"] = 2333,
                    ["image"] = 2497778,
                    ["name"] = "Воительница Света",
                },
                {
                    ["id"] = 2325,
                    ["image"] = 2497783,
                    ["name"] = "Гронг, владыка джунглей",
                },
                {
                    ["id"] = 2341,
                    ["image"] = 2529383,
                    ["name"] = "Мастера Огня и Нефрита",
                },
                {
                    ["id"] = 2342,
                    ["image"] = 2497790,
                    ["name"] = "Роскошь",
                },
                {
                    ["id"] = 2330,
                    ["image"] = 2497779,
                    ["name"] = "Конклав Избранных",
                },
                {
                    ["id"] = 2335,
                    ["image"] = 2497784,
                    ["name"] = "Король Растахан",
                },
                {
                    ["id"] = 2334,
                    ["image"] = 2497788,
                    ["name"] = "Главный механик Меггакрут",
                },
                {
                    ["id"] = 2337,
                    ["image"] = 2497786,
                    ["name"] = "Штормовая блокада",
                },
                {
                    ["id"] = 2343,
                    ["image"] = 2497785,
                    ["name"] = "Леди Джайна Праудмур",
                },
            },
        },
        {
            ["id"] = 1177,
            ["image"] = 2498193,
            ["name"] = "Горнило Штормов",
            ["bosses"] = {
                {
                    ["id"] = 2328,
                    ["image"] = 2497795,
                    ["name"] = "Неусыпный Совет",
                },
                {
                    ["id"] = 2332,
                    ["image"] = 2497794,
                    ["name"] = "Глашатай Бездны Уу'нат",
                },
            },
        },
        {
            ["id"] = 1179,
            ["image"] = 3025320,
            ["name"] = "Вечный дворец",
            ["bosses"] = {
                {
                    ["id"] = 2352,
                    ["image"] = 3012047,
                    ["name"] = "Командир глубин Сивара",
                },
                {
                    ["id"] = 2347,
                    ["image"] = 3012062,
                    ["name"] = "Темноводный левиафан",
                },
                {
                    ["id"] = 2353,
                    ["image"] = 3012058,
                    ["name"] = "Великолепие Азшары",
                },
                {
                    ["id"] = 2354,
                    ["image"] = 3012055,
                    ["name"] = "Леди Эшвейн",
                },
                {
                    ["id"] = 2351,
                    ["image"] = 3012054,
                    ["name"] = "Оргозоа",
                },
                {
                    ["id"] = 2359,
                    ["image"] = 3012057,
                    ["name"] = "Королевский суд",
                },
                {
                    ["id"] = 2349,
                    ["image"] = 3012064,
                    ["name"] = "За'кул, глашатай Ни'алоты",
                },
                {
                    ["id"] = 2361,
                    ["image"] = 3012056,
                    ["name"] = "Королева Азшара",
                },
            },
        },
        {
            ["id"] = 1180,
            ["image"] = 3221463,
            ["name"] = "Ни'алота",
            ["bosses"] = {
                {
                    ["id"] = 2368,
                    ["image"] = 3256385,
                    ["name"] = "Гневион, Черный император",
                },
                {
                    ["id"] = 2365,
                    ["image"] = 3256380,
                    ["name"] = "Маут",
                },
                {
                    ["id"] = 2369,
                    ["image"] = 3256384,
                    ["name"] = "Пророк Скитра",
                },
                {
                    ["id"] = 2377,
                    ["image"] = 3256386,
                    ["name"] = "Темный инквизитор Занеш",
                },
                {
                    ["id"] = 2372,
                    ["image"] = 3256378,
                    ["name"] = "Коллективный разум",
                },
                {
                    ["id"] = 2367,
                    ["image"] = 3256383,
                    ["name"] = "Шад'хар Ненасытный",
                },
                {
                    ["id"] = 2373,
                    ["image"] = 3256377,
                    ["name"] = "Дест'агат",
                },
                {
                    ["id"] = 2374,
                    ["image"] = 3256379,
                    ["name"] = "Ил'гинот, Возрожденная Порча",
                },
                {
                    ["id"] = 2370,
                    ["image"] = 3257677,
                    ["name"] = "Вексиона",
                },
                {
                    ["id"] = 2364,
                    ["image"] = 3256382,
                    ["name"] = "Ра-ден Отчаявшийся",
                },
                {
                    ["id"] = 2366,
                    ["image"] = 3256376,
                    ["name"] = "Панцирь Н'Зота",
                },
                {
                    ["id"] = 2375,
                    ["image"] = 3256381,
                    ["name"] = "Н'Зот Заразитель",
                },
            },
        },
        {
            ["id"] = 968,
            ["image"] = 1778892,
            ["name"] = "Атал'Дазар",
            ["bosses"] = {
                {
                    ["id"] = 2082,
                    ["image"] = 1778348,
                    ["name"] = "Жрица Алун'за",
                },
                {
                    ["id"] = 2036,
                    ["image"] = 1778352,
                    ["name"] = "Вол'каал",
                },
                {
                    ["id"] = 2083,
                    ["image"] = 1778349,
                    ["name"] = "Резан",
                },
                {
                    ["id"] = 2030,
                    ["image"] = 1778353,
                    ["name"] = "Язма",
                },
            },
        },
        {
            ["id"] = 1001,
            ["image"] = 1778893,
            ["name"] = "Вольная Гавань",
            ["bosses"] = {
                {
                    ["id"] = 2102,
                    ["image"] = 1778351,
                    ["name"] = "Небесный капитан Крагг",
                },
                {
                    ["id"] = 2093,
                    ["image"] = 1778346,
                    ["name"] = "Совет капитанов",
                },
                {
                    ["id"] = 2094,
                    ["image"] = 1778350,
                    ["name"] = "Йо-хо-хо-лизей",
                },
                {
                    ["id"] = 2095,
                    ["image"] = 1778347,
                    ["name"] = "Красавчик Харлан",
                },
            },
        },
        {
            ["id"] = 1041,
            ["image"] = 2178269,
            ["name"] = "Гробница королей",
            ["bosses"] = {
                {
                    ["id"] = 2165,
                    ["image"] = 2176751,
                    ["name"] = "Золотой Змей",
                },
                {
                    ["id"] = 2171,
                    ["image"] = 2176738,
                    ["name"] = "Мчимба Бальзамировщик",
                },
                {
                    ["id"] = 2170,
                    ["image"] = 2176750,
                    ["name"] = "Совет племен",
                },
                {
                    ["id"] = 2172,
                    ["image"] = 2176720,
                    ["name"] = "Дазар, первый король",
                },
            },
        },
        {
            ["id"] = 1012,
            ["image"] = 2178274,
            ["name"] = "ЗОЛОТАЯ ЖИЛА!!!",
            ["bosses"] = {
                {
                    ["id"] = 2109,
                    ["image"] = 2176718,
                    ["name"] = "Платный разгонятель толпы",
                },
                {
                    ["id"] = 2114,
                    ["image"] = 2176714,
                    ["name"] = "Азерокк",
                },
                {
                    ["id"] = 2115,
                    ["image"] = 2176745,
                    ["name"] = "Рикса Огневерт",
                },
                {
                    ["id"] = 2116,
                    ["image"] = 2176740,
                    ["name"] = "Шеф Разданк",
                },
            },
        },
        {
            ["id"] = 1178,
            ["image"] = 3025325,
            ["name"] = "Операция \"Мехагон\"",
            ["bosses"] = {
                {
                    ["id"] = 2357,
                    ["image"] = 3012050,
                    ["name"] = "Король Гоббамак",
                },
                {
                    ["id"] = 2358,
                    ["image"] = 3012048,
                    ["name"] = "Токсикоид",
                },
                {
                    ["id"] = 2360,
                    ["image"] = 3012059,
                    ["name"] = "Трикси и Нано",
                },
                {
                    ["id"] = 2355,
                    ["image"] = 3012049,
                    ["name"] = "Воздушный подавитель ОУ-8",
                },
                {
                    ["id"] = 2336,
                    ["image"] = 3012060,
                    ["name"] = "Меха-месиво",
                },
                {
                    ["id"] = 2339,
                    ["image"] = 3012052,
                    ["name"] = "КУ-ДЖ0",
                },
                {
                    ["id"] = 2348,
                    ["image"] = 3012053,
                    ["name"] = "Сад машиниста",
                },
                {
                    ["id"] = 2331,
                    ["image"] = 3012051,
                    ["name"] = "Король Мехагон",
                },
            },
        },
        {
            ["id"] = 1023,
            ["image"] = 2178272,
            ["name"] = "Осада Боралуса",
            ["bosses"] = {
                {
                    ["id"] = 2133,
                    ["image"] = 2176746,
                    ["name"] = "Сержант Бейнбридж",
                },
                {
                    ["id"] = 2173,
                    ["image"] = 2176722,
                    ["name"] = "Жуткий капитан Локвуд",
                },
                {
                    ["id"] = 2134,
                    ["image"] = 2176730,
                    ["name"] = "Хадал Черная Бездна",
                },
                {
                    ["id"] = 2140,
                    ["image"] = 2176758,
                    ["name"] = "Вик'Гот",
                },
            },
        },
        {
            ["id"] = 1022,
            ["image"] = 2178275,
            ["name"] = "Подгнилье",
            ["bosses"] = {
                {
                    ["id"] = 2157,
                    ["image"] = 2176724,
                    ["name"] = "Старейшина Ликса",
                },
                {
                    ["id"] = 2131,
                    ["image"] = 2176719,
                    ["name"] = "Кроглот Зараженный",
                },
                {
                    ["id"] = 2130,
                    ["image"] = 2176748,
                    ["name"] = "Заклинатель спор Занча",
                },
                {
                    ["id"] = 2158,
                    ["image"] = 2176756,
                    ["name"] = "Освобожденное чудовище",
                },
            },
        },
        {
            ["id"] = 1036,
            ["image"] = 2178271,
            ["name"] = "Святилище Штормов",
            ["bosses"] = {
                {
                    ["id"] = 2153,
                    ["image"] = 2176712,
                    ["name"] = "Аква'сирр",
                },
                {
                    ["id"] = 2154,
                    ["image"] = 2176754,
                    ["name"] = "Совет жрецов моря",
                },
                {
                    ["id"] = 2155,
                    ["image"] = 2176737,
                    ["name"] = "Лорд Штормсонг",
                },
                {
                    ["id"] = 2156,
                    ["image"] = 2176759,
                    ["name"] = "Вол'зит Шепчущая",
                },
            },
        },
        {
            ["id"] = 1002,
            ["image"] = 2178276,
            ["name"] = "Тол Дагор",
            ["bosses"] = {
                {
                    ["id"] = 2097,
                    ["image"] = 2176753,
                    ["name"] = "Королева песков",
                },
                {
                    ["id"] = 2098,
                    ["image"] = 2176733,
                    ["name"] = "Джес Хаулис",
                },
                {
                    ["id"] = 2099,
                    ["image"] = 2176735,
                    ["name"] = "Рыцарь-капитан Валири",
                },
                {
                    ["id"] = 2096,
                    ["image"] = 2176743,
                    ["name"] = "Надзиратель Корги",
                },
            },
        },
        {
            ["id"] = 1021,
            ["image"] = 2178278,
            ["name"] = "Усадьба Уэйкрестов",
            ["bosses"] = {
                {
                    ["id"] = 2125,
                    ["image"] = 2176732,
                    ["name"] = "Триада ковена Мертвых Сердец",
                },
                {
                    ["id"] = 2126,
                    ["image"] = 2176747,
                    ["name"] = "Оживленный голиаф",
                },
                {
                    ["id"] = 2127,
                    ["image"] = 2176744,
                    ["name"] = "Раал Прожорливый",
                },
                {
                    ["id"] = 2128,
                    ["image"] = 2176736,
                    ["name"] = "Лорд и леди Уэйкрест",
                },
                {
                    ["id"] = 2129,
                    ["image"] = 2176729,
                    ["name"] = "Горак Тул",
                },
            },
        },
        {
            ["id"] = 1030,
            ["image"] = 2178273,
            ["name"] = "Храм Сетралисс",
            ["bosses"] = {
                {
                    ["id"] = 2142,
                    ["image"] = 2176710,
                    ["name"] = "Гюрзис и Аспидис",
                },
                {
                    ["id"] = 2143,
                    ["image"] = 2176739,
                    ["name"] = "Меректа",
                },
                {
                    ["id"] = 2144,
                    ["image"] = 2176727,
                    ["name"] = "Гальваззт",
                },
                {
                    ["id"] = 2145,
                    ["image"] = 2176713,
                    ["name"] = "Аватара Сетралисс",
                },
            },
        },
    },
    ["Dragonflight"] = {
        {
            ["id"] = 1205,
            ["image"] = 4742925,
            ["name"] = "Драконьи острова",
            ["bosses"] = {
                {
                    ["id"] = 2515,
                    ["image"] = 4757700,
                    ["name"] = "Струнраан Бедствие Небес",
                },
                {
                    ["id"] = 2506,
                    ["image"] = 4757691,
                    ["name"] = "Базрикрон Каменное Крыло",
                },
                {
                    ["id"] = 2517,
                    ["image"] = 4757692,
                    ["name"] = "Базуал Чудовищное Пламя",
                },
                {
                    ["id"] = 2518,
                    ["image"] = 4757697,
                    ["name"] = "Лисканот Крах Мироздания",
                },
                {
                    ["id"] = 2531,
                    ["image"] = 5151696,
                    ["name"] = "Старейшины закали",
                },
                {
                    ["id"] = 2562,
                    ["image"] = 5409248,
                    ["name"] = "Ауростор Спящий",
                },
            },
        },
        {
            ["id"] = 1200,
            ["image"] = 4742931,
            ["name"] = "Хранилище Воплощений",
            ["bosses"] = {
                {
                    ["id"] = 2480,
                    ["image"] = 4757695,
                    ["name"] = "Эраног",
                },
                {
                    ["id"] = 2500,
                    ["image"] = 4757701,
                    ["name"] = "Террос",
                },
                {
                    ["id"] = 2486,
                    ["image"] = 4757702,
                    ["name"] = "Совет стихий",
                },
                {
                    ["id"] = 2482,
                    ["image"] = 4757699,
                    ["name"] = "Сеннарт Дыхание Льда",
                },
                {
                    ["id"] = 2502,
                    ["image"] = 4757694,
                    ["name"] = "Дафия Перерожденная",
                },
                {
                    ["id"] = 2491,
                    ["image"] = 4757696,
                    ["name"] = "Курог Зловещий Тотем",
                },
                {
                    ["id"] = 2493,
                    ["image"] = 4757693,
                    ["name"] = "Хранительница стаи Денна",
                },
                {
                    ["id"] = 2499,
                    ["image"] = 4757698,
                    ["name"] = "Рашагет Пожирательница Бурь",
                },
            },
        },
        {
            ["id"] = 1208,
            ["image"] = 5149418,
            ["name"] = "Аберрий, Затененное Горнило",
            ["bosses"] = {
                {
                    ["id"] = 2522,
                    ["image"] = 5151370,
                    ["name"] = "Каззара Огнекованная",
                },
                {
                    ["id"] = 2529,
                    ["image"] = 5151374,
                    ["name"] = "Чертог слияния",
                },
                {
                    ["id"] = 2530,
                    ["image"] = 5151375,
                    ["name"] = "Забытые эксперименты",
                },
                {
                    ["id"] = 2524,
                    ["image"] = 5151368,
                    ["name"] = "Нападение закали",
                },
                {
                    ["id"] = 2525,
                    ["image"] = 5151372,
                    ["name"] = "Рашок Древний",
                },
                {
                    ["id"] = 2532,
                    ["image"] = 5151376,
                    ["name"] = "Бдительный распорядитель Зкарн",
                },
                {
                    ["id"] = 2527,
                    ["image"] = 5151371,
                    ["name"] = "Магморакс",
                },
                {
                    ["id"] = 2523,
                    ["image"] = 5151369,
                    ["name"] = "Эхо Нелтариона",
                },
                {
                    ["id"] = 2520,
                    ["image"] = 5151373,
                    ["name"] = "Дракомандир Саркарет",
                },
            },
        },
        {
            ["id"] = 1207,
            ["image"] = 5409261,
            ["name"] = "Амирдрассил, Надежда Сна",
            ["bosses"] = {
                {
                    ["id"] = 2564,
                    ["image"] = 5409251,
                    ["name"] = "Кривокорень",
                },
                {
                    ["id"] = 2554,
                    ["image"] = 5409252,
                    ["name"] = "Игира Жестокая",
                },
                {
                    ["id"] = 2557,
                    ["image"] = 5409257,
                    ["name"] = "Вулкаросс",
                },
                {
                    ["id"] = 2555,
                    ["image"] = 5409249,
                    ["name"] = "Совет Снов",
                },
                {
                    ["id"] = 2553,
                    ["image"] = 5409253,
                    ["name"] = "Хранитель пламени Лародар",
                },
                {
                    ["id"] = 2556,
                    ["image"] = 5409254,
                    ["name"] = "Нимуэ, Ткач круговорота",
                },
                {
                    ["id"] = 2563,
                    ["image"] = 5409255,
                    ["name"] = "Пеплорон",
                },
                {
                    ["id"] = 2565,
                    ["image"] = 5409256,
                    ["name"] = "Тиндрал Полет Мысли, провидец Пламени",
                },
                {
                    ["id"] = 2519,
                    ["image"] = 5409250,
                    ["name"] = "Фиракк Пылающий",
                },
            },
        },
        {
            ["id"] = 1201,
            ["image"] = 4742929,
            ["name"] = "Академия Алгет'ар",
            ["bosses"] = {
                {
                    ["id"] = 2509,
                    ["image"] = 4741534,
                    ["name"] = "Вексам",
                },
                {
                    ["id"] = 2512,
                    ["image"] = 4741524,
                    ["name"] = "Заросшее древо",
                },
                {
                    ["id"] = 2495,
                    ["image"] = 4741508,
                    ["name"] = "Кроут",
                },
                {
                    ["id"] = 2514,
                    ["image"] = 4741510,
                    ["name"] = "Эхо Дорагосы",
                },
            },
        },
        {
            ["id"] = 1196,
            ["image"] = 4742923,
            ["name"] = "Лощина Бурошкуров",
            ["bosses"] = {
                {
                    ["id"] = 2471,
                    ["image"] = 4741526,
                    ["name"] = "Боевой отряд Когтерезки",
                },
                {
                    ["id"] = 2473,
                    ["image"] = 4741532,
                    ["name"] = "Древорот",
                },
                {
                    ["id"] = 2472,
                    ["image"] = 4741518,
                    ["name"] = "Пузострелка",
                },
                {
                    ["id"] = 2474,
                    ["image"] = 4741509,
                    ["name"] = "Гниломаг Око Гнева",
                },
            },
        },
        {
            ["id"] = 1204,
            ["image"] = 4742926,
            ["name"] = "Чертоги Насыщения",
            ["bosses"] = {
                {
                    ["id"] = 2504,
                    ["image"] = 4741536,
                    ["name"] = "Страж Иридий",
                },
                {
                    ["id"] = 2507,
                    ["image"] = 4741516,
                    ["name"] = "Голиаф-проглот",
                },
                {
                    ["id"] = 2510,
                    ["image"] = 4741519,
                    ["name"] = "Каджин Непреклонная",
                },
                {
                    ["id"] = 2511,
                    ["image"] = 4741525,
                    ["name"] = "Изначальное цунами",
                },
            },
        },
        {
            ["id"] = 1199,
            ["image"] = 4742928,
            ["name"] = "Нелтарий",
            ["bosses"] = {
                {
                    ["id"] = 2490,
                    ["image"] = 4741506,
                    ["name"] = "Чаргат Дробитель Чешуи",
                },
                {
                    ["id"] = 2489,
                    ["image"] = 4741513,
                    ["name"] = "Главный кузнец Горек",
                },
                {
                    ["id"] = 2494,
                    ["image"] = 4741522,
                    ["name"] = "Магмобивень",
                },
                {
                    ["id"] = 2501,
                    ["image"] = 4741535,
                    ["name"] = "Полководец Сарга",
                },
            },
        },
        {
            ["id"] = 1202,
            ["image"] = 4742927,
            ["name"] = "Рубиновые Омуты Жизни",
            ["bosses"] = {
                {
                    ["id"] = 2488,
                    ["image"] = 4741523,
                    ["name"] = "Мелидрусса Истощенная Холодом",
                },
                {
                    ["id"] = 2485,
                    ["image"] = 4741520,
                    ["name"] = "Кокия Пламенное Копыто",
                },
                {
                    ["id"] = 2503,
                    ["image"] = 4867810,
                    ["name"] = "Киракка и Эркхарт Кровь Бури",
                },
            },
        },
        {
            ["id"] = 1203,
            ["image"] = 4742829,
            ["name"] = "Лазурное хранилище",
            ["bosses"] = {
                {
                    ["id"] = 2492,
                    ["image"] = 4741521,
                    ["name"] = "Леймор",
                },
                {
                    ["id"] = 2505,
                    ["image"] = 4741503,
                    ["name"] = "Лазурный Клинок",
                },
                {
                    ["id"] = 2483,
                    ["image"] = 4741529,
                    ["name"] = "Телаш Серокрылый",
                },
                {
                    ["id"] = 2508,
                    ["image"] = 4741533,
                    ["name"] = "Мраскул",
                },
            },
        },
        {
            ["id"] = 1198,
            ["image"] = 4742924,
            ["name"] = "Наступление клана Нокхуд",
            ["bosses"] = {
                {
                    ["id"] = 2498,
                    ["image"] = 4741514,
                    ["name"] = "Гранит",
                },
                {
                    ["id"] = 2497,
                    ["image"] = 4741531,
                    ["name"] = "Яростная буря",
                },
                {
                    ["id"] = 2478,
                    ["image"] = 4741528,
                    ["name"] = "Тиира и Маруук",
                },
                {
                    ["id"] = 2477,
                    ["image"] = 4741504,
                    ["name"] = "Хан Балакар",
                },
            },
        },
        {
            ["id"] = 1197,
            ["image"] = 4742930,
            ["name"] = "Ульдаман: наследие Тира",
            ["bosses"] = {
                {
                    ["id"] = 2475,
                    ["image"] = 4741530,
                    ["name"] = "Потерянные дворфы",
                },
                {
                    ["id"] = 2487,
                    ["image"] = 4741505,
                    ["name"] = "Бромач",
                },
                {
                    ["id"] = 2484,
                    ["image"] = 4741527,
                    ["name"] = "Часовая Талондрас",
                },
                {
                    ["id"] = 2476,
                    ["image"] = 4741511,
                    ["name"] = "Тлерон",
                },
                {
                    ["id"] = 2479,
                    ["image"] = 4741507,
                    ["name"] = "Хронолорд Дейос",
                },
            },
        },
        {
            ["id"] = 1209,
            ["image"] = 5221768,
            ["name"] = "Рассвет Бесконечности",
            ["bosses"] = {
                {
                    ["id"] = 2521,
                    ["image"] = 5221761,
                    ["name"] = "Хроникар",
                },
                {
                    ["id"] = 2528,
                    ["image"] = 5221766,
                    ["name"] = "Ожившие потоки времени",
                },
                {
                    ["id"] = 2535,
                    ["image"] = 5221760,
                    ["name"] = "Гниль Галакронда",
                },
                {
                    ["id"] = 2537,
                    ["image"] = 5221765,
                    ["name"] = "Иридикрон Каменная Чешуя",
                },
                {
                    ["id"] = 2526,
                    ["image"] = 5221764,
                    ["name"] = "Тир, Хранитель Бесконечности",
                },
                {
                    ["id"] = 2536,
                    ["image"] = 5221767,
                    ["name"] = "Морхи",
                },
                {
                    ["id"] = 2534,
                    ["image"] = 5221759,
                    ["name"] = "Затерянное во времени поле битвы",
                },
                {
                    ["id"] = 2538,
                    ["image"] = 4741507,
                    ["name"] = "Хронолорд Дейос",
                },
            },
        },
    },
    ["Burning Crusade"] = {
        {
            ["id"] = 745,
            ["image"] = 1396584,
            ["name"] = "Каражан",
            ["bosses"] = {
                {
                    ["id"] = 1552,
                    ["image"] = 1385766,
                    ["name"] = "Комнаты слуг",
                },
                {
                    ["id"] = 1553,
                    ["image"] = 1378965,
                    ["name"] = "Ловчий Аттумен",
                },
                {
                    ["id"] = 1554,
                    ["image"] = 1378999,
                    ["name"] = "Мороуз",
                },
                {
                    ["id"] = 1555,
                    ["image"] = 1378997,
                    ["name"] = "Благочестивая дева",
                },
                {
                    ["id"] = 1556,
                    ["image"] = 1385758,
                    ["name"] = "Оперный зал",
                },
                {
                    ["id"] = 1557,
                    ["image"] = 1379020,
                    ["name"] = "Смотритель",
                },
                {
                    ["id"] = 1559,
                    ["image"] = 1379012,
                    ["name"] = "Тень Арана",
                },
                {
                    ["id"] = 1560,
                    ["image"] = 1379017,
                    ["name"] = "Терестиан Больное Копыто",
                },
                {
                    ["id"] = 1561,
                    ["image"] = 1379002,
                    ["name"] = "Гнев Пустоты",
                },
                {
                    ["id"] = 1764,
                    ["image"] = 1385724,
                    ["name"] = "Шахматы",
                },
                {
                    ["id"] = 1563,
                    ["image"] = 1379006,
                    ["name"] = "Принц Малчезар",
                },
            },
        },
        {
            ["id"] = 746,
            ["image"] = 1396582,
            ["name"] = "Логово Груула",
            ["bosses"] = {
                {
                    ["id"] = 1564,
                    ["image"] = 1378985,
                    ["name"] = "Король Молгар",
                },
                {
                    ["id"] = 1565,
                    ["image"] = 1378982,
                    ["name"] = "Груул Драконобой",
                },
            },
        },
        {
            ["id"] = 747,
            ["image"] = 1396585,
            ["name"] = "Логово Магтеридона",
            ["bosses"] = {
                {
                    ["id"] = 1566,
                    ["image"] = 1378996,
                    ["name"] = "Магтеридон",
                },
            },
        },
        {
            ["id"] = 748,
            ["image"] = 608199,
            ["name"] = "Змеиное святилище",
            ["bosses"] = {
                {
                    ["id"] = 1567,
                    ["image"] = 1385741,
                    ["name"] = "Гидросс Нестабильный",
                },
                {
                    ["id"] = 1568,
                    ["image"] = 1385768,
                    ["name"] = "Скрытень из глубин",
                },
                {
                    ["id"] = 1569,
                    ["image"] = 1385751,
                    ["name"] = "Леотерас Слепец",
                },
                {
                    ["id"] = 1570,
                    ["image"] = 1385729,
                    ["name"] = "Повелитель глубин Каратресс",
                },
                {
                    ["id"] = 1571,
                    ["image"] = 1385756,
                    ["name"] = "Морогрим Волноступ",
                },
                {
                    ["id"] = 1572,
                    ["image"] = 1385750,
                    ["name"] = "Леди Вайш",
                },
            },
        },
        {
            ["id"] = 749,
            ["image"] = 608218,
            ["name"] = "Око",
            ["bosses"] = {
                {
                    ["id"] = 1573,
                    ["image"] = 1385712,
                    ["name"] = "Ал'ар",
                },
                {
                    ["id"] = 1574,
                    ["image"] = 1385772,
                    ["name"] = "Страж Бездны",
                },
                {
                    ["id"] = 1575,
                    ["image"] = 1385739,
                    ["name"] = "Верховный звездочет Солариан",
                },
                {
                    ["id"] = 1576,
                    ["image"] = 607669,
                    ["name"] = "Кель'тас Солнечный Скиталец",
                },
            },
        },
        {
            ["id"] = 750,
            ["image"] = 608198,
            ["name"] = "Битва за гору Хиджал",
            ["bosses"] = {
                {
                    ["id"] = 1577,
                    ["image"] = 1385762,
                    ["name"] = "Лютый Хлад",
                },
                {
                    ["id"] = 1578,
                    ["image"] = 1385714,
                    ["name"] = "Анетерон",
                },
                {
                    ["id"] = 1579,
                    ["image"] = 1385745,
                    ["name"] = "Каз'рогал",
                },
                {
                    ["id"] = 1580,
                    ["image"] = 1385719,
                    ["name"] = "Азгалор",
                },
                {
                    ["id"] = 1581,
                    ["image"] = 1385716,
                    ["name"] = "Архимонд",
                },
            },
        },
        {
            ["id"] = 751,
            ["image"] = 1396579,
            ["name"] = "Черный храм",
            ["bosses"] = {
                {
                    ["id"] = 1582,
                    ["image"] = 1378986,
                    ["name"] = "Верховный полководец Надж'ентус",
                },
                {
                    ["id"] = 1583,
                    ["image"] = 1379016,
                    ["name"] = "Супремус",
                },
                {
                    ["id"] = 1584,
                    ["image"] = 1379011,
                    ["name"] = "Тень Акамы",
                },
                {
                    ["id"] = 1585,
                    ["image"] = 1379018,
                    ["name"] = "Терон Кровожад",
                },
                {
                    ["id"] = 1586,
                    ["image"] = 1378983,
                    ["name"] = "Гуртогг Кипящая Кровь",
                },
                {
                    ["id"] = 1587,
                    ["image"] = 1385764,
                    ["name"] = "Реликварий душ",
                },
                {
                    ["id"] = 1588,
                    ["image"] = 1379000,
                    ["name"] = "Матушка Шахраз",
                },
                {
                    ["id"] = 1589,
                    ["image"] = 1385743,
                    ["name"] = "Совет иллидари",
                },
                {
                    ["id"] = 1590,
                    ["image"] = 1378987,
                    ["name"] = "Иллидан Ярость Бури",
                },
            },
        },
        {
            ["id"] = 752,
            ["image"] = 1396592,
            ["name"] = "Плато Солнечного Колодца",
            ["bosses"] = {
                {
                    ["id"] = 1591,
                    ["image"] = 1385744,
                    ["name"] = "Калесгос",
                },
                {
                    ["id"] = 1592,
                    ["image"] = 1385722,
                    ["name"] = "Бруталл",
                },
                {
                    ["id"] = 1593,
                    ["image"] = 1385730,
                    ["name"] = "Пророк Скверны",
                },
                {
                    ["id"] = 1594,
                    ["image"] = 1390438,
                    ["name"] = "Эредарские близнецы",
                },
                {
                    ["id"] = 1595,
                    ["image"] = 1385757,
                    ["name"] = "М'ууру",
                },
                {
                    ["id"] = 1596,
                    ["image"] = 1385746,
                    ["name"] = "Кил'джеден",
                },
            },
        },
        {
            ["id"] = 254,
            ["image"] = 608218,
            ["name"] = "Аркатрац",
            ["bosses"] = {
                {
                    ["id"] = 548,
                    ["image"] = 607823,
                    ["name"] = "Зерекет Бездонный",
                },
                {
                    ["id"] = 549,
                    ["image"] = 607574,
                    ["name"] = "Даллия Глашатай Судьбы",
                },
                {
                    ["id"] = 550,
                    ["image"] = 607820,
                    ["name"] = "Провидец Гнева Соккорат",
                },
                {
                    ["id"] = 551,
                    ["image"] = 607635,
                    ["name"] = "Предвестник Скайрисс",
                },
            },
        },
        {
            ["id"] = 247,
            ["image"] = 608193,
            ["name"] = "Аукенайские гробницы",
            ["bosses"] = {
                {
                    ["id"] = 523,
                    ["image"] = 607771,
                    ["name"] = "Ширрак Страж Мертвых",
                },
                {
                    ["id"] = 524,
                    ["image"] = 607600,
                    ["name"] = "Экзарх Маладаар",
                },
            },
        },
        {
            ["id"] = 248,
            ["image"] = 608207,
            ["name"] = "Бастионы Адского Пламени",
            ["bosses"] = {
                {
                    ["id"] = 527,
                    ["image"] = 607817,
                    ["name"] = "Начальник стражи Гарголмар",
                },
                {
                    ["id"] = 528,
                    ["image"] = 607734,
                    ["name"] = "Омор Неодолимый",
                },
                {
                    ["id"] = 529,
                    ["image"] = 607803,
                    ["name"] = "Вазруден Глашатай",
                },
            },
        },
        {
            ["id"] = 257,
            ["image"] = 608218,
            ["name"] = "Ботаника",
            ["bosses"] = {
                {
                    ["id"] = 558,
                    ["image"] = 607570,
                    ["name"] = "Командир Сараннис",
                },
                {
                    ["id"] = 559,
                    ["image"] = 607641,
                    ["name"] = "Верховный ботаник Фрейвин",
                },
                {
                    ["id"] = 560,
                    ["image"] = 607794,
                    ["name"] = "Скалезуб Скорбный",
                },
                {
                    ["id"] = 561,
                    ["image"] = 607683,
                    ["name"] = "Ладж",
                },
                {
                    ["id"] = 562,
                    ["image"] = 607816,
                    ["name"] = "Узлодревень",
                },
            },
        },
        {
            ["id"] = 250,
            ["image"] = 608193,
            ["name"] = "Гробницы маны",
            ["bosses"] = {
                {
                    ["id"] = 534,
                    ["image"] = 607738,
                    ["name"] = "Пандемоний",
                },
                {
                    ["id"] = 535,
                    ["image"] = 607782,
                    ["name"] = "Таварок",
                },
                {
                    ["id"] = 536,
                    ["image"] = 607822,
                    ["name"] = "Йор",
                },
                {
                    ["id"] = 537,
                    ["image"] = 607726,
                    ["name"] = "Принц Шаффар",
                },
            },
        },
        {
            ["id"] = 256,
            ["image"] = 608207,
            ["name"] = "Кузня Крови",
            ["bosses"] = {
                {
                    ["id"] = 555,
                    ["image"] = 607789,
                    ["name"] = "Мастер",
                },
                {
                    ["id"] = 556,
                    ["image"] = 607558,
                    ["name"] = "Броггок",
                },
                {
                    ["id"] = 557,
                    ["image"] = 607670,
                    ["name"] = "Кели'дан Разрушитель",
                },
            },
        },
        {
            ["id"] = 258,
            ["image"] = 608218,
            ["name"] = "Механар",
            ["bosses"] = {
                {
                    ["id"] = 563,
                    ["image"] = 607712,
                    ["name"] = "Механолорд Конденсарон",
                },
                {
                    ["id"] = 564,
                    ["image"] = 607725,
                    ["name"] = "Пустомант Сепетрея",
                },
                {
                    ["id"] = 565,
                    ["image"] = 607739,
                    ["name"] = "Паталеон Вычислитель",
                },
            },
        },
        {
            ["id"] = 262,
            ["image"] = 608199,
            ["name"] = "Нижетопь",
            ["bosses"] = {
                {
                    ["id"] = 576,
                    ["image"] = 607649,
                    ["name"] = "Топеглад",
                },
                {
                    ["id"] = 577,
                    ["image"] = 607614,
                    ["name"] = "Газ'ан",
                },
                {
                    ["id"] = 578,
                    ["image"] = 607779,
                    ["name"] = "Владыка болот Мусел'ек",
                },
                {
                    ["id"] = 579,
                    ["image"] = 607788,
                    ["name"] = "Черная Охотница",
                },
            },
        },
        {
            ["id"] = 261,
            ["image"] = 608199,
            ["name"] = "Паровое подземелье",
            ["bosses"] = {
                {
                    ["id"] = 573,
                    ["image"] = 607651,
                    ["name"] = "Гидромантка Теспия",
                },
                {
                    ["id"] = 574,
                    ["image"] = 607713,
                    ["name"] = "Анжинер Паропуск",
                },
                {
                    ["id"] = 575,
                    ["image"] = 607815,
                    ["name"] = "Полководец Калитреш",
                },
            },
        },
        {
            ["id"] = 259,
            ["image"] = 608207,
            ["name"] = "Разрушенные залы",
            ["bosses"] = {
                {
                    ["id"] = 566,
                    ["image"] = 607624,
                    ["name"] = "Главный чернокнижник Пустоклят",
                },
                {
                    ["id"] = 728,
                    ["image"] = 607556,
                    ["name"] = "Кровавый страж Порунг",
                },
                {
                    ["id"] = 568,
                    ["image"] = 607811,
                    ["name"] = "О'мрогг Завоеватель",
                },
                {
                    ["id"] = 569,
                    ["image"] = 607812,
                    ["name"] = "Вождь Каргат Острорук",
                },
            },
        },
        {
            ["id"] = 252,
            ["image"] = 608193,
            ["name"] = "Сетеккские залы",
            ["bosses"] = {
                {
                    ["id"] = 541,
                    ["image"] = 607583,
                    ["name"] = "Темнопряд Сит",
                },
                {
                    ["id"] = 542,
                    ["image"] = 607544,
                    ["name"] = "Анзу",
                },
                {
                    ["id"] = 543,
                    ["image"] = 607780,
                    ["name"] = "Король воронов Айкисс",
                },
            },
        },
        {
            ["id"] = 251,
            ["image"] = 608198,
            ["name"] = "Старые предгорья Хилсбрада",
            ["bosses"] = {
                {
                    ["id"] = 538,
                    ["image"] = 607689,
                    ["name"] = "Лейтенант Дрейк",
                },
                {
                    ["id"] = 539,
                    ["image"] = 607561,
                    ["name"] = "Капитан Скарлок",
                },
                {
                    ["id"] = 540,
                    ["image"] = 607596,
                    ["name"] = "Охотник Вечности",
                },
            },
        },
        {
            ["id"] = 253,
            ["image"] = 608193,
            ["name"] = "Темный лабиринт",
            ["bosses"] = {
                {
                    ["id"] = 544,
                    ["image"] = 607536,
                    ["name"] = "Посол Гиблочрев",
                },
                {
                    ["id"] = 545,
                    ["image"] = 607555,
                    ["name"] = "Черносерд Подстрекатель",
                },
                {
                    ["id"] = 546,
                    ["image"] = 607625,
                    ["name"] = "Великий мастер Ворпил",
                },
                {
                    ["id"] = 547,
                    ["image"] = 607720,
                    ["name"] = "Бормотун",
                },
            },
        },
        {
            ["id"] = 249,
            ["image"] = 608208,
            ["name"] = "Терраса Магистров",
            ["bosses"] = {
                {
                    ["id"] = 530,
                    ["image"] = 607767,
                    ["name"] = "Селин Огненное Сердце",
                },
                {
                    ["id"] = 531,
                    ["image"] = 607806,
                    ["name"] = "Вексалиус",
                },
                {
                    ["id"] = 532,
                    ["image"] = 607742,
                    ["name"] = "Жрица Делрисса",
                },
                {
                    ["id"] = 533,
                    ["image"] = 607669,
                    ["name"] = "Кель'тас Солнечный Скиталец",
                },
            },
        },
        {
            ["id"] = 260,
            ["image"] = 608199,
            ["name"] = "Узилище",
            ["bosses"] = {
                {
                    ["id"] = 570,
                    ["image"] = 607715,
                    ["name"] = "Менну Предатель",
                },
                {
                    ["id"] = 571,
                    ["image"] = 607759,
                    ["name"] = "Рокмар Трескун",
                },
                {
                    ["id"] = 572,
                    ["image"] = 607750,
                    ["name"] = "Зыбун",
                },
            },
        },
        {
            ["id"] = 255,
            ["image"] = 608198,
            ["name"] = "Черные топи",
            ["bosses"] = {
                {
                    ["id"] = 552,
                    ["image"] = 607566,
                    ["name"] = "Повелитель времени Дежа",
                },
                {
                    ["id"] = 553,
                    ["image"] = 607784,
                    ["name"] = "Темпорус",
                },
                {
                    ["id"] = 554,
                    ["image"] = 607529,
                    ["name"] = "Эонус",
                },
            },
        },
    },
    ["Темные Земли"] = {
        {
            ["id"] = 1192,
            ["image"] = 3850569,
            ["name"] = "Темные Земли",
            ["bosses"] = {
                {
                    ["id"] = 2430,
                    ["image"] = 3752195,
                    ["name"] = "\"Валинор\", Светоч Эпох",
                },
                {
                    ["id"] = 2431,
                    ["image"] = 3752183,
                    ["name"] = "Мортанис",
                },
                {
                    ["id"] = 2432,
                    ["image"] = 3752188,
                    ["name"] = "Ораномонос Вечноветвящаяся",
                },
                {
                    ["id"] = 2433,
                    ["image"] = 3752187,
                    ["name"] = "Нургаш Жижерожденный",
                },
                {
                    ["id"] = 2456,
                    ["image"] = 4071436,
                    ["name"] = "Мор'гет Мучитель проклятых",
                },
                {
                    ["id"] = 2468,
                    ["image"] = 4529365,
                    ["name"] = "Антрос",
                },
            },
        },
        {
            ["id"] = 1190,
            ["image"] = 3759906,
            ["name"] = "Замок Нафрия",
            ["bosses"] = {
                {
                    ["id"] = 2393,
                    ["image"] = 3752190,
                    ["name"] = "Визгунья",
                },
                {
                    ["id"] = 2429,
                    ["image"] = 3753151,
                    ["name"] = "Ловчий Альтимор",
                },
                {
                    ["id"] = 2422,
                    ["image"] = 3753157,
                    ["name"] = "Спасение Солнечного короля",
                },
                {
                    ["id"] = 2418,
                    ["image"] = 3752156,
                    ["name"] = "Изобретатель Зи'мокс",
                },
                {
                    ["id"] = 2428,
                    ["image"] = 3752174,
                    ["name"] = "Алчущий разрушитель",
                },
                {
                    ["id"] = 2420,
                    ["image"] = 3752178,
                    ["name"] = "Леди Инерва Дарквейн",
                },
                {
                    ["id"] = 2426,
                    ["image"] = 3753159,
                    ["name"] = "Совет Крови",
                },
                {
                    ["id"] = 2394,
                    ["image"] = 3752191,
                    ["name"] = "Грязешмяк",
                },
                {
                    ["id"] = 2425,
                    ["image"] = 3753156,
                    ["name"] = "Генералы Каменного легиона",
                },
                {
                    ["id"] = 2424,
                    ["image"] = 3752159,
                    ["name"] = "Сир Денатрий",
                },
            },
        },
        {
            ["id"] = 1193,
            ["image"] = 4182020,
            ["name"] = "Святилище Господства",
            ["bosses"] = {
                {
                    ["id"] = 2435,
                    ["image"] = 4071444,
                    ["name"] = "Таррагр",
                },
                {
                    ["id"] = 2442,
                    ["image"] = 4071426,
                    ["name"] = "Око Тюремщика",
                },
                {
                    ["id"] = 2439,
                    ["image"] = 4071445,
                    ["name"] = "Девять",
                },
                {
                    ["id"] = 2444,
                    ["image"] = 4071439,
                    ["name"] = "Душа Нер'зула",
                },
                {
                    ["id"] = 2445,
                    ["image"] = 4071442,
                    ["name"] = "Раздиратель душ Дормацайн",
                },
                {
                    ["id"] = 2443,
                    ["image"] = 4079051,
                    ["name"] = "Кузнец боли Разнал",
                },
                {
                    ["id"] = 2446,
                    ["image"] = 4071428,
                    ["name"] = "Стражница Предвечных",
                },
                {
                    ["id"] = 2447,
                    ["image"] = 4071427,
                    ["name"] = "Писарь судьбы Ро-Кало",
                },
                {
                    ["id"] = 2440,
                    ["image"] = 4071435,
                    ["name"] = "Кел'Тузад",
                },
                {
                    ["id"] = 2441,
                    ["image"] = 4071443,
                    ["name"] = "Сильвана Ветрокрылая",
                },
            },
        },
        {
            ["id"] = 1195,
            ["image"] = 4423752,
            ["name"] = "Гробница Предвечных",
            ["bosses"] = {
                {
                    ["id"] = 2458,
                    ["image"] = 4465340,
                    ["name"] = "Бдительный Страж",
                },
                {
                    ["id"] = 2465,
                    ["image"] = 4465339,
                    ["name"] = "Сколекс, Ненасытный разоритель",
                },
                {
                    ["id"] = 2470,
                    ["image"] = 4423749,
                    ["name"] = "Изобретатель Зи'мокс",
                },
                {
                    ["id"] = 2459,
                    ["image"] = 4465333,
                    ["name"] = "Падший оракул Даусинь",
                },
                {
                    ["id"] = 2460,
                    ["image"] = 4465337,
                    ["name"] = "Прототип пантеона",
                },
                {
                    ["id"] = 2461,
                    ["image"] = 4465335,
                    ["name"] = "Главный архитектор Лихувим",
                },
                {
                    ["id"] = 2463,
                    ["image"] = 4423738,
                    ["name"] = "Галондрий Возвращающий",
                },
                {
                    ["id"] = 2469,
                    ["image"] = 4423747,
                    ["name"] = "Андуин Ринн",
                },
                {
                    ["id"] = 2457,
                    ["image"] = 4465336,
                    ["name"] = "Властители Ужаса",
                },
                {
                    ["id"] = 2467,
                    ["image"] = 4465338,
                    ["name"] = "Ригелон",
                },
                {
                    ["id"] = 2464,
                    ["image"] = 4465334,
                    ["name"] = "Тюремщик",
                },
            },
        },
        {
            ["id"] = 1189,
            ["image"] = 3759912,
            ["name"] = "Кровавые катакомбы",
            ["bosses"] = {
                {
                    ["id"] = 2388,
                    ["image"] = 3753153,
                    ["name"] = "Криксис Ненасытный",
                },
                {
                    ["id"] = 2415,
                    ["image"] = 3753148,
                    ["name"] = "Вершитель Тарвольд",
                },
                {
                    ["id"] = 2421,
                    ["image"] = 3753149,
                    ["name"] = "Верховная надзирательница Бериллия",
                },
                {
                    ["id"] = 2407,
                    ["image"] = 3752167,
                    ["name"] = "Генерал Кааль",
                },
            },
        },
        {
            ["id"] = 1182,
            ["image"] = 3759910,
            ["name"] = "Смертельная тризна",
            ["bosses"] = {
                {
                    ["id"] = 2395,
                    ["image"] = 3752157,
                    ["name"] = "Чумокост",
                },
                {
                    ["id"] = 2391,
                    ["image"] = 3753146,
                    ["name"] = "Амарт Жнец",
                },
                {
                    ["id"] = 2392,
                    ["image"] = 3753158,
                    ["name"] = "Хирург Трупошов",
                },
                {
                    ["id"] = 2396,
                    ["image"] = 3753155,
                    ["name"] = "Налтор Криомант",
                },
            },
        },
        {
            ["id"] = 1188,
            ["image"] = 3759915,
            ["name"] = "Та Сторона",
            ["bosses"] = {
                {
                    ["id"] = 2408,
                    ["image"] = 3752170,
                    ["name"] = "Хаккар Свежеватель Душ",
                },
                {
                    ["id"] = 2409,
                    ["image"] = 3752193,
                    ["name"] = "Манаштормы",
                },
                {
                    ["id"] = 2398,
                    ["image"] = 3753147,
                    ["name"] = "Дилер Зи'екса",
                },
                {
                    ["id"] = 2410,
                    ["image"] = 3752184,
                    ["name"] = "Мве'зала",
                },
            },
        },
        {
            ["id"] = 1194,
            ["image"] = 4182022,
            ["name"] = "Тайный рынок Тазавеш",
            ["bosses"] = {
                {
                    ["id"] = 2437,
                    ["image"] = 4071449,
                    ["name"] = "Зо'фекс Часовой",
                },
                {
                    ["id"] = 2454,
                    ["image"] = 4071447,
                    ["name"] = "Большой зверинец",
                },
                {
                    ["id"] = 2436,
                    ["image"] = 4071438,
                    ["name"] = "Кавардак на почте",
                },
                {
                    ["id"] = 2452,
                    ["image"] = 4071448,
                    ["name"] = "\"Оазис Мизы\"",
                },
                {
                    ["id"] = 2451,
                    ["image"] = 4071440,
                    ["name"] = "Со'азми",
                },
                {
                    ["id"] = 2448,
                    ["image"] = 4071429,
                    ["name"] = "Хильбранд",
                },
                {
                    ["id"] = 2449,
                    ["image"] = 4071446,
                    ["name"] = "Хронокэп Крюкохвост",
                },
                {
                    ["id"] = 2455,
                    ["image"] = 4071441,
                    ["name"] = "Со'лея",
                },
            },
        },
        {
            ["id"] = 1187,
            ["image"] = 3759914,
            ["name"] = "Театр Боли",
            ["bosses"] = {
                {
                    ["id"] = 2397,
                    ["image"] = 3752153,
                    ["name"] = "Оскорбление претендентов",
                },
                {
                    ["id"] = 2401,
                    ["image"] = 3752169,
                    ["name"] = "Кроворуб",
                },
                {
                    ["id"] = 2390,
                    ["image"] = 3752199,
                    ["name"] = "Ксав Несломленный",
                },
                {
                    ["id"] = 2389,
                    ["image"] = 3753154,
                    ["name"] = "Кул'тарок",
                },
                {
                    ["id"] = 2417,
                    ["image"] = 3752182,
                    ["name"] = "Мордрета, Вечная императрица",
                },
            },
        },
        {
            ["id"] = 1184,
            ["image"] = 3759909,
            ["name"] = "Туманы Тирна Скитта",
            ["bosses"] = {
                {
                    ["id"] = 2400,
                    ["image"] = 3753152,
                    ["name"] = "Ингра Малох",
                },
                {
                    ["id"] = 2402,
                    ["image"] = 3752181,
                    ["name"] = "Призывательница Туманов",
                },
                {
                    ["id"] = 2405,
                    ["image"] = 3752194,
                    ["name"] = "Тред'ова",
                },
            },
        },
        {
            ["id"] = 1185,
            ["image"] = 3759908,
            ["name"] = "Чертоги Покаяния",
            ["bosses"] = {
                {
                    ["id"] = 2406,
                    ["image"] = 3752171,
                    ["name"] = "Халкиас, запятнанный грехом голиаф",
                },
                {
                    ["id"] = 2387,
                    ["image"] = 3752165,
                    ["name"] = "Эшелон",
                },
                {
                    ["id"] = 2411,
                    ["image"] = 3753150,
                    ["name"] = "Верховный адъюдикатор Ализа",
                },
                {
                    ["id"] = 2413,
                    ["image"] = 3752179,
                    ["name"] = "Лорд-камергер",
                },
            },
        },
        {
            ["id"] = 1183,
            ["image"] = 3759911,
            ["name"] = "Чумные каскады",
            ["bosses"] = {
                {
                    ["id"] = 2419,
                    ["image"] = 3752168,
                    ["name"] = "Склизгл",
                },
                {
                    ["id"] = 2403,
                    ["image"] = 3752162,
                    ["name"] = "Доктор Икус",
                },
                {
                    ["id"] = 2423,
                    ["image"] = 3752163,
                    ["name"] = "Домина Отравленный Клинок",
                },
                {
                    ["id"] = 2404,
                    ["image"] = 3752180,
                    ["name"] = "Маркграфиня Страдама",
                },
            },
        },
        {
            ["id"] = 1186,
            ["image"] = 3759913,
            ["name"] = "Шпили Перерождения",
            ["bosses"] = {
                {
                    ["id"] = 2399,
                    ["image"] = 3752177,
                    ["name"] = "Кин-Тара",
                },
                {
                    ["id"] = 2416,
                    ["image"] = 3752198,
                    ["name"] = "\"Вентунакс\"",
                },
                {
                    ["id"] = 2414,
                    ["image"] = 3752189,
                    ["name"] = "\"Орифрион\"",
                },
                {
                    ["id"] = 2412,
                    ["image"] = 3752160,
                    ["name"] = "Девия, идеал Сомнения",
                },
            },
        },
    },
    ["Legion"] = {
        {
            ["id"] = 822,
            ["image"] = 1411854,
            ["name"] = "Расколотые острова",
            ["bosses"] = {
                {
                    ["id"] = 1790,
                    ["image"] = 1411023,
                    ["name"] = "Ана-Муз",
                },
                {
                    ["id"] = 1956,
                    ["image"] = 1134499,
                    ["name"] = "Апокрон",
                },
                {
                    ["id"] = 1883,
                    ["image"] = 1385722,
                    ["name"] = "Бруталл",
                },
                {
                    ["id"] = 1774,
                    ["image"] = 1411024,
                    ["name"] = "Каламир",
                },
                {
                    ["id"] = 1789,
                    ["image"] = 1411025,
                    ["name"] = "Драгон Зиморожденный",
                },
                {
                    ["id"] = 1795,
                    ["image"] = 1472454,
                    ["name"] = "Обломок",
                },
                {
                    ["id"] = 1770,
                    ["image"] = 1411026,
                    ["name"] = "Хумонгрис",
                },
                {
                    ["id"] = 1769,
                    ["image"] = 1411027,
                    ["name"] = "Левантия",
                },
                {
                    ["id"] = 1884,
                    ["image"] = 1579937,
                    ["name"] = "Малификус",
                },
                {
                    ["id"] = 1783,
                    ["image"] = 1411028,
                    ["name"] = "На'зак Одержимый",
                },
                {
                    ["id"] = 1749,
                    ["image"] = 1411029,
                    ["name"] = "Нитхегг",
                },
                {
                    ["id"] = 1763,
                    ["image"] = 1411030,
                    ["name"] = "Шар'тос",
                },
                {
                    ["id"] = 1885,
                    ["image"] = 1579941,
                    ["name"] = "Си'ваш",
                },
                {
                    ["id"] = 1756,
                    ["image"] = 1411031,
                    ["name"] = "Охотники за душами",
                },
                {
                    ["id"] = 1796,
                    ["image"] = 1472455,
                    ["name"] = "Иссохший Дж'им",
                },
            },
        },
        {
            ["id"] = 768,
            ["image"] = 1452687,
            ["name"] = "Изумрудный Кошмар",
            ["bosses"] = {
                {
                    ["id"] = 1703,
                    ["image"] = 1410972,
                    ["name"] = "Низендра",
                },
                {
                    ["id"] = 1738,
                    ["image"] = 1410960,
                    ["name"] = "Ил'гинот, Сердце Порчи",
                },
                {
                    ["id"] = 1744,
                    ["image"] = 1410947,
                    ["name"] = "Элерет Дикая Лань",
                },
                {
                    ["id"] = 1667,
                    ["image"] = 1410991,
                    ["name"] = "Урсок",
                },
                {
                    ["id"] = 1704,
                    ["image"] = 1410945,
                    ["name"] = "Драконы Кошмара",
                },
                {
                    ["id"] = 1750,
                    ["image"] = 1410940,
                    ["name"] = "Кенарий",
                },
                {
                    ["id"] = 1726,
                    ["image"] = 1410994,
                    ["name"] = "Ксавий",
                },
            },
        },
        {
            ["id"] = 861,
            ["image"] = 1537284,
            ["name"] = "Испытание доблести",
            ["bosses"] = {
                {
                    ["id"] = 1819,
                    ["image"] = 1410974,
                    ["name"] = "Один",
                },
                {
                    ["id"] = 1830,
                    ["image"] = 1536491,
                    ["name"] = "Гарм",
                },
                {
                    ["id"] = 1829,
                    ["image"] = 1410957,
                    ["name"] = "Хелия",
                },
            },
        },
        {
            ["id"] = 786,
            ["image"] = 1450575,
            ["name"] = "Цитадель Ночи",
            ["bosses"] = {
                {
                    ["id"] = 1706,
                    ["image"] = 1410981,
                    ["name"] = "Скорпирон",
                },
                {
                    ["id"] = 1725,
                    ["image"] = 1410941,
                    ["name"] = "Хрономатическая аномалия",
                },
                {
                    ["id"] = 1731,
                    ["image"] = 1410989,
                    ["name"] = "Триллиакс",
                },
                {
                    ["id"] = 1751,
                    ["image"] = 1410983,
                    ["name"] = "Заклинательница клинков Алуриэль",
                },
                {
                    ["id"] = 1762,
                    ["image"] = 1410987,
                    ["name"] = "Тихондрий",
                },
                {
                    ["id"] = 1713,
                    ["image"] = 1410965,
                    ["name"] = "Крос",
                },
                {
                    ["id"] = 1761,
                    ["image"] = 1410939,
                    ["name"] = "Верховный ботаник Тел'арн",
                },
                {
                    ["id"] = 1732,
                    ["image"] = 1410984,
                    ["name"] = "Звездный авгур Этрей",
                },
                {
                    ["id"] = 1743,
                    ["image"] = 1410954,
                    ["name"] = "Великий магистр Элисанда",
                },
                {
                    ["id"] = 1737,
                    ["image"] = 1410955,
                    ["name"] = "Гул'дан",
                },
            },
        },
        {
            ["id"] = 875,
            ["image"] = 1616106,
            ["name"] = "Гробница Саргераса",
            ["bosses"] = {
                {
                    ["id"] = 1862,
                    ["image"] = 1579934,
                    ["name"] = "Горот",
                },
                {
                    ["id"] = 1867,
                    ["image"] = 1579936,
                    ["name"] = "Демоническая инквизиция",
                },
                {
                    ["id"] = 1856,
                    ["image"] = 1579940,
                    ["name"] = "Харджатан",
                },
                {
                    ["id"] = 1903,
                    ["image"] = 1579935,
                    ["name"] = "Сестры Луны",
                },
                {
                    ["id"] = 1861,
                    ["image"] = 1579939,
                    ["name"] = "Госпожа Сашж'ин",
                },
                {
                    ["id"] = 1896,
                    ["image"] = 1579943,
                    ["name"] = "Сонм страданий",
                },
                {
                    ["id"] = 1897,
                    ["image"] = 1579933,
                    ["name"] = "Бдительная дева",
                },
                {
                    ["id"] = 1873,
                    ["image"] = 1579932,
                    ["name"] = "Аватара Падшего",
                },
                {
                    ["id"] = 1898,
                    ["image"] = 1385746,
                    ["name"] = "Кил'джеден",
                },
            },
        },
        {
            ["id"] = 946,
            ["image"] = 1718211,
            ["name"] = "Анторус, Пылающий Трон",
            ["bosses"] = {
                {
                    ["id"] = 1992,
                    ["image"] = 1715210,
                    ["name"] = "Разрушитель миров Кин'гарота",
                },
                {
                    ["id"] = 1987,
                    ["image"] = 1715209,
                    ["name"] = "Гончие Саргераса",
                },
                {
                    ["id"] = 1997,
                    ["image"] = 1715225,
                    ["name"] = "Военный совет Анторуса",
                },
                {
                    ["id"] = 1985,
                    ["image"] = 1715219,
                    ["name"] = "Хранительница порталов Азабель",
                },
                {
                    ["id"] = 2025,
                    ["image"] = 1715208,
                    ["name"] = "Эонар, Хранительница жизни",
                },
                {
                    ["id"] = 2009,
                    ["image"] = 1715211,
                    ["name"] = "Ловец душ Имонар",
                },
                {
                    ["id"] = 2004,
                    ["image"] = 1715213,
                    ["name"] = "Кин'гарот",
                },
                {
                    ["id"] = 1983,
                    ["image"] = 1715223,
                    ["name"] = "Вариматрас",
                },
                {
                    ["id"] = 1986,
                    ["image"] = 1715222,
                    ["name"] = "Ковен шиварр",
                },
                {
                    ["id"] = 1984,
                    ["image"] = 1715207,
                    ["name"] = "Агграмар",
                },
                {
                    ["id"] = 2031,
                    ["image"] = 1715536,
                    ["name"] = "Аргус Порабощенный",
                },
            },
        },
        {
            ["id"] = 959,
            ["image"] = 1718212,
            ["name"] = "Точки вторжения",
            ["bosses"] = {
                {
                    ["id"] = 2010,
                    ["image"] = 1715215,
                    ["name"] = "Госпожа Фолнуна",
                },
                {
                    ["id"] = 2011,
                    ["image"] = 1715216,
                    ["name"] = "Госпожа Аллюрадель",
                },
                {
                    ["id"] = 2012,
                    ["image"] = 1715212,
                    ["name"] = "Инквизитор Мето",
                },
                {
                    ["id"] = 2013,
                    ["image"] = 1715217,
                    ["name"] = "Окулярус",
                },
                {
                    ["id"] = 2014,
                    ["image"] = 1715221,
                    ["name"] = "Сотанатор",
                },
                {
                    ["id"] = 2015,
                    ["image"] = 1715218,
                    ["name"] = "Властитель преисподней Веролом",
                },
            },
        },
        {
            ["id"] = 860,
            ["image"] = 1537283,
            ["name"] = "Возвращение в Каражан",
            ["bosses"] = {
                {
                    ["id"] = 1820,
                    ["image"] = 1536495,
                    ["name"] = "Оперный зал: \"Злюкер\"",
                },
                {
                    ["id"] = 1826,
                    ["image"] = 1536494,
                    ["name"] = "Оперный зал: \"Однажды в Западном крае\"",
                },
                {
                    ["id"] = 1827,
                    ["image"] = 1536493,
                    ["name"] = "Оперный зал: \"Красавица и Зверь\"",
                },
                {
                    ["id"] = 1825,
                    ["image"] = 1378997,
                    ["name"] = "Благочестивая дева",
                },
                {
                    ["id"] = 1835,
                    ["image"] = 1536490,
                    ["name"] = "Ловчий Аттумен",
                },
                {
                    ["id"] = 1837,
                    ["image"] = 1378999,
                    ["name"] = "Мороуз",
                },
                {
                    ["id"] = 1836,
                    ["image"] = 1379020,
                    ["name"] = "Смотритель",
                },
                {
                    ["id"] = 1817,
                    ["image"] = 1536496,
                    ["name"] = "Тень Медива",
                },
                {
                    ["id"] = 1818,
                    ["image"] = 1536492,
                    ["name"] = "Пожиратель маны",
                },
                {
                    ["id"] = 1838,
                    ["image"] = 1536497,
                    ["name"] = "Виз'адуум Всевидящий",
                },
            },
        },
        {
            ["id"] = 707,
            ["image"] = 1411858,
            ["name"] = "Казематы Стражей",
            ["bosses"] = {
                {
                    ["id"] = 1467,
                    ["image"] = 1410988,
                    ["name"] = "Тиратон Салтерил",
                },
                {
                    ["id"] = 1695,
                    ["image"] = 1410962,
                    ["name"] = "Инквизитор Истязарий",
                },
                {
                    ["id"] = 1468,
                    ["image"] = 1410937,
                    ["name"] = "Вул'кан",
                },
                {
                    ["id"] = 1469,
                    ["image"] = 1410952,
                    ["name"] = "Смотрящий",
                },
                {
                    ["id"] = 1470,
                    ["image"] = 1410942,
                    ["name"] = "Кордана Оскверненная Песнь",
                },
            },
        },
        {
            ["id"] = 726,
            ["image"] = 1411857,
            ["name"] = "Катакомбы Сурамара",
            ["bosses"] = {
                {
                    ["id"] = 1497,
                    ["image"] = 1410963,
                    ["name"] = "Иванир",
                },
                {
                    ["id"] = 1498,
                    ["image"] = 1410943,
                    ["name"] = "Корстилакс",
                },
                {
                    ["id"] = 1499,
                    ["image"] = 1410951,
                    ["name"] = "Генерал Ксакал",
                },
                {
                    ["id"] = 1500,
                    ["image"] = 1410970,
                    ["name"] = "Нал'тира",
                },
                {
                    ["id"] = 1501,
                    ["image"] = 1410934,
                    ["name"] = "Советник Вандрос",
                },
            },
        },
        {
            ["id"] = 800,
            ["image"] = 1498156,
            ["name"] = "Квартал Звезд",
            ["bosses"] = {
                {
                    ["id"] = 1718,
                    ["image"] = 1410975,
                    ["name"] = "Капитан патруля Гердо",
                },
                {
                    ["id"] = 1719,
                    ["image"] = 1410985,
                    ["name"] = "Таликса Пламя Гнева",
                },
                {
                    ["id"] = 1720,
                    ["image"] = 1410933,
                    ["name"] = "Советник Меландр",
                },
            },
        },
        {
            ["id"] = 740,
            ["image"] = 1411853,
            ["name"] = "Крепость Черной Ладьи",
            ["bosses"] = {
                {
                    ["id"] = 1518,
                    ["image"] = 1410986,
                    ["name"] = "Слияние душ",
                },
                {
                    ["id"] = 1653,
                    ["image"] = 1410961,
                    ["name"] = "Иллисанна Гребень Ворона",
                },
                {
                    ["id"] = 1664,
                    ["image"] = 1410982,
                    ["name"] = "Хмуродроб Лютый",
                },
                {
                    ["id"] = 1672,
                    ["image"] = 1410967,
                    ["name"] = "Лорд Кур'талос Гребень Ворона",
                },
            },
        },
        {
            ["id"] = 767,
            ["image"] = 1450574,
            ["name"] = "Логово Нелтариона",
            ["bosses"] = {
                {
                    ["id"] = 1662,
                    ["image"] = 1410976,
                    ["name"] = "Рокмора",
                },
                {
                    ["id"] = 1665,
                    ["image"] = 1410990,
                    ["name"] = "Уларогг Скаломол",
                },
                {
                    ["id"] = 1673,
                    ["image"] = 1410971,
                    ["name"] = "Нараксас",
                },
                {
                    ["id"] = 1687,
                    ["image"] = 1410944,
                    ["name"] = "Король подземелий Даргрул",
                },
            },
        },
        {
            ["id"] = 716,
            ["image"] = 1498157,
            ["name"] = "Око Азшары",
            ["bosses"] = {
                {
                    ["id"] = 1480,
                    ["image"] = 1410992,
                    ["name"] = "Полководец Паржеш",
                },
                {
                    ["id"] = 1490,
                    ["image"] = 1410966,
                    ["name"] = "Леди Кольцо Ненависти",
                },
                {
                    ["id"] = 1491,
                    ["image"] = 1410964,
                    ["name"] = "Король Волнобород",
                },
                {
                    ["id"] = 1479,
                    ["image"] = 1410978,
                    ["name"] = "Змеикс",
                },
                {
                    ["id"] = 1492,
                    ["image"] = 1410993,
                    ["name"] = "Гнев Азшары",
                },
            },
        },
        {
            ["id"] = 945,
            ["image"] = 1718213,
            ["name"] = "Престол Триумвирата",
            ["bosses"] = {
                {
                    ["id"] = 1979,
                    ["image"] = 1715226,
                    ["name"] = "Зураал Перерожденный",
                },
                {
                    ["id"] = 1980,
                    ["image"] = 1715220,
                    ["name"] = "Сарпиш",
                },
                {
                    ["id"] = 1981,
                    ["image"] = 1715224,
                    ["name"] = "Наместник Незжар",
                },
                {
                    ["id"] = 1982,
                    ["image"] = 1715214,
                    ["name"] = "Л'ура",
                },
            },
        },
        {
            ["id"] = 900,
            ["image"] = 1616922,
            ["name"] = "Собор Вечной Ночи",
            ["bosses"] = {
                {
                    ["id"] = 1905,
                    ["image"] = 1579930,
                    ["name"] = "Агронокс",
                },
                {
                    ["id"] = 1906,
                    ["image"] = 1579942,
                    ["name"] = "Долбогрыз Глумливый",
                },
                {
                    ["id"] = 1904,
                    ["image"] = 1579931,
                    ["name"] = "Доматракс",
                },
                {
                    ["id"] = 1878,
                    ["image"] = 1579938,
                    ["name"] = "Мефистрот",
                },
            },
        },
        {
            ["id"] = 727,
            ["image"] = 1411856,
            ["name"] = "Утроба Душ",
            ["bosses"] = {
                {
                    ["id"] = 1502,
                    ["image"] = 1410995,
                    ["name"] = "Имирон, падший король",
                },
                {
                    ["id"] = 1512,
                    ["image"] = 1410956,
                    ["name"] = "Харбарон",
                },
                {
                    ["id"] = 1663,
                    ["image"] = 1410957,
                    ["name"] = "Хелия",
                },
            },
        },
        {
            ["id"] = 762,
            ["image"] = 1411855,
            ["name"] = "Чаща Темного Сердца",
            ["bosses"] = {
                {
                    ["id"] = 1654,
                    ["image"] = 1410936,
                    ["name"] = "Верховный друид Глайдалис",
                },
                {
                    ["id"] = 1655,
                    ["image"] = 1410973,
                    ["name"] = "Дубосерд",
                },
                {
                    ["id"] = 1656,
                    ["image"] = 1410946,
                    ["name"] = "Дресарон",
                },
                {
                    ["id"] = 1657,
                    ["image"] = 1410979,
                    ["name"] = "Тень Ксавия",
                },
            },
        },
        {
            ["id"] = 721,
            ["image"] = 1498158,
            ["name"] = "Чертоги Доблести",
            ["bosses"] = {
                {
                    ["id"] = 1485,
                    ["image"] = 1410958,
                    ["name"] = "Химдалль",
                },
                {
                    ["id"] = 1486,
                    ["image"] = 1410959,
                    ["name"] = "Хирья",
                },
                {
                    ["id"] = 1487,
                    ["image"] = 1410949,
                    ["name"] = "Фенрир",
                },
                {
                    ["id"] = 1488,
                    ["image"] = 1410953,
                    ["name"] = "Король-бог Сковальд",
                },
                {
                    ["id"] = 1489,
                    ["image"] = 1410974,
                    ["name"] = "Один",
                },
            },
        },
        {
            ["id"] = 777,
            ["image"] = 1498155,
            ["name"] = "Штурм Аметистовой крепости",
            ["bosses"] = {
                {
                    ["id"] = 1693,
                    ["image"] = 1410950,
                    ["name"] = "Тухломорд",
                },
                {
                    ["id"] = 1694,
                    ["image"] = 1410980,
                    ["name"] = "Ледопасть",
                },
                {
                    ["id"] = 1702,
                    ["image"] = 1410938,
                    ["name"] = "Кровавая принцесса Тал'ена",
                },
                {
                    ["id"] = 1686,
                    ["image"] = 1410969,
                    ["name"] = "Пожиратель разума Каарж",
                },
                {
                    ["id"] = 1688,
                    ["image"] = 1410968,
                    ["name"] = "Миллифисент Манашторм",
                },
                {
                    ["id"] = 1696,
                    ["image"] = 1410935,
                    ["name"] = "Ануб'ессет",
                },
                {
                    ["id"] = 1697,
                    ["image"] = 1410977,
                    ["name"] = "Саел'орн",
                },
                {
                    ["id"] = 1711,
                    ["image"] = 1410948,
                    ["name"] = "Повелитель Скверны Бетруг",
                },
            },
        },
    },
    ["Cataclysm"] = {
        {
            ["id"] = 75,
            ["image"] = 522349,
            ["name"] = "Крепость Барадин",
            ["bosses"] = {
                {
                    ["id"] = 139,
                    ["image"] = 522198,
                    ["name"] = "Аргалот",
                },
                {
                    ["id"] = 140,
                    ["image"] = 523207,
                    ["name"] = "Оку'тар",
                },
                {
                    ["id"] = 339,
                    ["image"] = 571742,
                    ["name"] = "Ализабаль",
                },
            },
        },
        {
            ["id"] = 72,
            ["image"] = 522355,
            ["name"] = "Сумеречный бастион",
            ["bosses"] = {
                {
                    ["id"] = 156,
                    ["image"] = 522232,
                    ["name"] = "Халфий Змеерез",
                },
                {
                    ["id"] = 157,
                    ["image"] = 522274,
                    ["name"] = "Тералион и Валиона",
                },
                {
                    ["id"] = 158,
                    ["image"] = 522224,
                    ["name"] = "Совет Перерожденных",
                },
                {
                    ["id"] = 167,
                    ["image"] = 522212,
                    ["name"] = "Чо'Галл",
                },
            },
        },
        {
            ["id"] = 73,
            ["image"] = 522351,
            ["name"] = "Твердыня Крыла Тьмы",
            ["bosses"] = {
                {
                    ["id"] = 169,
                    ["image"] = 522250,
                    ["name"] = "Защитная система \"Омнитрон\"",
                },
                {
                    ["id"] = 170,
                    ["image"] = 522251,
                    ["name"] = "Магмарь",
                },
                {
                    ["id"] = 171,
                    ["image"] = 522202,
                    ["name"] = "Атрамед",
                },
                {
                    ["id"] = 172,
                    ["image"] = 522211,
                    ["name"] = "Химерон",
                },
                {
                    ["id"] = 173,
                    ["image"] = 522252,
                    ["name"] = "Малориак",
                },
                {
                    ["id"] = 174,
                    ["image"] = 522255,
                    ["name"] = "Гибель Нефариана",
                },
            },
        },
        {
            ["id"] = 74,
            ["image"] = 522359,
            ["name"] = "Трон Четырех Ветров",
            ["bosses"] = {
                {
                    ["id"] = 154,
                    ["image"] = 522196,
                    ["name"] = "Конклав ветра",
                },
                {
                    ["id"] = 155,
                    ["image"] = 522191,
                    ["name"] = "Ал'акир",
                },
            },
        },
        {
            ["id"] = 78,
            ["image"] = 522353,
            ["name"] = "Огненные Просторы",
            ["bosses"] = {
                {
                    ["id"] = 192,
                    ["image"] = 522208,
                    ["name"] = "Бет'тилак",
                },
                {
                    ["id"] = 193,
                    ["image"] = 522248,
                    ["name"] = "Повелитель Риолит",
                },
                {
                    ["id"] = 194,
                    ["image"] = 522193,
                    ["name"] = "Алисразор",
                },
                {
                    ["id"] = 195,
                    ["image"] = 522268,
                    ["name"] = "Шэннокс",
                },
                {
                    ["id"] = 196,
                    ["image"] = 522204,
                    ["name"] = "Бейлрок, привратник",
                },
                {
                    ["id"] = 197,
                    ["image"] = 522223,
                    ["name"] = "Мажордом Фэндрал Олений Шлем",
                },
                {
                    ["id"] = 198,
                    ["image"] = 522261,
                    ["name"] = "Рагнарос",
                },
            },
        },
        {
            ["id"] = 187,
            ["image"] = 571753,
            ["name"] = "Душа Дракона",
            ["bosses"] = {
                {
                    ["id"] = 311,
                    ["image"] = 536058,
                    ["name"] = "Морхок",
                },
                {
                    ["id"] = 324,
                    ["image"] = 536061,
                    ["name"] = "Полководец Зон'озз",
                },
                {
                    ["id"] = 325,
                    ["image"] = 536062,
                    ["name"] = "Йор'садж Неспящий",
                },
                {
                    ["id"] = 317,
                    ["image"] = 536057,
                    ["name"] = "Хагара Владычица Штормов",
                },
                {
                    ["id"] = 331,
                    ["image"] = 571750,
                    ["name"] = "Ультраксион",
                },
                {
                    ["id"] = 332,
                    ["image"] = 571752,
                    ["name"] = "Воевода Черный Рог",
                },
                {
                    ["id"] = 318,
                    ["image"] = 536056,
                    ["name"] = "Хребет Смертокрыла",
                },
                {
                    ["id"] = 333,
                    ["image"] = 536055,
                    ["name"] = "Безумие Смертокрыла",
                },
            },
        },
        {
            ["id"] = 68,
            ["image"] = 522361,
            ["name"] = "Вершина Смерча",
            ["bosses"] = {
                {
                    ["id"] = 114,
                    ["image"] = 522229,
                    ["name"] = "Великий визирь Эртан",
                },
                {
                    ["id"] = 115,
                    ["image"] = 522192,
                    ["name"] = "Альтаирий",
                },
                {
                    ["id"] = 116,
                    ["image"] = 522200,
                    ["name"] = "Асаад, калиф зефиров",
                },
            },
        },
        {
            ["id"] = 186,
            ["image"] = 571755,
            ["name"] = "Время Сумерек",
            ["bosses"] = {
                {
                    ["id"] = 322,
                    ["image"] = 571743,
                    ["name"] = "Аркурион",
                },
                {
                    ["id"] = 342,
                    ["image"] = 536054,
                    ["name"] = "Азира Убийца Зари",
                },
                {
                    ["id"] = 341,
                    ["image"] = 536053,
                    ["name"] = "Архиепископ Бенедикт",
                },
            },
        },
        {
            ["id"] = 71,
            ["image"] = 522354,
            ["name"] = "Грим Батол",
            ["bosses"] = {
                {
                    ["id"] = 131,
                    ["image"] = 522227,
                    ["name"] = "Генерал Умбрисс",
                },
                {
                    ["id"] = 132,
                    ["image"] = 522226,
                    ["name"] = "Начальник кузни Тронг",
                },
                {
                    ["id"] = 133,
                    ["image"] = 522218,
                    ["name"] = "Драгх Горячий Мрак",
                },
                {
                    ["id"] = 134,
                    ["image"] = 522222,
                    ["name"] = "Эрудакс, властитель недр",
                },
            },
        },
        {
            ["id"] = 69,
            ["image"] = 522357,
            ["name"] = "Затерянный город Тол'вир",
            ["bosses"] = {
                {
                    ["id"] = 117,
                    ["image"] = 523205,
                    ["name"] = "Генерал Хусам",
                },
                {
                    ["id"] = 118,
                    ["image"] = 522246,
                    ["name"] = "Зубохлоп",
                },
                {
                    ["id"] = 119,
                    ["image"] = 522239,
                    ["name"] = "Верховный пророк Барим",
                },
                {
                    ["id"] = 122,
                    ["image"] = 522269,
                    ["name"] = "Сиамат",
                },
            },
        },
        {
            ["id"] = 77,
            ["image"] = 522363,
            ["name"] = "Зул'Аман",
            ["bosses"] = {
                {
                    ["id"] = 186,
                    ["image"] = 522190,
                    ["name"] = "Акил'зон",
                },
                {
                    ["id"] = 187,
                    ["image"] = 522254,
                    ["name"] = "Налоракк",
                },
                {
                    ["id"] = 188,
                    ["image"] = 522242,
                    ["name"] = "Джан'алай",
                },
                {
                    ["id"] = 189,
                    ["image"] = 522231,
                    ["name"] = "Халаззи",
                },
                {
                    ["id"] = 190,
                    ["image"] = 522235,
                    ["name"] = "Повелитель проклятий Малакрасс",
                },
                {
                    ["id"] = 191,
                    ["image"] = 522217,
                    ["name"] = "Даакара",
                },
            },
        },
        {
            ["id"] = 76,
            ["image"] = 522364,
            ["name"] = "Зул'Гуруб",
            ["bosses"] = {
                {
                    ["id"] = 175,
                    ["image"] = 522236,
                    ["name"] = "Верховный жрец Веноксис",
                },
                {
                    ["id"] = 176,
                    ["image"] = 522209,
                    ["name"] = "Мандокир Повелитель Крови",
                },
                {
                    ["id"] = 177,
                    ["image"] = 522230,
                    ["name"] = "Тайник Безумия – Гри'лек",
                },
                {
                    ["id"] = 178,
                    ["image"] = 522233,
                    ["name"] = "Тайник Безумия – Хазза'рах",
                },
                {
                    ["id"] = 179,
                    ["image"] = 522263,
                    ["name"] = "Тайник Безумия – Ренатаки",
                },
                {
                    ["id"] = 180,
                    ["image"] = 522279,
                    ["name"] = "Тайник Безумия – Вушулай",
                },
                {
                    ["id"] = 181,
                    ["image"] = 522238,
                    ["name"] = "Верховная жрица Килнара",
                },
                {
                    ["id"] = 184,
                    ["image"] = 522280,
                    ["name"] = "Занзил",
                },
                {
                    ["id"] = 185,
                    ["image"] = 522243,
                    ["name"] = "Джин'до Низвергатель Богов",
                },
            },
        },
        {
            ["id"] = 185,
            ["image"] = 571756,
            ["name"] = "Источник Вечности",
            ["bosses"] = {
                {
                    ["id"] = 290,
                    ["image"] = 536060,
                    ["name"] = "Перот'арн",
                },
                {
                    ["id"] = 291,
                    ["image"] = 571747,
                    ["name"] = "Королева Азшара",
                },
                {
                    ["id"] = 292,
                    ["image"] = 571746,
                    ["name"] = "Маннорот и Варо'тен",
                },
            },
        },
        {
            ["id"] = 67,
            ["image"] = 522360,
            ["name"] = "Каменные Недра",
            ["bosses"] = {
                {
                    ["id"] = 110,
                    ["image"] = 522215,
                    ["name"] = "Корбор",
                },
                {
                    ["id"] = 111,
                    ["image"] = 522271,
                    ["name"] = "Камнешкур",
                },
                {
                    ["id"] = 112,
                    ["image"] = 522258,
                    ["name"] = "Озрук",
                },
                {
                    ["id"] = 113,
                    ["image"] = 522237,
                    ["name"] = "Верховная жрица Азил",
                },
            },
        },
        {
            ["id"] = 184,
            ["image"] = 571754,
            ["name"] = "Конец Времен",
            ["bosses"] = {
                {
                    ["id"] = 340,
                    ["image"] = 571744,
                    ["name"] = "Эхо Бейна",
                },
                {
                    ["id"] = 285,
                    ["image"] = 571745,
                    ["name"] = "Эхо Джайны",
                },
                {
                    ["id"] = 323,
                    ["image"] = 571748,
                    ["name"] = "Эхо Сильваны",
                },
                {
                    ["id"] = 283,
                    ["image"] = 571749,
                    ["name"] = "Эхо Тиранды",
                },
                {
                    ["id"] = 289,
                    ["image"] = 536059,
                    ["name"] = "Дорнозму",
                },
            },
        },
        {
            ["id"] = 64,
            ["image"] = 522358,
            ["name"] = "Крепость Темного Клыка",
            ["bosses"] = {
                {
                    ["id"] = 96,
                    ["image"] = 522205,
                    ["name"] = "Барон Эшбери",
                },
                {
                    ["id"] = 97,
                    ["image"] = 522206,
                    ["name"] = "Барон Сильверлейн",
                },
                {
                    ["id"] = 98,
                    ["image"] = 522213,
                    ["name"] = "Командир Спрингвейл",
                },
                {
                    ["id"] = 99,
                    ["image"] = 522249,
                    ["name"] = "Лорд Вальден",
                },
                {
                    ["id"] = 100,
                    ["image"] = 522247,
                    ["name"] = "Лорд Годфри",
                },
            },
        },
        {
            ["id"] = 63,
            ["image"] = 522352,
            ["name"] = "Мертвые копи",
            ["bosses"] = {
                {
                    ["id"] = 89,
                    ["image"] = 522228,
                    ["name"] = "Глубток",
                },
                {
                    ["id"] = 90,
                    ["image"] = 522234,
                    ["name"] = "Хеликс Отломчикс",
                },
                {
                    ["id"] = 91,
                    ["image"] = 522225,
                    ["name"] = "Врагорез-5000",
                },
                {
                    ["id"] = 92,
                    ["image"] = 522189,
                    ["name"] = "Адмирал Терзающий Рев",
                },
                {
                    ["id"] = 93,
                    ["image"] = 522210,
                    ["name"] = "\"Капитан\" Пирожок",
                },
                {
                    ["id"] = 95,
                    ["image"] = 522278,
                    ["name"] = "Ванесса ван Клиф",
                },
            },
        },
        {
            ["id"] = 66,
            ["image"] = 522350,
            ["name"] = "Пещеры Черной горы",
            ["bosses"] = {
                {
                    ["id"] = 105,
                    ["image"] = 522266,
                    ["name"] = "Ром'огг Костекрушитель",
                },
                {
                    ["id"] = 106,
                    ["image"] = 522216,
                    ["name"] = "Глашатай сумрака Корла",
                },
                {
                    ["id"] = 107,
                    ["image"] = 522244,
                    ["name"] = "Карш Гнущий Сталь",
                },
                {
                    ["id"] = 108,
                    ["image"] = 522207,
                    ["name"] = "Красавица",
                },
                {
                    ["id"] = 109,
                    ["image"] = 522201,
                    ["name"] = "Повелитель Перерожденных Обсидий",
                },
            },
        },
        {
            ["id"] = 65,
            ["image"] = 522362,
            ["name"] = "Трон Приливов",
            ["bosses"] = {
                {
                    ["id"] = 101,
                    ["image"] = 522245,
                    ["name"] = "Леди Наз'жар",
                },
                {
                    ["id"] = 102,
                    ["image"] = 522214,
                    ["name"] = "Командир Улток, разлагающийся принц",
                },
                {
                    ["id"] = 103,
                    ["image"] = 522253,
                    ["name"] = "Подчиняющий разум Гур'ша",
                },
                {
                    ["id"] = 104,
                    ["image"] = 522259,
                    ["name"] = "Озумат",
                },
            },
        },
        {
            ["id"] = 70,
            ["image"] = 522356,
            ["name"] = "Чертоги Созидания",
            ["bosses"] = {
                {
                    ["id"] = 124,
                    ["image"] = 522272,
                    ["name"] = "Храмовый страж Ануур",
                },
                {
                    ["id"] = 125,
                    ["image"] = 522219,
                    ["name"] = "Пта Ярость Земли",
                },
                {
                    ["id"] = 126,
                    ["image"] = 522195,
                    ["name"] = "Анрафет",
                },
                {
                    ["id"] = 127,
                    ["image"] = 522241,
                    ["name"] = "Изисет, творение Магии",
                },
                {
                    ["id"] = 128,
                    ["image"] = 522194,
                    ["name"] = "Аммунаэ, творение Жизни",
                },
                {
                    ["id"] = 129,
                    ["image"] = 522267,
                    ["name"] = "Сетеш, творение Разрушения",
                },
                {
                    ["id"] = 130,
                    ["image"] = 522262,
                    ["name"] = "Радж, творение Солнца",
                },
            },
        },
    },
    ["Mists of Pandaria"] = {
        {
            ["id"] = 322,
            ["image"] = 652218,
            ["name"] = "Пандария",
            ["bosses"] = {
                {
                    ["id"] = 691,
                    ["image"] = 630847,
                    ["name"] = "Ша Злости",
                },
                {
                    ["id"] = 725,
                    ["image"] = 630819,
                    ["name"] = "Отряд Сальиса",
                },
                {
                    ["id"] = 814,
                    ["image"] = 796778,
                    ["name"] = "Налак, Повелитель Гроз",
                },
                {
                    ["id"] = 826,
                    ["image"] = 796779,
                    ["name"] = "Ундаста",
                },
                {
                    ["id"] = 857,
                    ["image"] = 901155,
                    ["name"] = "Чи-Цзи, Красный Журавль",
                },
                {
                    ["id"] = 858,
                    ["image"] = 901173,
                    ["name"] = "Юй-лун, Нефритовая Змея",
                },
                {
                    ["id"] = 859,
                    ["image"] = 901165,
                    ["name"] = "Нюцзао, Черный Бык",
                },
                {
                    ["id"] = 860,
                    ["image"] = 901172,
                    ["name"] = "Сюэнь, Белый Тигр",
                },
                {
                    ["id"] = 861,
                    ["image"] = 901167,
                    ["name"] = "Ордос, огненный бог яунголов",
                },
            },
        },
        {
            ["id"] = 317,
            ["image"] = 632273,
            ["name"] = "Подземелья Могу'шан",
            ["bosses"] = {
                {
                    ["id"] = 679,
                    ["image"] = 630820,
                    ["name"] = "Каменные стражи",
                },
                {
                    ["id"] = 689,
                    ["image"] = 630824,
                    ["name"] = "Фэн Проклятый",
                },
                {
                    ["id"] = 682,
                    ["image"] = 630826,
                    ["name"] = "Душелов Гара'джал",
                },
                {
                    ["id"] = 687,
                    ["image"] = 630861,
                    ["name"] = "Призрачные короли",
                },
                {
                    ["id"] = 726,
                    ["image"] = 630823,
                    ["name"] = "Элегон",
                },
                {
                    ["id"] = 677,
                    ["image"] = 630836,
                    ["name"] = "Воля императора",
                },
            },
        },
        {
            ["id"] = 330,
            ["image"] = 632271,
            ["name"] = "Сердце Страха",
            ["bosses"] = {
                {
                    ["id"] = 745,
                    ["image"] = 630834,
                    ["name"] = "Императорский визирь Зор'лок",
                },
                {
                    ["id"] = 744,
                    ["image"] = 630817,
                    ["name"] = "Повелитель клинков Та'як",
                },
                {
                    ["id"] = 713,
                    ["image"] = 630827,
                    ["name"] = "Гаралон",
                },
                {
                    ["id"] = 741,
                    ["image"] = 630856,
                    ["name"] = "Повелитель ветров Мел'джарак",
                },
                {
                    ["id"] = 737,
                    ["image"] = 630815,
                    ["name"] = "Ваятель янтаря Ун'сок",
                },
                {
                    ["id"] = 743,
                    ["image"] = 630830,
                    ["name"] = "Великая императрица Шек'зир",
                },
            },
        },
        {
            ["id"] = 320,
            ["image"] = 643264,
            ["name"] = "Терраса Вечной Весны",
            ["bosses"] = {
                {
                    ["id"] = 683,
                    ["image"] = 630844,
                    ["name"] = "Вечные защитники",
                },
                {
                    ["id"] = 742,
                    ["image"] = 630854,
                    ["name"] = "Цулон",
                },
                {
                    ["id"] = 729,
                    ["image"] = 630837,
                    ["name"] = "Лэй Ши",
                },
                {
                    ["id"] = 709,
                    ["image"] = 630849,
                    ["name"] = "Ша Страха",
                },
            },
        },
        {
            ["id"] = 362,
            ["image"] = 828453,
            ["name"] = "Престол Гроз",
            ["bosses"] = {
                {
                    ["id"] = 827,
                    ["image"] = 796776,
                    ["name"] = "Джин'рок Разрушитель",
                },
                {
                    ["id"] = 819,
                    ["image"] = 796774,
                    ["name"] = "Хорридон",
                },
                {
                    ["id"] = 816,
                    ["image"] = 796770,
                    ["name"] = "Совет старейшин",
                },
                {
                    ["id"] = 825,
                    ["image"] = 796781,
                    ["name"] = "Тортос",
                },
                {
                    ["id"] = 821,
                    ["image"] = 796786,
                    ["name"] = "Мегера",
                },
                {
                    ["id"] = 828,
                    ["image"] = 796785,
                    ["name"] = "Цзи-Кунь",
                },
                {
                    ["id"] = 818,
                    ["image"] = 796772,
                    ["name"] = "Дуруму Позабытый",
                },
                {
                    ["id"] = 820,
                    ["image"] = 796780,
                    ["name"] = "Изначалий",
                },
                {
                    ["id"] = 824,
                    ["image"] = 796771,
                    ["name"] = "Темный Анимус",
                },
                {
                    ["id"] = 817,
                    ["image"] = 796775,
                    ["name"] = "Кон Железный",
                },
                {
                    ["id"] = 829,
                    ["image"] = 796773,
                    ["name"] = "Небесные сестры",
                },
                {
                    ["id"] = 832,
                    ["image"] = 796777,
                    ["name"] = "Лэй Шэнь",
                },
            },
        },
        {
            ["id"] = 369,
            ["image"] = 904981,
            ["name"] = "Осада Оргриммара",
            ["bosses"] = {
                {
                    ["id"] = 852,
                    ["image"] = 901160,
                    ["name"] = "Глубиний",
                },
                {
                    ["id"] = 849,
                    ["image"] = 901159,
                    ["name"] = "Павшие защитники",
                },
                {
                    ["id"] = 866,
                    ["image"] = 901166,
                    ["name"] = "Норусхен",
                },
                {
                    ["id"] = 867,
                    ["image"] = 901168,
                    ["name"] = "Ша Гордыни",
                },
                {
                    ["id"] = 868,
                    ["image"] = 901156,
                    ["name"] = "Галакрас",
                },
                {
                    ["id"] = 864,
                    ["image"] = 901161,
                    ["name"] = "\"Железный исполин\"",
                },
                {
                    ["id"] = 856,
                    ["image"] = 901163,
                    ["name"] = "Кор'кронские темные шаманы",
                },
                {
                    ["id"] = 850,
                    ["image"] = 901158,
                    ["name"] = "Генерал Назгрим",
                },
                {
                    ["id"] = 846,
                    ["image"] = 901164,
                    ["name"] = "Малкорок",
                },
                {
                    ["id"] = 870,
                    ["image"] = 901170,
                    ["name"] = "Пандарийские трофеи",
                },
                {
                    ["id"] = 851,
                    ["image"] = 901171,
                    ["name"] = "Ток Кровожадный",
                },
                {
                    ["id"] = 865,
                    ["image"] = 901169,
                    ["name"] = "Мастер осады Черноплавс",
                },
                {
                    ["id"] = 853,
                    ["image"] = 901162,
                    ["name"] = "Идеалы клакси",
                },
                {
                    ["id"] = 869,
                    ["image"] = 901157,
                    ["name"] = "Гаррош Адский Крик",
                },
            },
        },
        {
            ["id"] = 303,
            ["image"] = 632270,
            ["name"] = "Врата Заходящего Солнца",
            ["bosses"] = {
                {
                    ["id"] = 655,
                    ["image"] = 630846,
                    ["name"] = "Диверсант Кип'тилак",
                },
                {
                    ["id"] = 675,
                    ["image"] = 630851,
                    ["name"] = "Боец Га'док",
                },
                {
                    ["id"] = 676,
                    ["image"] = 630821,
                    ["name"] = "Командир Ри'мок",
                },
                {
                    ["id"] = 649,
                    ["image"] = 630845,
                    ["name"] = "Райгонн",
                },
            },
        },
        {
            ["id"] = 321,
            ["image"] = 632272,
            ["name"] = "Дворец Могу'шан",
            ["bosses"] = {
                {
                    ["id"] = 708,
                    ["image"] = 630842,
                    ["name"] = "Королевское испытание",
                },
                {
                    ["id"] = 690,
                    ["image"] = 630828,
                    ["name"] = "Геккан",
                },
                {
                    ["id"] = 698,
                    ["image"] = 630859,
                    ["name"] = "Синь Мастер Боя",
                },
            },
        },
        {
            ["id"] = 311,
            ["image"] = 643262,
            ["name"] = "Залы Алого ордена",
            ["bosses"] = {
                {
                    ["id"] = 660,
                    ["image"] = 630833,
                    ["name"] = "Псарь Браун",
                },
                {
                    ["id"] = 654,
                    ["image"] = 630816,
                    ["name"] = "Воитель Гарлан",
                },
                {
                    ["id"] = 656,
                    ["image"] = 630825,
                    ["name"] = "Ткач пламени Кеглер",
                },
            },
        },
        {
            ["id"] = 316,
            ["image"] = 608214,
            ["name"] = "Монастырь Алого ордена",
            ["bosses"] = {
                {
                    ["id"] = 688,
                    ["image"] = 630853,
                    ["name"] = "Талнос Воздаятель Душ",
                },
                {
                    ["id"] = 671,
                    ["image"] = 630818,
                    ["name"] = "Брат Корлофф",
                },
                {
                    ["id"] = 674,
                    ["image"] = 607643,
                    ["name"] = "Верховный инквизитор Вайтмейн",
                },
            },
        },
        {
            ["id"] = 312,
            ["image"] = 632274,
            ["name"] = "Монастырь Шадо-Пан",
            ["bosses"] = {
                {
                    ["id"] = 673,
                    ["image"] = 630831,
                    ["name"] = "Гу Небесный Удар",
                },
                {
                    ["id"] = 657,
                    ["image"] = 630841,
                    ["name"] = "Мастер Снежный Вихрь",
                },
                {
                    ["id"] = 685,
                    ["image"] = 630850,
                    ["name"] = "Ша жестокости",
                },
                {
                    ["id"] = 686,
                    ["image"] = 630852,
                    ["name"] = "Тажань Чжу",
                },
            },
        },
        {
            ["id"] = 246,
            ["image"] = 608215,
            ["name"] = "Некроситет",
            ["bosses"] = {
                {
                    ["id"] = 659,
                    ["image"] = 630835,
                    ["name"] = "Инструктор Ледяное Сердце",
                },
                {
                    ["id"] = 663,
                    ["image"] = 607666,
                    ["name"] = "Джандис Барова",
                },
                {
                    ["id"] = 665,
                    ["image"] = 607755,
                    ["name"] = "Громоклин",
                },
                {
                    ["id"] = 666,
                    ["image"] = 630838,
                    ["name"] = "Лилиан Восс",
                },
                {
                    ["id"] = 684,
                    ["image"] = 607582,
                    ["name"] = "Темный магистр Гандлинг",
                },
            },
        },
        {
            ["id"] = 324,
            ["image"] = 643263,
            ["name"] = "Осада храма Нюцзао",
            ["bosses"] = {
                {
                    ["id"] = 693,
                    ["image"] = 630855,
                    ["name"] = "Визирь Цзинь'бак",
                },
                {
                    ["id"] = 738,
                    ["image"] = 630822,
                    ["name"] = "Командир Во'цзак",
                },
                {
                    ["id"] = 692,
                    ["image"] = 630829,
                    ["name"] = "Генерал Па'валак",
                },
                {
                    ["id"] = 727,
                    ["image"] = 630857,
                    ["name"] = "Командующий флангом Нер'онок",
                },
            },
        },
        {
            ["id"] = 302,
            ["image"] = 632275,
            ["name"] = "Хмелеварня Буйных Портеров",
            ["bosses"] = {
                {
                    ["id"] = 668,
                    ["image"] = 630843,
                    ["name"] = "Ук-Ук",
                },
                {
                    ["id"] = 669,
                    ["image"] = 630832,
                    ["name"] = "Прыгопотам",
                },
                {
                    ["id"] = 670,
                    ["image"] = 630860,
                    ["name"] = "Янь-Чжу Высвобожденный",
                },
            },
        },
        {
            ["id"] = 313,
            ["image"] = 632276,
            ["name"] = "Храм Нефритовой Змеи",
            ["bosses"] = {
                {
                    ["id"] = 672,
                    ["image"] = 630858,
                    ["name"] = "Мудрый Марис",
                },
                {
                    ["id"] = 664,
                    ["image"] = 630840,
                    ["name"] = "Хранитель истории Каменная Поступь",
                },
                {
                    ["id"] = 658,
                    ["image"] = 630839,
                    ["name"] = "Лю Пламенное Сердце",
                },
                {
                    ["id"] = 335,
                    ["image"] = 630848,
                    ["name"] = "Ша Сомнения",
                },
            },
        },
    },
    ["Классические подземелья"] = {
        {
            ["id"] = 741,
            ["image"] = 1396586,
            ["name"] = "Огненные недра",
            ["bosses"] = {
                {
                    ["id"] = 1519,
                    ["image"] = 1378993,
                    ["name"] = "Люцифрон",
                },
                {
                    ["id"] = 1520,
                    ["image"] = 1378995,
                    ["name"] = "Магмадар",
                },
                {
                    ["id"] = 1521,
                    ["image"] = 1378976,
                    ["name"] = "Гееннас",
                },
                {
                    ["id"] = 1522,
                    ["image"] = 1378975,
                    ["name"] = "Гарр",
                },
                {
                    ["id"] = 1523,
                    ["image"] = 1379013,
                    ["name"] = "Шаззрах",
                },
                {
                    ["id"] = 1524,
                    ["image"] = 1378966,
                    ["name"] = "Барон Геддон",
                },
                {
                    ["id"] = 1525,
                    ["image"] = 1379015,
                    ["name"] = "Предвестник Сульфурон",
                },
                {
                    ["id"] = 1526,
                    ["image"] = 1378978,
                    ["name"] = "Големагг Испепелитель",
                },
                {
                    ["id"] = 1527,
                    ["image"] = 1378998,
                    ["name"] = "Мажордом Экзекутус",
                },
                {
                    ["id"] = 1528,
                    ["image"] = 522261,
                    ["name"] = "Рагнарос",
                },
            },
        },
        {
            ["id"] = 742,
            ["image"] = 1396580,
            ["name"] = "Логово Крыла Тьмы",
            ["bosses"] = {
                {
                    ["id"] = 1529,
                    ["image"] = 1379008,
                    ["name"] = "Бритвосмерт Неукротимый",
                },
                {
                    ["id"] = 1530,
                    ["image"] = 1379022,
                    ["name"] = "Валестраз Порочный",
                },
                {
                    ["id"] = 1531,
                    ["image"] = 1378968,
                    ["name"] = "Предводитель драконов Разящий Бич",
                },
                {
                    ["id"] = 1532,
                    ["image"] = 1378973,
                    ["name"] = "Огнечрев",
                },
                {
                    ["id"] = 1533,
                    ["image"] = 1378971,
                    ["name"] = "Черноскал",
                },
                {
                    ["id"] = 1534,
                    ["image"] = 1378974,
                    ["name"] = "Пламегор",
                },
                {
                    ["id"] = 1535,
                    ["image"] = 1378969,
                    ["name"] = "Хромаггус",
                },
                {
                    ["id"] = 1536,
                    ["image"] = 1379001,
                    ["name"] = "Нефариан",
                },
            },
        },
        {
            ["id"] = 743,
            ["image"] = 1396591,
            ["name"] = "Руины Ан'Киража",
            ["bosses"] = {
                {
                    ["id"] = 1537,
                    ["image"] = 1385749,
                    ["name"] = "Куриннакс",
                },
                {
                    ["id"] = 1538,
                    ["image"] = 1385734,
                    ["name"] = "Генерал Раджакс",
                },
                {
                    ["id"] = 1539,
                    ["image"] = 1385755,
                    ["name"] = "Моам",
                },
                {
                    ["id"] = 1540,
                    ["image"] = 1385723,
                    ["name"] = "Буру Ненасытный",
                },
                {
                    ["id"] = 1541,
                    ["image"] = 1385718,
                    ["name"] = "Аямисса Охотница",
                },
                {
                    ["id"] = 1542,
                    ["image"] = 1385759,
                    ["name"] = "Оссириан Неуязвимый",
                },
            },
        },
        {
            ["id"] = 744,
            ["image"] = 1396593,
            ["name"] = "Храм Ан'Киража",
            ["bosses"] = {
                {
                    ["id"] = 1543,
                    ["image"] = 1385769,
                    ["name"] = "Пророк Скерам",
                },
                {
                    ["id"] = 1547,
                    ["image"] = 1390436,
                    ["name"] = "Царственность силитида",
                },
                {
                    ["id"] = 1544,
                    ["image"] = 1385720,
                    ["name"] = "Боевой страж Сартура",
                },
                {
                    ["id"] = 1545,
                    ["image"] = 1385728,
                    ["name"] = "Фанкрисс Непреклонный",
                },
                {
                    ["id"] = 1548,
                    ["image"] = 1385771,
                    ["name"] = "Нечистотон",
                },
                {
                    ["id"] = 1546,
                    ["image"] = 1385761,
                    ["name"] = "Принцесса Хухуран",
                },
                {
                    ["id"] = 1549,
                    ["image"] = 1390437,
                    ["name"] = "Императоры-близнецы",
                },
                {
                    ["id"] = 1550,
                    ["image"] = 1385760,
                    ["name"] = "Оуро",
                },
                {
                    ["id"] = 1551,
                    ["image"] = 1385726,
                    ["name"] = "К'Тун",
                },
            },
        },
        {
          ["id"] = 745,
          ["image"] = 1396587,
          ["name"] = "Наксрамас",
          ["bosses"] = {
              {
                  ["id"] = 1552,
                  ["image"] = 1378964,
                  ["name"] = "Ануб'Рекан",
              },
              {
                  ["id"] = 1553,
                  ["image"] = 1378980,
                  ["name"] = "Великая вдова Фарлина",
              },
              {
                  ["id"] = 1554,
                  ["image"] = 1378994,
                  ["name"] = "Мексна",
              },
              {
                  ["id"] = 1555,
                  ["image"] = 1379004,
                  ["name"] = "Нот Чумной",
              },
              {
                  ["id"] = 1556,
                  ["image"] = 1378984,
                  ["name"] = "Хейган Нечестивый",
              },
              {
                  ["id"] = 1557,
                  ["image"] = 1378991,
                  ["name"] = "Лотхиб",
              },
              {
                  ["id"] = 1558,
                  ["image"] = 1378988,
                  ["name"] = "Инструктор Разувий",
              },
              {
                  ["id"] = 1559,
                  ["image"] = 1378979,
                  ["name"] = "Готик Жнец",
              },
              {
                  ["id"] = 1560,
                  ["image"] = 1385732,
                  ["name"] = "Четыре Всадника",
              },
              {
                  ["id"] = 1561,
                  ["image"] = 1379005,
                  ["name"] = "Лоскутик",
              },
              {
                  ["id"] = 1562,
                  ["image"] = 1378981,
                  ["name"] = "Гроббулус",
              },
              {
                  ["id"] = 1563,
                  ["image"] = 1378977,
                  ["name"] = "Глут",
              },
              {
                  ["id"] = 1564,
                  ["image"] = 1379019,
                  ["name"] = "Таддиус",
              },
              {
                  ["id"] = 1565,
                  ["image"] = 1379010,
                  ["name"] = "Сапфирон",
              },
              {
                  ["id"] = 1566,
                  ["image"] = 1378989,
                  ["name"] = "Кел'Тузад",
              },
          },
      },
        {
            ["id"] = 228,
            ["image"] = 608196,
            ["name"] = "Глубины Черной горы",
            ["bosses"] = {
                {
                    ["id"] = 369,
                    ["image"] = 607644,
                    ["name"] = "Верховный дознаватель Герштан",
                },
                {
                    ["id"] = 370,
                    ["image"] = 607697,
                    ["name"] = "Лорд Роккор",
                },
                {
                    ["id"] = 371,
                    ["image"] = 607647,
                    ["name"] = "Псарь Гребмар",
                },
                {
                    ["id"] = 372,
                    ["image"] = 608314,
                    ["name"] = "Зал Правосудия",
                },
                {
                    ["id"] = 373,
                    ["image"] = 607749,
                    ["name"] = "Пиромант Зерно Мудрости",
                },
                {
                    ["id"] = 374,
                    ["image"] = 607694,
                    ["name"] = "Лорд Опалитель",
                },
                {
                    ["id"] = 375,
                    ["image"] = 607814,
                    ["name"] = "Тюремщик Стилгисс",
                },
                {
                    ["id"] = 376,
                    ["image"] = 607602,
                    ["name"] = "Финий Темнострой",
                },
                {
                    ["id"] = 377,
                    ["image"] = 607549,
                    ["name"] = "Бейл'Гор",
                },
                {
                    ["id"] = 378,
                    ["image"] = 607610,
                    ["name"] = "Генерал Кузня Гнева",
                },
                {
                    ["id"] = 379,
                    ["image"] = 607618,
                    ["name"] = "Повелитель големов Аргелмах",
                },
                {
                    ["id"] = 380,
                    ["image"] = 607650,
                    ["name"] = "Харли Чернопых",
                },
                {
                    ["id"] = 381,
                    ["image"] = 607740,
                    ["name"] = "Фаланг",
                },
                {
                    ["id"] = 383,
                    ["image"] = 607741,
                    ["name"] = "Штоппор Наливалс",
                },
                {
                    ["id"] = 384,
                    ["image"] = 607535,
                    ["name"] = "Посол Огнехлыст",
                },
                {
                    ["id"] = 385,
                    ["image"] = 607587,
                    ["name"] = "Семеро",
                },
                {
                    ["id"] = 386,
                    ["image"] = 607705,
                    ["name"] = "Магмус",
                },
                {
                    ["id"] = 387,
                    ["image"] = 607595,
                    ["name"] = "Император Дагран Тауриссан",
                },
            },
        },
        {
            ["id"] = 231,
            ["image"] = 608202,
            ["name"] = "Гномреган",
            ["bosses"] = {
                {
                    ["id"] = 419,
                    ["image"] = 607628,
                    ["name"] = "Грязнюк",
                },
                {
                    ["id"] = 420,
                    ["image"] = 607808,
                    ["name"] = "Липкая муть",
                },
                {
                    ["id"] = 421,
                    ["image"] = 607594,
                    ["name"] = "\"Электрошокер-6000\"",
                },
                {
                    ["id"] = 418,
                    ["image"] = 607572,
                    ["name"] = "\"Толпогон 9-60\"",
                },
                {
                    ["id"] = 422,
                    ["image"] = 607714,
                    ["name"] = "Анжинер Термоштепсель",
                },
            },
        },
        {
            ["id"] = 230,
            ["image"] = 608200,
            ["name"] = "Забытый город",
            ["bosses"] = {
                {
                    ["id"] = 402,
                    ["image"] = 607824,
                    ["name"] = "Зеврим Терновое Копыто",
                },
                {
                    ["id"] = 403,
                    ["image"] = 607653,
                    ["name"] = "Гидротварь",
                },
                {
                    ["id"] = 404,
                    ["image"] = 607686,
                    ["name"] = "Лефтендрис",
                },
                {
                    ["id"] = 405,
                    ["image"] = 607533,
                    ["name"] = "Алззин Перевертень",
                },
                {
                    ["id"] = 406,
                    ["image"] = 607785,
                    ["name"] = "Тендрис Криводрев",
                },
                {
                    ["id"] = 407,
                    ["image"] = 607656,
                    ["name"] = "Иллиана Воронья Ольха",
                },
                {
                    ["id"] = 408,
                    ["image"] = 607703,
                    ["name"] = "Магистр Календрис",
                },
                {
                    ["id"] = 409,
                    ["image"] = 607657,
                    ["name"] = "Бессмер'тер",
                },
                {
                    ["id"] = 410,
                    ["image"] = 607745,
                    ["name"] = "Принц Тортелдрин",
                },
                {
                    ["id"] = 411,
                    ["image"] = 607630,
                    ["name"] = "Стражник Мол'дар",
                },
                {
                    ["id"] = 412,
                    ["image"] = 607777,
                    ["name"] = "Топотун Криг",
                },
                {
                    ["id"] = 413,
                    ["image"] = 607629,
                    ["name"] = "Стражник Фенгус",
                },
                {
                    ["id"] = 414,
                    ["image"] = 607631,
                    ["name"] = "Стражник Слип'кик",
                },
                {
                    ["id"] = 415,
                    ["image"] = 607560,
                    ["name"] = "Капитан Давигром",
                },
                {
                    ["id"] = 416,
                    ["image"] = 607565,
                    ["name"] = "Чо'Раш Наблюдатель",
                },
                {
                    ["id"] = 417,
                    ["image"] = 607673,
                    ["name"] = "Король Гордок",
                },
            },
        },
        {
            ["id"] = 311,
            ["image"] = 643262,
            ["name"] = "Залы Алого ордена",
            ["bosses"] = {
                {
                    ["id"] = 660,
                    ["image"] = 630833,
                    ["name"] = "Псарь Браун",
                },
                {
                    ["id"] = 654,
                    ["image"] = 630816,
                    ["name"] = "Воитель Гарлан",
                },
                {
                    ["id"] = 656,
                    ["image"] = 630825,
                    ["name"] = "Ткач пламени Кеглер",
                },
            },
        },
        {
            ["id"] = 241,
            ["image"] = 608230,
            ["name"] = "Зул'Фаррак",
            ["bosses"] = {
                {
                    ["id"] = 483,
                    ["image"] = 607614,
                    ["name"] = "Газ'рилла",
                },
                {
                    ["id"] = 484,
                    ["image"] = 607541,
                    ["name"] = "Анту'сул",
                },
                {
                    ["id"] = 485,
                    ["image"] = 607793,
                    ["name"] = "Тека Мученик",
                },
                {
                    ["id"] = 486,
                    ["image"] = 607819,
                    ["name"] = "Знахарь Зум'ра",
                },
                {
                    ["id"] = 487,
                    ["image"] = 607723,
                    ["name"] = "Некрум и Шезз'зиз",
                },
                {
                    ["id"] = 489,
                    ["image"] = 607564,
                    ["name"] = "Вождь Укорз Песчаный Череп",
                },
            },
        },
        {
            ["id"] = 64,
            ["image"] = 522358,
            ["name"] = "Крепость Темного Клыка",
            ["bosses"] = {
                {
                    ["id"] = 96,
                    ["image"] = 522205,
                    ["name"] = "Барон Эшбери",
                },
                {
                    ["id"] = 97,
                    ["image"] = 522206,
                    ["name"] = "Барон Сильверлейн",
                },
                {
                    ["id"] = 98,
                    ["image"] = 522213,
                    ["name"] = "Командир Спрингвейл",
                },
                {
                    ["id"] = 99,
                    ["image"] = 522249,
                    ["name"] = "Лорд Вальден",
                },
                {
                    ["id"] = 100,
                    ["image"] = 522247,
                    ["name"] = "Лорд Годфри",
                },
            },
        },
        {
            ["id"] = 233,
            ["image"] = 608212,
            ["name"] = "Курганы Иглошкурых",
            ["bosses"] = {
                {
                    ["id"] = 1142,
                    ["image"] = 607633,
                    ["name"] = "Аарукс",
                },
                {
                    ["id"] = 433,
                    ["image"] = 607718,
                    ["name"] = "Мордреш Огненный Глаз",
                },
                {
                    ["id"] = 1143,
                    ["image"] = 1064178,
                    ["name"] = "Мягконог",
                },
                {
                    ["id"] = 1146,
                    ["image"] = 607584,
                    ["name"] = "Вестник смерти Черношип",
                },
                {
                    ["id"] = 1141,
                    ["image"] = 607537,
                    ["name"] = "Амненнар Хладовей",
                },
            },
        },
        {
            ["id"] = 234,
            ["image"] = 608213,
            ["name"] = "Лабиринты Иглошкурых",
            ["bosses"] = {
                {
                    ["id"] = 896,
                    ["image"] = 607531,
                    ["name"] = "Охотник Костяной Бивень",
                },
                {
                    ["id"] = 895,
                    ["image"] = 607760,
                    ["name"] = "Ругуг",
                },
                {
                    ["id"] = 899,
                    ["image"] = 607736,
                    ["name"] = "Полководец Злоклык",
                },
                {
                    ["id"] = 900,
                    ["image"] = 1064175,
                    ["name"] = "Гройат Слепой Охотник",
                },
                {
                    ["id"] = 901,
                    ["image"] = 607563,
                    ["name"] = "Чарлга Остробок",
                },
            },
        },
        {
            ["id"] = 232,
            ["image"] = 608209,
            ["name"] = "Мародон",
            ["bosses"] = {
                {
                    ["id"] = 423,
                    ["image"] = 607728,
                    ["name"] = "Ноксион",
                },
                {
                    ["id"] = 424,
                    ["image"] = 607756,
                    ["name"] = "Бритвохлест",
                },
                {
                    ["id"] = 425,
                    ["image"] = 607796,
                    ["name"] = "Ремонтник Гизлок",
                },
                {
                    ["id"] = 427,
                    ["image"] = 607699,
                    ["name"] = "Лорд Злоязыкий",
                },
                {
                    ["id"] = 428,
                    ["image"] = 607562,
                    ["name"] = "Келебрас Проклятый",
                },
                {
                    ["id"] = 429,
                    ["image"] = 607684,
                    ["name"] = "Обвал",
                },
                {
                    ["id"] = 430,
                    ["image"] = 607761,
                    ["name"] = "Гнилопасть",
                },
                {
                    ["id"] = 431,
                    ["image"] = 607747,
                    ["name"] = "Принцесса Терадрас",
                },
            },
        },
        {
            ["id"] = 63,
            ["image"] = 522352,
            ["name"] = "Мертвые копи",
            ["bosses"] = {
                {
                    ["id"] = 89,
                    ["image"] = 522228,
                    ["name"] = "Глубток",
                },
                {
                    ["id"] = 90,
                    ["image"] = 522234,
                    ["name"] = "Хеликс Отломчикс",
                },
                {
                    ["id"] = 91,
                    ["image"] = 522225,
                    ["name"] = "Врагорез-5000",
                },
                {
                    ["id"] = 92,
                    ["image"] = 522189,
                    ["name"] = "Адмирал Терзающий Рев",
                },
                {
                    ["id"] = 93,
                    ["image"] = 522210,
                    ["name"] = "\"Капитан\" Пирожок",
                },
                {
                    ["id"] = 95,
                    ["image"] = 522278,
                    ["name"] = "Ванесса ван Клиф",
                },
            },
        },
        {
            ["id"] = 316,
            ["image"] = 608214,
            ["name"] = "Монастырь Алого ордена",
            ["bosses"] = {
                {
                    ["id"] = 688,
                    ["image"] = 630853,
                    ["name"] = "Талнос Воздаятель Душ",
                },
                {
                    ["id"] = 671,
                    ["image"] = 630818,
                    ["name"] = "Брат Корлофф",
                },
                {
                    ["id"] = 674,
                    ["image"] = 607643,
                    ["name"] = "Верховный инквизитор Вайтмейн",
                },
            },
        },
        {
            ["id"] = 246,
            ["image"] = 608215,
            ["name"] = "Некроситет",
            ["bosses"] = {
                {
                    ["id"] = 659,
                    ["image"] = 630835,
                    ["name"] = "Инструктор Ледяное Сердце",
                },
                {
                    ["id"] = 663,
                    ["image"] = 607666,
                    ["name"] = "Джандис Барова",
                },
                {
                    ["id"] = 665,
                    ["image"] = 607755,
                    ["name"] = "Громоклин",
                },
                {
                    ["id"] = 666,
                    ["image"] = 630838,
                    ["name"] = "Лилиан Восс",
                },
                {
                    ["id"] = 684,
                    ["image"] = 607582,
                    ["name"] = "Темный магистр Гандлинг",
                },
            },
        },
        {
            ["id"] = 227,
            ["image"] = 608195,
            ["name"] = "Непроглядная Пучина",
            ["bosses"] = {
                {
                    ["id"] = 368,
                    ["image"] = 1064179,
                    ["name"] = "Гхаму-ра",
                },
                {
                    ["id"] = 436,
                    ["image"] = 1064180,
                    ["name"] = "Домина",
                },
                {
                    ["id"] = 426,
                    ["image"] = 522214,
                    ["name"] = "Поработитель Кор'ул",
                },
                {
                    ["id"] = 1145,
                    ["image"] = 1064181,
                    ["name"] = "Тукр",
                },
                {
                    ["id"] = 447,
                    ["image"] = 1064182,
                    ["name"] = "Страж пучины",
                },
                {
                    ["id"] = 1144,
                    ["image"] = 1064183,
                    ["name"] = "Палач Мясодел",
                },
                {
                    ["id"] = 437,
                    ["image"] = 1064184,
                    ["name"] = "Сумеречный владыка Балтиэль",
                },
                {
                    ["id"] = 444,
                    ["image"] = 607532,
                    ["name"] = "Аку'май",
                },
            },
        },
        {
            ["id"] = 229,
            ["image"] = 608197,
            ["name"] = "Нижняя часть пика Черной горы",
            ["bosses"] = {
                {
                    ["id"] = 388,
                    ["image"] = 607645,
                    ["name"] = "Вождь Омокк",
                },
                {
                    ["id"] = 389,
                    ["image"] = 607769,
                    ["name"] = "Темная охотница Вос'гаджин",
                },
                {
                    ["id"] = 390,
                    ["image"] = 607810,
                    ["name"] = "Воевода Вун",
                },
                {
                    ["id"] = 391,
                    ["image"] = 607719,
                    ["name"] = "Мать Дымная Паутина",
                },
                {
                    ["id"] = 392,
                    ["image"] = 607801,
                    ["name"] = "Аррок Смертный Вопль",
                },
                {
                    ["id"] = 393,
                    ["image"] = 607751,
                    ["name"] = "Интендант Зигрис",
                },
                {
                    ["id"] = 394,
                    ["image"] = 607634,
                    ["name"] = "Халикон",
                },
                {
                    ["id"] = 395,
                    ["image"] = 607615,
                    ["name"] = "Гизрул Поработитель",
                },
                {
                    ["id"] = 396,
                    ["image"] = 607737,
                    ["name"] = "Властитель Змейталак",
                },
            },
        },
        {
            ["id"] = 226,
            ["image"] = 608211,
            ["name"] = "Огненная Пропасть",
            ["bosses"] = {
                {
                    ["id"] = 694,
                    ["image"] = 608309,
                    ["name"] = "Адарогг",
                },
                {
                    ["id"] = 695,
                    ["image"] = 608310,
                    ["name"] = "Темный шаман Корантал",
                },
                {
                    ["id"] = 696,
                    ["image"] = 522251,
                    ["name"] = "Брюхошлак",
                },
                {
                    ["id"] = 697,
                    ["image"] = 608315,
                    ["name"] = "Лавовый страж Гордот",
                },
            },
        },
        {
            ["id"] = 240,
            ["image"] = 608229,
            ["name"] = "Пещеры Стенаний",
            ["bosses"] = {
                {
                    ["id"] = 474,
                    ["image"] = 607680,
                    ["name"] = "Леди Анакондра",
                },
                {
                    ["id"] = 476,
                    ["image"] = 607696,
                    ["name"] = "Лорд Питонас",
                },
                {
                    ["id"] = 475,
                    ["image"] = 607693,
                    ["name"] = "Лорд Кобран",
                },
                {
                    ["id"] = 477,
                    ["image"] = 607676,
                    ["name"] = "Криг",
                },
                {
                    ["id"] = 478,
                    ["image"] = 607775,
                    ["name"] = "Шкам",
                },
                {
                    ["id"] = 479,
                    ["image"] = 607698,
                    ["name"] = "Лорд Серпентис",
                },
                {
                    ["id"] = 480,
                    ["image"] = 607805,
                    ["name"] = "Вердан Вечноживущий",
                },
                {
                    ["id"] = 481,
                    ["image"] = 607721,
                    ["name"] = "Мутанус Пожиратель",
                },
            },
        },
        {
            ["id"] = 236,
            ["image"] = 608216,
            ["name"] = "Стратхольм",
            ["bosses"] = {
                {
                    ["id"] = 443,
                    ["image"] = 607637,
                    ["name"] = "Певчий Форрестен",
                },
                {
                    ["id"] = 445,
                    ["image"] = 607795,
                    ["name"] = "Тимми Беспощадный",
                },
                {
                    ["id"] = 749,
                    ["image"] = 607569,
                    ["name"] = "Командир Малор",
                },
                {
                    ["id"] = 446,
                    ["image"] = 607818,
                    ["name"] = "Вилли Разбивающий Надежды",
                },
                {
                    ["id"] = 448,
                    ["image"] = 607660,
                    ["name"] = "Инструктор Галфорд",
                },
                {
                    ["id"] = 449,
                    ["image"] = 607551,
                    ["name"] = "Бальназар",
                },
                {
                    ["id"] = 450,
                    ["image"] = 607792,
                    ["name"] = "Непрощенный",
                },
                {
                    ["id"] = 451,
                    ["image"] = 607553,
                    ["name"] = "Баронесса Анастари",
                },
                {
                    ["id"] = 452,
                    ["image"] = 607724,
                    ["name"] = "Неруб'энкан",
                },
                {
                    ["id"] = 453,
                    ["image"] = 607707,
                    ["name"] = "Малекай Бледный",
                },
                {
                    ["id"] = 454,
                    ["image"] = 607791,
                    ["name"] = "Мировой судья Бартилас",
                },
                {
                    ["id"] = 455,
                    ["image"] = 607752,
                    ["name"] = "Рамштайн Ненасытный",
                },
                {
                    ["id"] = 456,
                    ["image"] = 607692,
                    ["name"] = "Лорд Аурий Ривендер",
                },
            },
        },
        {
            ["id"] = 238,
            ["image"] = 608223,
            ["name"] = "Тюрьма",
            ["bosses"] = {
                {
                    ["id"] = 464,
                    ["image"] = 4776138,
                    ["name"] = "Дробитель",
                },
                {
                    ["id"] = 465,
                    ["image"] = 607695,
                    ["name"] = "Лорд Пережар",
                },
                {
                    ["id"] = 466,
                    ["image"] = 607753,
                    ["name"] = "Рендольф Молох",
                },
            },
        },
        {
            ["id"] = 239,
            ["image"] = 608225,
            ["name"] = "Ульдаман",
            ["bosses"] = {
                {
                    ["id"] = 467,
                    ["image"] = 607757,
                    ["name"] = "Ревелош",
                },
                {
                    ["id"] = 468,
                    ["image"] = 607550,
                    ["name"] = "Пропавшие дворфы",
                },
                {
                    ["id"] = 469,
                    ["image"] = 607664,
                    ["name"] = "Иронайа",
                },
                {
                    ["id"] = 748,
                    ["image"] = 607729,
                    ["name"] = "Обсидиановый часовой",
                },
                {
                    ["id"] = 470,
                    ["image"] = 607538,
                    ["name"] = "Древний каменный хранитель",
                },
                {
                    ["id"] = 471,
                    ["image"] = 607606,
                    ["name"] = "Галганн Огнемолот",
                },
                {
                    ["id"] = 472,
                    ["image"] = 607626,
                    ["name"] = "Гримлок",
                },
                {
                    ["id"] = 473,
                    ["image"] = 607546,
                    ["name"] = "Аркедас",
                },
            },
        },
        {
            ["id"] = 237,
            ["image"] = 608217,
            ["name"] = "Храм Атал'Хаккар",
            ["bosses"] = {
                {
                    ["id"] = 457,
                    ["image"] = 607548,
                    ["name"] = "Аватара Хаккара",
                },
                {
                    ["id"] = 458,
                    ["image"] = 607665,
                    ["name"] = "Джаммал'ан Пророк",
                },
                {
                    ["id"] = 459,
                    ["image"] = 608311,
                    ["name"] = "Хранители Сна",
                },
                {
                    ["id"] = 463,
                    ["image"] = 607768,
                    ["name"] = "Тень Эраникуса",
                },
            },
        },
    },
    ["Wrath of the Lich King"] = {
        {
            ["id"] = 753,
            ["image"] = 1396596,
            ["name"] = "Хранилище Аркавона",
            ["bosses"] = {
                {
                    ["id"] = 1597,
                    ["image"] = 1385715,
                    ["name"] = "Аркавон Страж Камня",
                },
                {
                    ["id"] = 1598,
                    ["image"] = 1385727,
                    ["name"] = "Эмалон Страж Бури",
                },
                {
                    ["id"] = 1599,
                    ["image"] = 1385748,
                    ["name"] = "Коралон Страж Огня",
                },
                {
                    ["id"] = 1600,
                    ["image"] = 1385767,
                    ["name"] = "Торавон Страж Льда",
                },
            },
        },
        {
            ["id"] = 754,
            ["image"] = 1396587,
            ["name"] = "Наксрамас",
            ["bosses"] = {
                {
                    ["id"] = 1601,
                    ["image"] = 1378964,
                    ["name"] = "Ануб'Рекан",
                },
                {
                    ["id"] = 1602,
                    ["image"] = 1378980,
                    ["name"] = "Великая вдова Фарлина",
                },
                {
                    ["id"] = 1603,
                    ["image"] = 1378994,
                    ["name"] = "Мексна",
                },
                {
                    ["id"] = 1604,
                    ["image"] = 1379004,
                    ["name"] = "Нот Чумной",
                },
                {
                    ["id"] = 1605,
                    ["image"] = 1378984,
                    ["name"] = "Хейган Нечестивый",
                },
                {
                    ["id"] = 1606,
                    ["image"] = 1378991,
                    ["name"] = "Лотхиб",
                },
                {
                    ["id"] = 1607,
                    ["image"] = 1378988,
                    ["name"] = "Инструктор Разувий",
                },
                {
                    ["id"] = 1608,
                    ["image"] = 1378979,
                    ["name"] = "Готик Жнец",
                },
                {
                    ["id"] = 1609,
                    ["image"] = 1385732,
                    ["name"] = "Четыре Всадника",
                },
                {
                    ["id"] = 1610,
                    ["image"] = 1379005,
                    ["name"] = "Лоскутик",
                },
                {
                    ["id"] = 1611,
                    ["image"] = 1378981,
                    ["name"] = "Гроббулус",
                },
                {
                    ["id"] = 1612,
                    ["image"] = 1378977,
                    ["name"] = "Глут",
                },
                {
                    ["id"] = 1613,
                    ["image"] = 1379019,
                    ["name"] = "Таддиус",
                },
                {
                    ["id"] = 1614,
                    ["image"] = 1379010,
                    ["name"] = "Сапфирон",
                },
                {
                    ["id"] = 1615,
                    ["image"] = 1378989,
                    ["name"] = "Кел'Тузад",
                },
            },
        },
        {
            ["id"] = 755,
            ["image"] = 1396588,
            ["name"] = "Обсидиановое святилище",
            ["bosses"] = {
                {
                    ["id"] = 1616,
                    ["image"] = 1385765,
                    ["name"] = "Сартарион",
                },
            },
        },
        {
            ["id"] = 756,
            ["image"] = 1396581,
            ["name"] = "Око Вечности",
            ["bosses"] = {
                {
                    ["id"] = 1617,
                    ["image"] = 1385753,
                    ["name"] = "Малигос",
                },
            },
        },
        {
            ["id"] = 759,
            ["image"] = 1396595,
            ["name"] = "Ульдуар",
            ["bosses"] = {
                {
                    ["id"] = 1637,
                    ["image"] = 1385731,
                    ["name"] = "\"Огненный Левиафан\"",
                },
                {
                    ["id"] = 1638,
                    ["image"] = 1385742,
                    ["name"] = "Повелитель горнов Игнис",
                },
                {
                    ["id"] = 1639,
                    ["image"] = 1385763,
                    ["name"] = "Острокрылая",
                },
                {
                    ["id"] = 1640,
                    ["image"] = 1385773,
                    ["name"] = "Разрушитель XT-002",
                },
                {
                    ["id"] = 1641,
                    ["image"] = 1390439,
                    ["name"] = "Железное Собрание",
                },
                {
                    ["id"] = 1642,
                    ["image"] = 1385747,
                    ["name"] = "Кологарн",
                },
                {
                    ["id"] = 1643,
                    ["image"] = 1385717,
                    ["name"] = "Ауриайя",
                },
                {
                    ["id"] = 1644,
                    ["image"] = 1385740,
                    ["name"] = "Ходир",
                },
                {
                    ["id"] = 1645,
                    ["image"] = 1385770,
                    ["name"] = "Торим",
                },
                {
                    ["id"] = 1646,
                    ["image"] = 1385733,
                    ["name"] = "Фрейя",
                },
                {
                    ["id"] = 1647,
                    ["image"] = 1385754,
                    ["name"] = "Мимирон",
                },
                {
                    ["id"] = 1648,
                    ["image"] = 1385735,
                    ["name"] = "Генерал Везакс",
                },
                {
                    ["id"] = 1649,
                    ["image"] = 1385774,
                    ["name"] = "Йогг-Сарон",
                },
                {
                    ["id"] = 1650,
                    ["image"] = 1385713,
                    ["name"] = "Алгалон Наблюдатель",
                },
            },
        },
        {
            ["id"] = 757,
            ["image"] = 1396594,
            ["name"] = "Испытание крестоносца",
            ["bosses"] = {
                {
                    ["id"] = 1618,
                    ["image"] = 1390440,
                    ["name"] = "Чудовища Нордскола",
                },
                {
                    ["id"] = 1619,
                    ["image"] = 1385752,
                    ["name"] = "Лорд Джараксус",
                },
                {
                    ["id"] = 1620,
                    ["image"] = 1390442,
                    ["name"] = "Чемпионы Альянса",
                },
                {
                    ["id"] = 1622,
                    ["image"] = 1390443,
                    ["name"] = "Валь'киры-близнецы",
                },
                {
                    ["id"] = 1623,
                    ["image"] = 607542,
                    ["name"] = "Ануб'арак",
                },
            },
        },
        {
            ["id"] = 760,
            ["image"] = 1396589,
            ["name"] = "Логово Ониксии",
            ["bosses"] = {
                {
                    ["id"] = 1651,
                    ["image"] = 1379025,
                    ["name"] = "Ониксия",
                },
            },
        },
        {
            ["id"] = 758,
            ["image"] = 1396583,
            ["name"] = "Цитадель Ледяной Короны",
            ["bosses"] = {
                {
                    ["id"] = 1624,
                    ["image"] = 1378992,
                    ["name"] = "Лорд Ребрад",
                },
                {
                    ["id"] = 1625,
                    ["image"] = 1378990,
                    ["name"] = "Леди Смертный Шепот",
                },
                {
                    ["id"] = 1627,
                    ["image"] = 1385736,
                    ["name"] = "Битва на кораблях в Ледяной Короне",
                },
                {
                    ["id"] = 1628,
                    ["image"] = 1378970,
                    ["name"] = "Саурфанг Смертоносный",
                },
                {
                    ["id"] = 1629,
                    ["image"] = 1378972,
                    ["name"] = "Тухлопуз",
                },
                {
                    ["id"] = 1630,
                    ["image"] = 1379009,
                    ["name"] = "Гниломорд",
                },
                {
                    ["id"] = 1631,
                    ["image"] = 1379007,
                    ["name"] = "Профессор Мерзоцид",
                },
                {
                    ["id"] = 1632,
                    ["image"] = 1385721,
                    ["name"] = "Совет кровавых принцев",
                },
                {
                    ["id"] = 1633,
                    ["image"] = 1378967,
                    ["name"] = "Кровавая королева Лана'тель",
                },
                {
                    ["id"] = 1634,
                    ["image"] = 1379023,
                    ["name"] = "Валитрия Сноходица",
                },
                {
                    ["id"] = 1635,
                    ["image"] = 1379014,
                    ["name"] = "Синдрагоса",
                },
                {
                    ["id"] = 1636,
                    ["image"] = 607688,
                    ["name"] = "Король-лич",
                },
            },
        },
        {
            ["id"] = 761,
            ["image"] = 1396590,
            ["name"] = "Рубиновое святилище",
            ["bosses"] = {
                {
                    ["id"] = 1652,
                    ["image"] = 1385738,
                    ["name"] = "Халион",
                },
            },
        },
        {
            ["id"] = 272,
            ["image"] = 608194,
            ["name"] = "Азжол-Неруб",
            ["bosses"] = {
                {
                    ["id"] = 585,
                    ["image"] = 607678,
                    ["name"] = "Крик'тир Хранитель Врат",
                },
                {
                    ["id"] = 586,
                    ["image"] = 607633,
                    ["name"] = "Хадронокс",
                },
                {
                    ["id"] = 587,
                    ["image"] = 607542,
                    ["name"] = "Ануб'арак",
                },
            },
        },
        {
            ["id"] = 283,
            ["image"] = 608228,
            ["name"] = "Аметистовая крепость",
            ["bosses"] = {
                {
                    ["id"] = 626,
                    ["image"] = 607597,
                    ["name"] = "Эрекем",
                },
                {
                    ["id"] = 627,
                    ["image"] = 607717,
                    ["name"] = "Морагг",
                },
                {
                    ["id"] = 628,
                    ["image"] = 607654,
                    ["name"] = "Гнойрон",
                },
                {
                    ["id"] = 629,
                    ["image"] = 607821,
                    ["name"] = "Ксевозз",
                },
                {
                    ["id"] = 630,
                    ["image"] = 607685,
                    ["name"] = "Лавантор",
                },
                {
                    ["id"] = 631,
                    ["image"] = 607825,
                    ["name"] = "Зурамат Уничтожитель",
                },
                {
                    ["id"] = 632,
                    ["image"] = 607573,
                    ["name"] = "Синигоса",
                },
            },
        },
        {
            ["id"] = 271,
            ["image"] = 608192,
            ["name"] = "Ан'кахет: Старое Королевство",
            ["bosses"] = {
                {
                    ["id"] = 580,
                    ["image"] = 607593,
                    ["name"] = "Старейшина Надокс",
                },
                {
                    ["id"] = 581,
                    ["image"] = 607744,
                    ["name"] = "Принц Талдарам",
                },
                {
                    ["id"] = 582,
                    ["image"] = 607667,
                    ["name"] = "Джедога Искательница Теней",
                },
                {
                    ["id"] = 583,
                    ["image"] = 607534,
                    ["name"] = "Аманитар",
                },
                {
                    ["id"] = 584,
                    ["image"] = 607639,
                    ["name"] = "Глашатай Волаж",
                },
            },
        },
        {
            ["id"] = 286,
            ["image"] = 608227,
            ["name"] = "Вершина Утгард",
            ["bosses"] = {
                {
                    ["id"] = 641,
                    ["image"] = 607778,
                    ["name"] = "Свала Вечноскорбящая",
                },
                {
                    ["id"] = 642,
                    ["image"] = 607620,
                    ["name"] = "Горток Бледное Копыто",
                },
                {
                    ["id"] = 643,
                    ["image"] = 607773,
                    ["name"] = "Скади Безжалостный",
                },
                {
                    ["id"] = 644,
                    ["image"] = 607674,
                    ["name"] = "Король Имирон",
                },
            },
        },
        {
            ["id"] = 274,
            ["image"] = 608203,
            ["name"] = "Гундрак",
            ["bosses"] = {
                {
                    ["id"] = 592,
                    ["image"] = 607776,
                    ["name"] = "Слад'ран",
                },
                {
                    ["id"] = 593,
                    ["image"] = 607589,
                    ["name"] = "Колосс Драккари",
                },
                {
                    ["id"] = 594,
                    ["image"] = 607716,
                    ["name"] = "Мураби",
                },
                {
                    ["id"] = 595,
                    ["image"] = 607592,
                    ["name"] = "Эк Свирепый",
                },
                {
                    ["id"] = 596,
                    ["image"] = 607605,
                    ["name"] = "Гал'дара",
                },
            },
        },
        {
            ["id"] = 276,
            ["image"] = 608205,
            ["name"] = "Залы Отражений",
            ["bosses"] = {
                {
                    ["id"] = 601,
                    ["image"] = 607601,
                    ["name"] = "Фалрик",
                },
                {
                    ["id"] = 602,
                    ["image"] = 607710,
                    ["name"] = "Марвин",
                },
                {
                    ["id"] = 603,
                    ["image"] = 607688,
                    ["name"] = "Побег от Артаса",
                },
            },
        },
        {
            ["id"] = 284,
            ["image"] = 608224,
            ["name"] = "Испытание чемпиона",
            ["bosses"] = {
                {
                    ["id"] = 834,
                    ["image"] = 607621,
                    ["name"] = "Абсолютные чемпионы",
                },
                {
                    ["id"] = 635,
                    ["image"] = 607591,
                    ["name"] = "Эдрик Чистый",
                },
                {
                    ["id"] = 636,
                    ["image"] = 607547,
                    ["name"] = "Исповедница Серебряного Авангарда Пейлтресс",
                },
                {
                    ["id"] = 637,
                    ["image"] = 607787,
                    ["name"] = "Черный рыцарь",
                },
            },
        },
        {
            ["id"] = 273,
            ["image"] = 608201,
            ["name"] = "Крепость Драк'Тарон",
            ["bosses"] = {
                {
                    ["id"] = 588,
                    ["image"] = 607798,
                    ["name"] = "Кровотролль",
                },
                {
                    ["id"] = 589,
                    ["image"] = 607727,
                    ["name"] = "Новос Призыватель",
                },
                {
                    ["id"] = 590,
                    ["image"] = 607672,
                    ["name"] = "Король Дред",
                },
                {
                    ["id"] = 591,
                    ["image"] = 607790,
                    ["name"] = "Пророк Тарон'джа",
                },
            },
        },
        {
            ["id"] = 285,
            ["image"] = 608226,
            ["name"] = "Крепость Утгард",
            ["bosses"] = {
                {
                    ["id"] = 638,
                    ["image"] = 607743,
                    ["name"] = "Принц Келесет",
                },
                {
                    ["id"] = 639,
                    ["image"] = 607774,
                    ["name"] = "Скарвальд и Далронн",
                },
                {
                    ["id"] = 640,
                    ["image"] = 607659,
                    ["name"] = "Ингвар Расхититель",
                },
            },
        },
        {
            ["id"] = 280,
            ["image"] = 608220,
            ["name"] = "Кузня Душ",
            ["bosses"] = {
                {
                    ["id"] = 615,
                    ["image"] = 607559,
                    ["name"] = "Броньям",
                },
                {
                    ["id"] = 616,
                    ["image"] = 607585,
                    ["name"] = "Пожиратель Душ",
                },
            },
        },
        {
            ["id"] = 281,
            ["image"] = 608221,
            ["name"] = "Нексус",
            ["bosses"] = {
                {
                    ["id"] = 617,
                    ["image"] = 607571,
                    ["name"] = "Командир Пивобород",
                },
                {
                    ["id"] = 618,
                    ["image"] = 607623,
                    ["name"] = "Великая ведунья Телестра",
                },
                {
                    ["id"] = 619,
                    ["image"] = 607540,
                    ["name"] = "Аномалус",
                },
                {
                    ["id"] = 620,
                    ["image"] = 607735,
                    ["name"] = "Орморок Воспитатель Дерев",
                },
                {
                    ["id"] = 621,
                    ["image"] = 607671,
                    ["name"] = "Керистраза",
                },
            },
        },
        {
            ["id"] = 282,
            ["image"] = 608222,
            ["name"] = "Окулус",
            ["bosses"] = {
                {
                    ["id"] = 622,
                    ["image"] = 607590,
                    ["name"] = "Дракос Дознаватель",
                },
                {
                    ["id"] = 623,
                    ["image"] = 607802,
                    ["name"] = "Варос Заоблачный Странник",
                },
                {
                    ["id"] = 624,
                    ["image"] = 607702,
                    ["name"] = "Маг-лорд Уром",
                },
                {
                    ["id"] = 625,
                    ["image"] = 607687,
                    ["name"] = "Хранитель энергии Эрегос",
                },
            },
        },
        {
            ["id"] = 279,
            ["image"] = 608219,
            ["name"] = "Очищение Стратхольма",
            ["bosses"] = {
                {
                    ["id"] = 611,
                    ["image"] = 607711,
                    ["name"] = "Мясной Крюк",
                },
                {
                    ["id"] = 612,
                    ["image"] = 607763,
                    ["name"] = "Салрамм Плоторез",
                },
                {
                    ["id"] = 613,
                    ["image"] = 607567,
                    ["name"] = "Хронолорд Эпох",
                },
                {
                    ["id"] = 614,
                    ["image"] = 607708,
                    ["name"] = "Мал'Ганис",
                },
            },
        },
        {
            ["id"] = 277,
            ["image"] = 608206,
            ["name"] = "Чертоги Камня",
            ["bosses"] = {
                {
                    ["id"] = 604,
                    ["image"] = 607679,
                    ["name"] = "Кристаллус",
                },
                {
                    ["id"] = 605,
                    ["image"] = 607706,
                    ["name"] = "Дева Скорби",
                },
                {
                    ["id"] = 606,
                    ["image"] = 607797,
                    ["name"] = "Трибунал Веков",
                },
                {
                    ["id"] = 607,
                    ["image"] = 607772,
                    ["name"] = "Сьоннир Литейщик",
                },
            },
        },
        {
            ["id"] = 275,
            ["image"] = 608204,
            ["name"] = "Чертоги Молний",
            ["bosses"] = {
                {
                    ["id"] = 597,
                    ["image"] = 607611,
                    ["name"] = "Генерал Бьярнгрим",
                },
                {
                    ["id"] = 598,
                    ["image"] = 607809,
                    ["name"] = "Волхан",
                },
                {
                    ["id"] = 599,
                    ["image"] = 607663,
                    ["name"] = "Ионар",
                },
                {
                    ["id"] = 600,
                    ["image"] = 607690,
                    ["name"] = "Локен",
                },
            },
        },
        {
            ["id"] = 278,
            ["image"] = 608210,
            ["name"] = "Яма Сарона",
            ["bosses"] = {
                {
                    ["id"] = 608,
                    ["image"] = 607603,
                    ["name"] = "Начальник кузни Гархлад",
                },
                {
                    ["id"] = 609,
                    ["image"] = 607677,
                    ["name"] = "Ик и Крик",
                },
                {
                    ["id"] = 610,
                    ["image"] = 607765,
                    ["name"] = "Повелитель Плети Тираний",
                },
            },
        },
    },
    ["Warlords of Draenor"] = {
        {
            ["id"] = 557,
            ["image"] = 1041995,
            ["name"] = "Дренор",
            ["bosses"] = {
                {
                    ["id"] = 1291,
                    ["image"] = 1044483,
                    ["name"] = "Дров Крушитель",
                },
                {
                    ["id"] = 1211,
                    ["image"] = 1044371,
                    ["name"] = "Тарлна Нестареющий",
                },
                {
                    ["id"] = 1262,
                    ["image"] = 1044364,
                    ["name"] = "Рухмар",
                },
                {
                    ["id"] = 1452,
                    ["image"] = 1134508,
                    ["name"] = "Верховный владыка Каззак",
                },
            },
        },
        {
            ["id"] = 477,
            ["image"] = 1041997,
            ["name"] = "Верховный Молот",
            ["bosses"] = {
                {
                    ["id"] = 1128,
                    ["image"] = 1044352,
                    ["name"] = "Каргат Острорук",
                },
                {
                    ["id"] = 971,
                    ["image"] = 1044375,
                    ["name"] = "Мясник",
                },
                {
                    ["id"] = 1195,
                    ["image"] = 1044372,
                    ["name"] = "Тектоник",
                },
                {
                    ["id"] = 1196,
                    ["image"] = 1044342,
                    ["name"] = "Бурогриб",
                },
                {
                    ["id"] = 1148,
                    ["image"] = 1044377,
                    ["name"] = "Огроны-близнецы",
                },
                {
                    ["id"] = 1153,
                    ["image"] = 1044343,
                    ["name"] = "Ко'раг",
                },
                {
                    ["id"] = 1197,
                    ["image"] = 1044349,
                    ["name"] = "Император Мар'гок",
                },
            },
        },
        {
            ["id"] = 457,
            ["image"] = 1041993,
            ["name"] = "Литейная клана Черной горы",
            ["bosses"] = {
                {
                    ["id"] = 1202,
                    ["image"] = 1044484,
                    ["name"] = "Рудожуй",
                },
                {
                    ["id"] = 1155,
                    ["image"] = 1044345,
                    ["name"] = "Ганс'гар и Франзок",
                },
                {
                    ["id"] = 1122,
                    ["image"] = 1044338,
                    ["name"] = "Дармак Повелитель Зверей",
                },
                {
                    ["id"] = 1161,
                    ["image"] = 1044346,
                    ["name"] = "Груул",
                },
                {
                    ["id"] = 1123,
                    ["image"] = 1044344,
                    ["name"] = "Ка'граз Пламенная",
                },
                {
                    ["id"] = 1147,
                    ["image"] = 1044357,
                    ["name"] = "Оператор Тогар",
                },
                {
                    ["id"] = 1154,
                    ["image"] = 1044374,
                    ["name"] = "Горнило",
                },
                {
                    ["id"] = 1162,
                    ["image"] = 1044353,
                    ["name"] = "Кромог",
                },
                {
                    ["id"] = 1203,
                    ["image"] = 1044350,
                    ["name"] = "Железные леди",
                },
                {
                    ["id"] = 959,
                    ["image"] = 1044378,
                    ["name"] = "Чернорук",
                },
            },
        },
        {
            ["id"] = 669,
            ["image"] = 1135118,
            ["name"] = "Цитадель Адского Пламени",
            ["bosses"] = {
                {
                    ["id"] = 1426,
                    ["image"] = 1134502,
                    ["name"] = "Штурм Цитадели Адского Пламени",
                },
                {
                    ["id"] = 1425,
                    ["image"] = 1134499,
                    ["name"] = "Железный разоритель",
                },
                {
                    ["id"] = 1392,
                    ["image"] = 1134504,
                    ["name"] = "Кормрок",
                },
                {
                    ["id"] = 1432,
                    ["image"] = 1134501,
                    ["name"] = "Верховный совет Адского Пламени",
                },
                {
                    ["id"] = 1396,
                    ["image"] = 1134503,
                    ["name"] = "Килрогг Мертвый Глаз",
                },
                {
                    ["id"] = 1372,
                    ["image"] = 1134500,
                    ["name"] = "Кровожад",
                },
                {
                    ["id"] = 1433,
                    ["image"] = 1134506,
                    ["name"] = "Повелитель теней Искар",
                },
                {
                    ["id"] = 1427,
                    ["image"] = 1134507,
                    ["name"] = "Сокретар Вечный",
                },
                {
                    ["id"] = 1391,
                    ["image"] = 1134498,
                    ["name"] = "Повелитель Скверны Закуун",
                },
                {
                    ["id"] = 1447,
                    ["image"] = 1134510,
                    ["name"] = "Ксул'горак",
                },
                {
                    ["id"] = 1394,
                    ["image"] = 1134509,
                    ["name"] = "Деспотичная Велари",
                },
                {
                    ["id"] = 1395,
                    ["image"] = 1134505,
                    ["name"] = "Маннорот",
                },
                {
                    ["id"] = 1438,
                    ["image"] = 1134497,
                    ["name"] = "Архимонд",
                },
            },
        },
        {
            ["id"] = 547,
            ["image"] = 1041992,
            ["name"] = "Аукиндон",
            ["bosses"] = {
                {
                    ["id"] = 1185,
                    ["image"] = 1044336,
                    ["name"] = "Дозорный Каатар",
                },
                {
                    ["id"] = 1186,
                    ["image"] = 1044370,
                    ["name"] = "Стражница душ Ниами",
                },
                {
                    ["id"] = 1216,
                    ["image"] = 1044337,
                    ["name"] = "Аззакель",
                },
                {
                    ["id"] = 1225,
                    ["image"] = 1044373,
                    ["name"] = "Терон'кров",
                },
            },
        },
        {
            ["id"] = 559,
            ["image"] = 1042000,
            ["name"] = "Верхняя часть пика Черной горы",
            ["bosses"] = {
                {
                    ["id"] = 1226,
                    ["image"] = 1044358,
                    ["name"] = "Владыка руды Гор'ашан",
                },
                {
                    ["id"] = 1227,
                    ["image"] = 1044354,
                    ["name"] = "Кирак",
                },
                {
                    ["id"] = 1228,
                    ["image"] = 1044351,
                    ["name"] = "Командир Тарбек",
                },
                {
                    ["id"] = 1229,
                    ["image"] = 1044361,
                    ["name"] = "Ярокрыл Неукротимый",
                },
                {
                    ["id"] = 1234,
                    ["image"] = 1044379,
                    ["name"] = "Полководец Зела",
                },
            },
        },
        {
            ["id"] = 556,
            ["image"] = 1060547,
            ["name"] = "Вечное Цветение",
            ["bosses"] = {
                {
                    ["id"] = 1214,
                    ["image"] = 1044381,
                    ["name"] = "Сухокожий",
                },
                {
                    ["id"] = 1207,
                    ["image"] = 1053563,
                    ["name"] = "Древние защитники",
                },
                {
                    ["id"] = 1208,
                    ["image"] = 1044335,
                    ["name"] = "Верховный маг Сол",
                },
                {
                    ["id"] = 1209,
                    ["image"] = 1044382,
                    ["name"] = "Зери'так",
                },
                {
                    ["id"] = 1210,
                    ["image"] = 1044383,
                    ["name"] = "Йалну",
                },
            },
        },
        {
            ["id"] = 536,
            ["image"] = 1041996,
            ["name"] = "Депо Мрачных Путей",
            ["bosses"] = {
                {
                    ["id"] = 1138,
                    ["image"] = 1044360,
                    ["name"] = "Искролет и Борка",
                },
                {
                    ["id"] = 1163,
                    ["image"] = 1044339,
                    ["name"] = "Нитрогг Громовая Гора",
                },
                {
                    ["id"] = 1133,
                    ["image"] = 1044376,
                    ["name"] = "Повелительница небес Товра",
                },
            },
        },
        {
            ["id"] = 558,
            ["image"] = 1060548,
            ["name"] = "Железные доки",
            ["bosses"] = {
                {
                    ["id"] = 1235,
                    ["image"] = 1044380,
                    ["name"] = "Раздиратель Плоти Нок'Гар",
                },
                {
                    ["id"] = 1236,
                    ["image"] = 1044340,
                    ["name"] = "Головорезы Мрачных Путей",
                },
                {
                    ["id"] = 1237,
                    ["image"] = 1044359,
                    ["name"] = "Ошир",
                },
                {
                    ["id"] = 1238,
                    ["image"] = 1044367,
                    ["name"] = "Черепон",
                },
            },
        },
        {
            ["id"] = 476,
            ["image"] = 1041999,
            ["name"] = "Небесный Путь",
            ["bosses"] = {
                {
                    ["id"] = 965,
                    ["image"] = 1044362,
                    ["name"] = "Ранжит",
                },
                {
                    ["id"] = 966,
                    ["image"] = 1044334,
                    ["name"] = "Аракнат",
                },
                {
                    ["id"] = 967,
                    ["image"] = 1044365,
                    ["name"] = "Рухран",
                },
                {
                    ["id"] = 968,
                    ["image"] = 1044348,
                    ["name"] = "Высший мудрец Вирикс",
                },
            },
        },
        {
            ["id"] = 537,
            ["image"] = 1041998,
            ["name"] = "Некрополь Призрачной Луны",
            ["bosses"] = {
                {
                    ["id"] = 1139,
                    ["image"] = 1044366,
                    ["name"] = "Садана Кровавое Безумие",
                },
                {
                    ["id"] = 1168,
                    ["image"] = 1053564,
                    ["name"] = "Нхаллиш",
                },
                {
                    ["id"] = 1140,
                    ["image"] = 1044341,
                    ["name"] = "Костебрюх",
                },
                {
                    ["id"] = 1160,
                    ["image"] = 1044356,
                    ["name"] = "Нер'зул",
                },
            },
        },
        {
            ["id"] = 385,
            ["image"] = 1041994,
            ["name"] = "Шлаковые шахты Кровавого Молота",
            ["bosses"] = {
                {
                    ["id"] = 893,
                    ["image"] = 1044355,
                    ["name"] = "Магмолат",
                },
                {
                    ["id"] = 888,
                    ["image"] = 1044368,
                    ["name"] = "Надсмотрщик за рабами Крушто",
                },
                {
                    ["id"] = 887,
                    ["image"] = 1044363,
                    ["name"] = "Ролталл",
                },
                {
                    ["id"] = 889,
                    ["image"] = 1044347,
                    ["name"] = "Гуг'рокк",
                },
            },
        },
    },
}
