---------------------------------------------------------------------
-- File: Cell\RaidDebuffs\ExpansionData\ExpansionData_zhCN.lua
-- Author: enderneko (enderneko-dev@outlook.com)
-- Created : 2023-09-03 19:53:55 +08:00
-- Modified: 2024-05-04 17:29:24 +08:00
---------------------------------------------------------------------

if not LOCALE_zhCN then return end

Cell_ExpansionData.locale = "zhCN"

Cell_ExpansionData.expansions = {
    "巨龙时代",
    "暗影国度",
    "争霸艾泽拉斯",
    "军团再临",
    "德拉诺之王",
    "熊猫人之谜",
    "大地的裂变",
    "巫妖王之怒",
    "燃烧的远征",
    "经典旧世",
}

Cell_ExpansionData.data = {
    ["巨龙时代"] = {
        {
            ["id"] = 1205,
            ["image"] = 4742925,
            ["name"] = "巨龙群岛",
            ["bosses"] = {
                {
                    ["id"] = 2515,
                    ["image"] = 4757700,
                    ["name"] = "斯图恩兰，苍天苦难",
                }, -- [1]
                {
                    ["id"] = 2506,
                    ["image"] = 4757691,
                    ["name"] = "巴斯律孔，页岩之翼",
                }, -- [2]
                {
                    ["id"] = 2517,
                    ["image"] = 4757692,
                    ["name"] = "巴祖阿尔，惊恐烈焰",
                }, -- [3]
                {
                    ["id"] = 2518,
                    ["image"] = 4757697,
                    ["name"] = "利斯卡诺兹，未来灾劫",
                }, -- [4]
                {
                    ["id"] = 2531,
                    ["image"] = 5151696,
                    ["name"] = "扎卡利长老",
                }, -- [5]
            },
        }, -- [1]
        {
            ["id"] = 1200,
            ["image"] = 4742931,
            ["name"] = "化身巨龙牢窟",
            ["bosses"] = {
                {
                    ["id"] = 2480,
                    ["image"] = 4757695,
                    ["name"] = "艾拉诺格",
                }, -- [1]
                {
                    ["id"] = 2500,
                    ["image"] = 4757701,
                    ["name"] = "泰洛斯",
                }, -- [2]
                {
                    ["id"] = 2486,
                    ["image"] = 4757702,
                    ["name"] = "原始议会",
                }, -- [3]
                {
                    ["id"] = 2482,
                    ["image"] = 4757699,
                    ["name"] = "瑟娜尔丝，冰冷之息",
                }, -- [4]
                {
                    ["id"] = 2502,
                    ["image"] = 4757694,
                    ["name"] = "晋升者达瑟雅",
                }, -- [5]
                {
                    ["id"] = 2491,
                    ["image"] = 4757696,
                    ["name"] = "库洛格·恐怖图腾",
                }, -- [6]
                {
                    ["id"] = 2493,
                    ["image"] = 4757693,
                    ["name"] = "巢穴守护者迪乌尔娜",
                }, -- [7]
                {
                    ["id"] = 2499,
                    ["image"] = 4757698,
                    ["name"] = "莱萨杰丝，噬雷之龙",
                }, -- [8]
            },
        }, -- [2]
        {
            ["id"] = 1208,
            ["image"] = 5149418,
            ["name"] = "亚贝鲁斯，焰影熔炉",
            ["bosses"] = {
                {
                    ["id"] = 2522,
                    ["image"] = 5151370,
                    ["name"] = "狱铸者卡扎拉",
                }, -- [1]
                {
                    ["id"] = 2529,
                    ["image"] = 5151374,
                    ["name"] = "融合体密室",
                }, -- [2]
                {
                    ["id"] = 2530,
                    ["image"] = 5151375,
                    ["name"] = "被遗忘的实验体",
                }, -- [3]
                {
                    ["id"] = 2524,
                    ["image"] = 5151368,
                    ["name"] = "扎卡利突袭",
                }, -- [4]
                {
                    ["id"] = 2525,
                    ["image"] = 5151372,
                    ["name"] = "长老莱修克",
                }, -- [5]
                {
                    ["id"] = 2532,
                    ["image"] = 5151376,
                    ["name"] = "警戒管事兹斯卡恩",
                }, -- [6]
                {
                    ["id"] = 2527,
                    ["image"] = 5151371,
                    ["name"] = "玛格莫莱克斯",
                }, -- [7]
                {
                    ["id"] = 2523,
                    ["image"] = 5151369,
                    ["name"] = "奈萨里奥的回响",
                }, -- [8]
                {
                    ["id"] = 2520,
                    ["image"] = 5151373,
                    ["name"] = "鳞长萨卡雷斯",
                }, -- [9]
            },
        }, -- [3]
        {
            ["id"] = 1209,
            ["image"] = 5221768,
            ["name"] = "永恒黎明",
            ["bosses"] = {
                {
                    ["id"] = 2521,
                    ["image"] = 5221761,
                    ["name"] = "克罗妮卡",
                }, -- [1]
                {
                    ["id"] = 2528,
                    ["image"] = 5221766,
                    ["name"] = "时间流具象",
                }, -- [2]
                {
                    ["id"] = 2535,
                    ["image"] = 5221760,
                    ["name"] = "迦拉克隆之荒",
                }, -- [3]
                {
                    ["id"] = 2537,
                    ["image"] = 5221765,
                    ["name"] = "伊律迪孔，石鳞之龙",
                }, -- [4]
                {
                    ["id"] = 2526,
                    ["image"] = 5221764,
                    ["name"] = "永恒守护者提尔",
                }, -- [5]
                {
                    ["id"] = 2536,
                    ["image"] = 5221767,
                    ["name"] = "米罗克",
                }, -- [6]
                {
                    ["id"] = 2534,
                    ["image"] = 5221759,
                    ["name"] = "迷时战场",
                }, -- [7]
                {
                    ["id"] = 2538,
                    ["image"] = 4741507,
                    ["name"] = "时空领主戴欧斯",
                }, -- [8]
            },
        }, -- [4]
        {
            ["id"] = 1201,
            ["image"] = 4742929,
            ["name"] = "艾杰斯亚学院",
            ["bosses"] = {
                {
                    ["id"] = 2509,
                    ["image"] = 4741534,
                    ["name"] = "维克萨姆斯",
                }, -- [1]
                {
                    ["id"] = 2512,
                    ["image"] = 4741524,
                    ["name"] = "茂林古树",
                }, -- [2]
                {
                    ["id"] = 2495,
                    ["image"] = 4741508,
                    ["name"] = "克罗兹",
                }, -- [3]
                {
                    ["id"] = 2514,
                    ["image"] = 4741510,
                    ["name"] = "多拉苟萨的回响",
                }, -- [4]
            },
        }, -- [5]
        {
            ["id"] = 1196,
            ["image"] = 4742923,
            ["name"] = "蕨皮山谷",
            ["bosses"] = {
                {
                    ["id"] = 2471,
                    ["image"] = 4741526,
                    ["name"] = "劈爪的战团",
                }, -- [1]
                {
                    ["id"] = 2473,
                    ["image"] = 4741532,
                    ["name"] = "树口",
                }, -- [2]
                {
                    ["id"] = 2472,
                    ["image"] = 4741518,
                    ["name"] = "肠击",
                }, -- [3]
                {
                    ["id"] = 2474,
                    ["image"] = 4741509,
                    ["name"] = "腐朽主母怒眼",
                }, -- [4]
            },
        }, -- [6]
        {
            ["id"] = 1204,
            ["image"] = 4742926,
            ["name"] = "注能大厅",
            ["bosses"] = {
                {
                    ["id"] = 2504,
                    ["image"] = 4741536,
                    ["name"] = "看护者伊里度斯",
                }, -- [1]
                {
                    ["id"] = 2507,
                    ["image"] = 4741516,
                    ["name"] = "吞喉巨蛙",
                }, -- [2]
                {
                    ["id"] = 2510,
                    ["image"] = 4741519,
                    ["name"] = "不屈者卡金",
                }, -- [3]
                {
                    ["id"] = 2511,
                    ["image"] = 4741525,
                    ["name"] = "原始海啸",
                }, -- [4]
            },
        }, -- [7]
        {
            ["id"] = 1199,
            ["image"] = 4742928,
            ["name"] = "奈萨鲁斯",
            ["bosses"] = {
                {
                    ["id"] = 2490,
                    ["image"] = 4741506,
                    ["name"] = "查尔加斯，龙鳞之灾",
                }, -- [1]
                {
                    ["id"] = 2489,
                    ["image"] = 4741513,
                    ["name"] = "熔炉主管戈雷克",
                }, -- [2]
                {
                    ["id"] = 2494,
                    ["image"] = 4741522,
                    ["name"] = "岩浆之牙",
                }, -- [3]
                {
                    ["id"] = 2501,
                    ["image"] = 4741535,
                    ["name"] = "督军莎尔佳",
                }, -- [4]
            },
        }, -- [8]
        {
            ["id"] = 1202,
            ["image"] = 4742927,
            ["name"] = "红玉新生法池",
            ["bosses"] = {
                {
                    ["id"] = 2488,
                    ["image"] = 4741523,
                    ["name"] = "梅莉杜莎·寒妆",
                }, -- [1]
                {
                    ["id"] = 2485,
                    ["image"] = 4741520,
                    ["name"] = "柯姬雅·焰蹄",
                }, -- [2]
                {
                    ["id"] = 2503,
                    ["image"] = 4867810,
                    ["name"] = "基拉卡与厄克哈特·风脉",
                }, -- [3]
            },
        }, -- [9]
        {
            ["id"] = 1203,
            ["image"] = 4742829,
            ["name"] = "碧蓝魔馆",
            ["bosses"] = {
                {
                    ["id"] = 2492,
                    ["image"] = 4741521,
                    ["name"] = "莱魔",
                }, -- [1]
                {
                    ["id"] = 2505,
                    ["image"] = 4741503,
                    ["name"] = "青刃",
                }, -- [2]
                {
                    ["id"] = 2483,
                    ["image"] = 4741529,
                    ["name"] = "泰拉什·灰翼",
                }, -- [3]
                {
                    ["id"] = 2508,
                    ["image"] = 4741533,
                    ["name"] = "安布雷斯库",
                }, -- [4]
            },
        }, -- [10]
        {
            ["id"] = 1198,
            ["image"] = 4742924,
            ["name"] = "诺库德阻击战",
            ["bosses"] = {
                {
                    ["id"] = 2498,
                    ["image"] = 4741514,
                    ["name"] = "格拉尼斯",
                }, -- [1]
                {
                    ["id"] = 2497,
                    ["image"] = 4741531,
                    ["name"] = "狂怒风暴",
                }, -- [2]
                {
                    ["id"] = 2478,
                    ["image"] = 4741528,
                    ["name"] = "提拉和马鲁克",
                }, -- [3]
                {
                    ["id"] = 2477,
                    ["image"] = 4741504,
                    ["name"] = "巴拉卡可汗",
                }, -- [4]
            },
        }, -- [11]
        {
            ["id"] = 1197,
            ["image"] = 4742930,
            ["name"] = "奥达曼：提尔的遗产",
            ["bosses"] = {
                {
                    ["id"] = 2475,
                    ["image"] = 4741530,
                    ["name"] = "失落的矮人",
                }, -- [1]
                {
                    ["id"] = 2487,
                    ["image"] = 4741505,
                    ["name"] = "布罗马奇",
                }, -- [2]
                {
                    ["id"] = 2484,
                    ["image"] = 4741527,
                    ["name"] = "哨兵塔隆达丝",
                }, -- [3]
                {
                    ["id"] = 2476,
                    ["image"] = 4741511,
                    ["name"] = "艾博隆",
                }, -- [4]
                {
                    ["id"] = 2479,
                    ["image"] = 4741507,
                    ["name"] = "时空领主戴欧斯",
                }, -- [5]
            },
        }, -- [12]
    },
    ["德拉诺之王"] = {
        {
            ["id"] = 557,
            ["image"] = 1041995,
            ["name"] = "德拉诺",
            ["bosses"] = {
                {
                    ["id"] = 1291,
                    ["image"] = 1044483,
                    ["name"] = "毁灭者多弗",
                }, -- [1]
                {
                    ["id"] = 1211,
                    ["image"] = 1044371,
                    ["name"] = "永恒的塔尔纳",
                }, -- [2]
                {
                    ["id"] = 1262,
                    ["image"] = 1044364,
                    ["name"] = "鲁克玛",
                }, -- [3]
                {
                    ["id"] = 1452,
                    ["image"] = 1134508,
                    ["name"] = "霸主卡扎克",
                }, -- [4]
            },
        }, -- [1]
        {
            ["id"] = 477,
            ["image"] = 1041997,
            ["name"] = "悬槌堡",
            ["bosses"] = {
                {
                    ["id"] = 1128,
                    ["image"] = 1044352,
                    ["name"] = "卡加斯·刃拳",
                }, -- [1]
                {
                    ["id"] = 971,
                    ["image"] = 1044375,
                    ["name"] = "屠夫",
                }, -- [2]
                {
                    ["id"] = 1195,
                    ["image"] = 1044372,
                    ["name"] = "泰克图斯",
                }, -- [3]
                {
                    ["id"] = 1196,
                    ["image"] = 1044342,
                    ["name"] = "布兰肯斯波",
                }, -- [4]
                {
                    ["id"] = 1148,
                    ["image"] = 1044377,
                    ["name"] = "独眼魔双子",
                }, -- [5]
                {
                    ["id"] = 1153,
                    ["image"] = 1044343,
                    ["name"] = "克拉戈",
                }, -- [6]
                {
                    ["id"] = 1197,
                    ["image"] = 1044349,
                    ["name"] = "元首马尔高克",
                }, -- [7]
            },
        }, -- [2]
        {
            ["id"] = 457,
            ["image"] = 1041993,
            ["name"] = "黑石铸造厂",
            ["bosses"] = {
                {
                    ["id"] = 1202,
                    ["image"] = 1044484,
                    ["name"] = "奥尔高格",
                }, -- [1]
                {
                    ["id"] = 1155,
                    ["image"] = 1044345,
                    ["name"] = "汉斯加尔与弗兰佐克",
                }, -- [2]
                {
                    ["id"] = 1122,
                    ["image"] = 1044338,
                    ["name"] = "兽王达玛克",
                }, -- [3]
                {
                    ["id"] = 1161,
                    ["image"] = 1044346,
                    ["name"] = "格鲁尔",
                }, -- [4]
                {
                    ["id"] = 1123,
                    ["image"] = 1044344,
                    ["name"] = "缚火者卡格拉兹",
                }, -- [5]
                {
                    ["id"] = 1147,
                    ["image"] = 1044357,
                    ["name"] = "主管索戈尔",
                }, -- [6]
                {
                    ["id"] = 1154,
                    ["image"] = 1044374,
                    ["name"] = "爆裂熔炉",
                }, -- [7]
                {
                    ["id"] = 1162,
                    ["image"] = 1044353,
                    ["name"] = "克罗莫格",
                }, -- [8]
                {
                    ["id"] = 1203,
                    ["image"] = 1044350,
                    ["name"] = "钢铁女武神",
                }, -- [9]
                {
                    ["id"] = 959,
                    ["image"] = 1044378,
                    ["name"] = "黑手",
                }, -- [10]
            },
        }, -- [3]
        {
            ["id"] = 669,
            ["image"] = 1135118,
            ["name"] = "地狱火堡垒",
            ["bosses"] = {
                {
                    ["id"] = 1426,
                    ["image"] = 1134502,
                    ["name"] = "奇袭地狱火",
                }, -- [1]
                {
                    ["id"] = 1425,
                    ["image"] = 1134499,
                    ["name"] = "钢铁掠夺者",
                }, -- [2]
                {
                    ["id"] = 1392,
                    ["image"] = 1134504,
                    ["name"] = "考莫克",
                }, -- [3]
                {
                    ["id"] = 1432,
                    ["image"] = 1134501,
                    ["name"] = "高阶地狱火议会",
                }, -- [4]
                {
                    ["id"] = 1396,
                    ["image"] = 1134503,
                    ["name"] = "基尔罗格·死眼",
                }, -- [5]
                {
                    ["id"] = 1372,
                    ["image"] = 1134500,
                    ["name"] = "血魔",
                }, -- [6]
                {
                    ["id"] = 1433,
                    ["image"] = 1134506,
                    ["name"] = "暗影领主艾斯卡",
                }, -- [7]
                {
                    ["id"] = 1427,
                    ["image"] = 1134507,
                    ["name"] = "永恒者索克雷萨",
                }, -- [8]
                {
                    ["id"] = 1391,
                    ["image"] = 1134498,
                    ["name"] = "邪能领主扎昆",
                }, -- [9]
                {
                    ["id"] = 1447,
                    ["image"] = 1134510,
                    ["name"] = "祖霍拉克",
                }, -- [10]
                {
                    ["id"] = 1394,
                    ["image"] = 1134509,
                    ["name"] = "暴君维哈里",
                }, -- [11]
                {
                    ["id"] = 1395,
                    ["image"] = 1134505,
                    ["name"] = "玛诺洛斯",
                }, -- [12]
                {
                    ["id"] = 1438,
                    ["image"] = 1134497,
                    ["name"] = "阿克蒙德",
                }, -- [13]
            },
        }, -- [4]
        {
            ["id"] = 547,
            ["image"] = 1041992,
            ["name"] = "奥金顿",
            ["bosses"] = {
                {
                    ["id"] = 1185,
                    ["image"] = 1044336,
                    ["name"] = "警戒者凯萨尔",
                }, -- [1]
                {
                    ["id"] = 1186,
                    ["image"] = 1044370,
                    ["name"] = "缚魂者尼娅米",
                }, -- [2]
                {
                    ["id"] = 1216,
                    ["image"] = 1044337,
                    ["name"] = "阿扎凯尔",
                }, -- [3]
                {
                    ["id"] = 1225,
                    ["image"] = 1044373,
                    ["name"] = "塔隆戈尔",
                }, -- [4]
            },
        }, -- [5]
        {
            ["id"] = 537,
            ["image"] = 1041998,
            ["name"] = "影月墓地",
            ["bosses"] = {
                {
                    ["id"] = 1139,
                    ["image"] = 1044366,
                    ["name"] = "莎达娜·血怒",
                }, -- [1]
                {
                    ["id"] = 1168,
                    ["image"] = 1053564,
                    ["name"] = "纳利什",
                }, -- [2]
                {
                    ["id"] = 1140,
                    ["image"] = 1044341,
                    ["name"] = "骨喉",
                }, -- [3]
                {
                    ["id"] = 1160,
                    ["image"] = 1044356,
                    ["name"] = "耐奥祖",
                }, -- [4]
            },
        }, -- [6]
        {
            ["id"] = 536,
            ["image"] = 1041996,
            ["name"] = "恐轨车站",
            ["bosses"] = {
                {
                    ["id"] = 1138,
                    ["image"] = 1044360,
                    ["name"] = "箭火和波尔卡",
                }, -- [1]
                {
                    ["id"] = 1163,
                    ["image"] = 1044339,
                    ["name"] = "尼托格·雷塔",
                }, -- [2]
                {
                    ["id"] = 1133,
                    ["image"] = 1044376,
                    ["name"] = "啸天者托瓦拉",
                }, -- [3]
            },
        }, -- [7]
        {
            ["id"] = 556,
            ["image"] = 1060547,
            ["name"] = "永茂林地",
            ["bosses"] = {
                {
                    ["id"] = 1214,
                    ["image"] = 1044381,
                    ["name"] = "枯木",
                }, -- [1]
                {
                    ["id"] = 1207,
                    ["image"] = 1053563,
                    ["name"] = "远古的保卫者",
                }, -- [2]
                {
                    ["id"] = 1208,
                    ["image"] = 1044335,
                    ["name"] = "大法师索尔",
                }, -- [3]
                {
                    ["id"] = 1209,
                    ["image"] = 1044382,
                    ["name"] = "艾里塔克",
                }, -- [4]
                {
                    ["id"] = 1210,
                    ["image"] = 1044383,
                    ["name"] = "雅努",
                }, -- [5]
            },
        }, -- [8]
        {
            ["id"] = 385,
            ["image"] = 1041994,
            ["name"] = "血槌炉渣矿井",
            ["bosses"] = {
                {
                    ["id"] = 893,
                    ["image"] = 1044355,
                    ["name"] = "玛格莫拉图斯",
                }, -- [1]
                {
                    ["id"] = 888,
                    ["image"] = 1044368,
                    ["name"] = "守奴人库鲁斯托",
                }, -- [2]
                {
                    ["id"] = 887,
                    ["image"] = 1044363,
                    ["name"] = "罗托尔",
                }, -- [3]
                {
                    ["id"] = 889,
                    ["image"] = 1044347,
                    ["name"] = "戈洛克",
                }, -- [4]
            },
        }, -- [9]
        {
            ["id"] = 476,
            ["image"] = 1041999,
            ["name"] = "通天峰",
            ["bosses"] = {
                {
                    ["id"] = 965,
                    ["image"] = 1044362,
                    ["name"] = "兰吉特",
                }, -- [1]
                {
                    ["id"] = 966,
                    ["image"] = 1044334,
                    ["name"] = "阿拉卡纳斯",
                }, -- [2]
                {
                    ["id"] = 967,
                    ["image"] = 1044365,
                    ["name"] = "鲁克兰",
                }, -- [3]
                {
                    ["id"] = 968,
                    ["image"] = 1044348,
                    ["name"] = "高阶贤者维里克斯",
                }, -- [4]
            },
        }, -- [10]
        {
            ["id"] = 558,
            ["image"] = 1060548,
            ["name"] = "钢铁码头",
            ["bosses"] = {
                {
                    ["id"] = 1235,
                    ["image"] = 1044380,
                    ["name"] = "血肉撕裂者诺格加尔",
                }, -- [1]
                {
                    ["id"] = 1236,
                    ["image"] = 1044340,
                    ["name"] = "恐轨押运员",
                }, -- [2]
                {
                    ["id"] = 1237,
                    ["image"] = 1044359,
                    ["name"] = "奥舍尔",
                }, -- [3]
                {
                    ["id"] = 1238,
                    ["image"] = 1044367,
                    ["name"] = "斯古洛克",
                }, -- [4]
            },
        }, -- [11]
        {
            ["id"] = 559,
            ["image"] = 1042000,
            ["name"] = "黑石塔上层",
            ["bosses"] = {
                {
                    ["id"] = 1226,
                    ["image"] = 1044358,
                    ["name"] = "折铁者高尔山",
                }, -- [1]
                {
                    ["id"] = 1227,
                    ["image"] = 1044354,
                    ["name"] = "奇拉克",
                }, -- [2]
                {
                    ["id"] = 1228,
                    ["image"] = 1044351,
                    ["name"] = "指挥官萨贝克",
                }, -- [3]
                {
                    ["id"] = 1229,
                    ["image"] = 1044361,
                    ["name"] = "狂野的怒翼",
                }, -- [4]
                {
                    ["id"] = 1234,
                    ["image"] = 1044379,
                    ["name"] = "督军扎伊拉",
                }, -- [5]
            },
        }, -- [12]
    },
    ["熊猫人之谜"] = {
        {
            ["id"] = 322,
            ["image"] = 652218,
            ["name"] = "潘达利亚",
            ["bosses"] = {
                {
                    ["id"] = 691,
                    ["image"] = 630847,
                    ["name"] = "怒之煞",
                }, -- [1]
                {
                    ["id"] = 725,
                    ["image"] = 630819,
                    ["name"] = "萨莱斯的兵团",
                }, -- [2]
                {
                    ["id"] = 814,
                    ["image"] = 796778,
                    ["name"] = "暴风领主纳拉克",
                }, -- [3]
                {
                    ["id"] = 826,
                    ["image"] = 796779,
                    ["name"] = "乌达斯塔",
                }, -- [4]
                {
                    ["id"] = 857,
                    ["image"] = 901155,
                    ["name"] = "朱鹤赤精",
                }, -- [5]
                {
                    ["id"] = 858,
                    ["image"] = 901173,
                    ["name"] = "青龙玉珑",
                }, -- [6]
                {
                    ["id"] = 859,
                    ["image"] = 901165,
                    ["name"] = "玄牛砮皂",
                }, -- [7]
                {
                    ["id"] = 860,
                    ["image"] = 901172,
                    ["name"] = "白虎雪怒",
                }, -- [8]
                {
                    ["id"] = 861,
                    ["image"] = 901167,
                    ["name"] = "野牛人火神斡耳朵斯",
                }, -- [9]
            },
        }, -- [1]
        {
            ["id"] = 317,
            ["image"] = 632273,
            ["name"] = "魔古山宝库",
            ["bosses"] = {
                {
                    ["id"] = 679,
                    ["image"] = 630820,
                    ["name"] = "石头守卫",
                }, -- [1]
                {
                    ["id"] = 689,
                    ["image"] = 630824,
                    ["name"] = "受诅者魔封",
                }, -- [2]
                {
                    ["id"] = 682,
                    ["image"] = 630826,
                    ["name"] = "缚灵者戈拉亚",
                }, -- [3]
                {
                    ["id"] = 687,
                    ["image"] = 630861,
                    ["name"] = "先王之魂",
                }, -- [4]
                {
                    ["id"] = 726,
                    ["image"] = 630823,
                    ["name"] = "伊拉贡",
                }, -- [5]
                {
                    ["id"] = 677,
                    ["image"] = 630836,
                    ["name"] = "皇帝的意志",
                }, -- [6]
            },
        }, -- [2]
        {
            ["id"] = 330,
            ["image"] = 632271,
            ["name"] = "恐惧之心",
            ["bosses"] = {
                {
                    ["id"] = 745,
                    ["image"] = 630834,
                    ["name"] = "皇家宰相佐尔洛克",
                }, -- [1]
                {
                    ["id"] = 744,
                    ["image"] = 630817,
                    ["name"] = "刀锋领主塔亚克",
                }, -- [2]
                {
                    ["id"] = 713,
                    ["image"] = 630827,
                    ["name"] = "加拉隆",
                }, -- [3]
                {
                    ["id"] = 741,
                    ["image"] = 630856,
                    ["name"] = "风领主梅尔加拉克",
                }, -- [4]
                {
                    ["id"] = 737,
                    ["image"] = 630815,
                    ["name"] = "琥珀塑形者昂舒克",
                }, -- [5]
                {
                    ["id"] = 743,
                    ["image"] = 630830,
                    ["name"] = "大女皇夏柯希尔",
                }, -- [6]
            },
        }, -- [3]
        {
            ["id"] = 320,
            ["image"] = 643264,
            ["name"] = "永春台",
            ["bosses"] = {
                {
                    ["id"] = 683,
                    ["image"] = 630844,
                    ["name"] = "无尽守护者",
                }, -- [1]
                {
                    ["id"] = 742,
                    ["image"] = 630854,
                    ["name"] = "烛龙",
                }, -- [2]
                {
                    ["id"] = 729,
                    ["image"] = 630837,
                    ["name"] = "雷施",
                }, -- [3]
                {
                    ["id"] = 709,
                    ["image"] = 630849,
                    ["name"] = "惧之煞",
                }, -- [4]
            },
        }, -- [4]
        {
            ["id"] = 362,
            ["image"] = 828453,
            ["name"] = "雷电王座",
            ["bosses"] = {
                {
                    ["id"] = 827,
                    ["image"] = 796776,
                    ["name"] = "击碎者金罗克",
                }, -- [1]
                {
                    ["id"] = 819,
                    ["image"] = 796774,
                    ["name"] = "赫利东",
                }, -- [2]
                {
                    ["id"] = 816,
                    ["image"] = 796770,
                    ["name"] = "长者议会",
                }, -- [3]
                {
                    ["id"] = 825,
                    ["image"] = 796781,
                    ["name"] = "托多斯",
                }, -- [4]
                {
                    ["id"] = 821,
                    ["image"] = 796786,
                    ["name"] = "墨格瑞拉",
                }, -- [5]
                {
                    ["id"] = 828,
                    ["image"] = 796785,
                    ["name"] = "季鹍",
                }, -- [6]
                {
                    ["id"] = 818,
                    ["image"] = 796772,
                    ["name"] = "遗忘者杜鲁姆",
                }, -- [7]
                {
                    ["id"] = 820,
                    ["image"] = 796780,
                    ["name"] = "普利莫修斯",
                }, -- [8]
                {
                    ["id"] = 824,
                    ["image"] = 796771,
                    ["name"] = "黑暗意志",
                }, -- [9]
                {
                    ["id"] = 817,
                    ["image"] = 796775,
                    ["name"] = "铁穹",
                }, -- [10]
                {
                    ["id"] = 829,
                    ["image"] = 796773,
                    ["name"] = "神女双天",
                }, -- [11]
                {
                    ["id"] = 832,
                    ["image"] = 796777,
                    ["name"] = "雷神",
                }, -- [12]
            },
        }, -- [5]
        {
            ["id"] = 369,
            ["image"] = 904981,
            ["name"] = "决战奥格瑞玛",
            ["bosses"] = {
                {
                    ["id"] = 852,
                    ["image"] = 901160,
                    ["name"] = "伊墨苏斯",
                }, -- [1]
                {
                    ["id"] = 849,
                    ["image"] = 901159,
                    ["name"] = "堕落的守护者",
                }, -- [2]
                {
                    ["id"] = 866,
                    ["image"] = 901166,
                    ["name"] = "诺鲁什",
                }, -- [3]
                {
                    ["id"] = 867,
                    ["image"] = 901168,
                    ["name"] = "傲之煞",
                }, -- [4]
                {
                    ["id"] = 868,
                    ["image"] = 901156,
                    ["name"] = "迦拉卡斯",
                }, -- [5]
                {
                    ["id"] = 864,
                    ["image"] = 901161,
                    ["name"] = "钢铁战蝎",
                }, -- [6]
                {
                    ["id"] = 856,
                    ["image"] = 901163,
                    ["name"] = "库卡隆黑暗萨满",
                }, -- [7]
                {
                    ["id"] = 850,
                    ["image"] = 901158,
                    ["name"] = "纳兹戈林将军",
                }, -- [8]
                {
                    ["id"] = 846,
                    ["image"] = 901164,
                    ["name"] = "马尔考罗克",
                }, -- [9]
                {
                    ["id"] = 870,
                    ["image"] = 901170,
                    ["name"] = "潘达利亚战利品",
                }, -- [10]
                {
                    ["id"] = 851,
                    ["image"] = 901171,
                    ["name"] = "嗜血的索克",
                }, -- [11]
                {
                    ["id"] = 865,
                    ["image"] = 901169,
                    ["name"] = "攻城匠师黑索",
                }, -- [12]
                {
                    ["id"] = 853,
                    ["image"] = 901162,
                    ["name"] = "卡拉克西英杰",
                }, -- [13]
                {
                    ["id"] = 869,
                    ["image"] = 901157,
                    ["name"] = "加尔鲁什·地狱咆哮",
                }, -- [14]
            },
        }, -- [6]
        {
            ["id"] = 324,
            ["image"] = 643263,
            ["name"] = "围攻砮皂寺",
            ["bosses"] = {
                {
                    ["id"] = 693,
                    ["image"] = 630855,
                    ["name"] = "宰相金巴卡",
                }, -- [1]
                {
                    ["id"] = 738,
                    ["image"] = 630822,
                    ["name"] = "指挥官沃加克",
                }, -- [2]
                {
                    ["id"] = 692,
                    ["image"] = 630829,
                    ["name"] = "将军帕瓦拉克",
                }, -- [3]
                {
                    ["id"] = 727,
                    ["image"] = 630857,
                    ["name"] = "翼虫首领尼诺洛克",
                }, -- [4]
            },
        }, -- [7]
        {
            ["id"] = 312,
            ["image"] = 632274,
            ["name"] = "影踪禅院",
            ["bosses"] = {
                {
                    ["id"] = 673,
                    ["image"] = 630831,
                    ["name"] = "古·穿云",
                }, -- [1]
                {
                    ["id"] = 657,
                    ["image"] = 630841,
                    ["name"] = "雪流大师",
                }, -- [2]
                {
                    ["id"] = 685,
                    ["image"] = 630850,
                    ["name"] = "狂之煞",
                }, -- [3]
                {
                    ["id"] = 686,
                    ["image"] = 630852,
                    ["name"] = "祝踏岚",
                }, -- [4]
            },
        }, -- [8]
        {
            ["id"] = 303,
            ["image"] = 632270,
            ["name"] = "残阳关",
            ["bosses"] = {
                {
                    ["id"] = 655,
                    ["image"] = 630846,
                    ["name"] = "破坏者吉普提拉克",
                }, -- [1]
                {
                    ["id"] = 675,
                    ["image"] = 630851,
                    ["name"] = "突袭者加杜卡",
                }, -- [2]
                {
                    ["id"] = 676,
                    ["image"] = 630821,
                    ["name"] = "指挥官瑞魔克",
                }, -- [3]
                {
                    ["id"] = 649,
                    ["image"] = 630845,
                    ["name"] = "莱公",
                }, -- [4]
            },
        }, -- [9]
        {
            ["id"] = 316,
            ["image"] = 608214,
            ["name"] = "血色修道院",
            ["bosses"] = {
                {
                    ["id"] = 688,
                    ["image"] = 630853,
                    ["name"] = "裂魂者萨尔诺斯",
                }, -- [1]
                {
                    ["id"] = 671,
                    ["image"] = 630818,
                    ["name"] = "科洛夫修士",
                }, -- [2]
                {
                    ["id"] = 674,
                    ["image"] = 607643,
                    ["name"] = "大检察官怀特迈恩",
                }, -- [3]
            },
        }, -- [10]
        {
            ["id"] = 311,
            ["image"] = 643262,
            ["name"] = "血色大厅",
            ["bosses"] = {
                {
                    ["id"] = 660,
                    ["image"] = 630833,
                    ["name"] = "驯犬者布兰恩",
                }, -- [1]
                {
                    ["id"] = 654,
                    ["image"] = 630816,
                    ["name"] = "武器大师哈兰",
                }, -- [2]
                {
                    ["id"] = 656,
                    ["image"] = 630825,
                    ["name"] = "织焰者孔格勒",
                }, -- [3]
            },
        }, -- [11]
        {
            ["id"] = 246,
            ["image"] = 608215,
            ["name"] = "通灵学院",
            ["bosses"] = {
                {
                    ["id"] = 659,
                    ["image"] = 630835,
                    ["name"] = "指导者寒心",
                }, -- [1]
                {
                    ["id"] = 663,
                    ["image"] = 607666,
                    ["name"] = "詹迪斯·巴罗夫",
                }, -- [2]
                {
                    ["id"] = 665,
                    ["image"] = 607755,
                    ["name"] = "血骨傀儡",
                }, -- [3]
                {
                    ["id"] = 666,
                    ["image"] = 630838,
                    ["name"] = "莉莉安·沃斯",
                }, -- [4]
                {
                    ["id"] = 684,
                    ["image"] = 607582,
                    ["name"] = "黑暗院长加丁",
                }, -- [5]
            },
        }, -- [12]
        {
            ["id"] = 313,
            ["image"] = 632276,
            ["name"] = "青龙寺",
            ["bosses"] = {
                {
                    ["id"] = 672,
                    ["image"] = 630858,
                    ["name"] = "贤者马里",
                }, -- [1]
                {
                    ["id"] = 664,
                    ["image"] = 630840,
                    ["name"] = "游学者石步",
                }, -- [2]
                {
                    ["id"] = 658,
                    ["image"] = 630839,
                    ["name"] = "刘·焰心",
                }, -- [3]
                {
                    ["id"] = 335,
                    ["image"] = 630848,
                    ["name"] = "疑之煞",
                }, -- [4]
            },
        }, -- [13]
        {
            ["id"] = 302,
            ["image"] = 632275,
            ["name"] = "风暴烈酒酿造厂",
            ["bosses"] = {
                {
                    ["id"] = 668,
                    ["image"] = 630843,
                    ["name"] = "乌克乌克",
                }, -- [1]
                {
                    ["id"] = 669,
                    ["image"] = 630832,
                    ["name"] = "跳跳大王",
                }, -- [2]
                {
                    ["id"] = 670,
                    ["image"] = 630860,
                    ["name"] = "破桶而出的炎诛",
                }, -- [3]
            },
        }, -- [14]
        {
            ["id"] = 321,
            ["image"] = 632272,
            ["name"] = "魔古山宫殿",
            ["bosses"] = {
                {
                    ["id"] = 708,
                    ["image"] = 630842,
                    ["name"] = "君王的试炼",
                }, -- [1]
                {
                    ["id"] = 690,
                    ["image"] = 630828,
                    ["name"] = "杰翰",
                }, -- [2]
                {
                    ["id"] = 698,
                    ["image"] = 630859,
                    ["name"] = "武器大师席恩",
                }, -- [3]
            },
        }, -- [15]
    },
    ["暗影国度"] = {
        {
            ["id"] = 1192,
            ["image"] = 3850569,
            ["name"] = "暗影界",
            ["bosses"] = {
                {
                    ["id"] = 2430,
                    ["image"] = 3752195,
                    ["name"] = "瓦里诺，万古之光",
                }, -- [1]
                {
                    ["id"] = 2431,
                    ["image"] = 3752183,
                    ["name"] = "莫塔尼斯",
                }, -- [2]
                {
                    ["id"] = 2432,
                    ["image"] = 3752188,
                    ["name"] = "“长青之枝”奥拉诺莫诺斯",
                }, -- [3]
                {
                    ["id"] = 2433,
                    ["image"] = 3752187,
                    ["name"] = "诺尔伽什·泥躯",
                }, -- [4]
                {
                    ["id"] = 2456,
                    ["image"] = 4071436,
                    ["name"] = "莫盖斯，罪人的折磨者",
                }, -- [5]
                {
                    ["id"] = 2468,
                    ["image"] = 4529365,
                    ["name"] = "安特洛斯",
                }, -- [6]
            },
        }, -- [1]
        {
            ["id"] = 1190,
            ["image"] = 3759906,
            ["name"] = "纳斯利亚堡",
            ["bosses"] = {
                {
                    ["id"] = 2393,
                    ["image"] = 3752190,
                    ["name"] = "啸翼",
                }, -- [1]
                {
                    ["id"] = 2429,
                    ["image"] = 3753151,
                    ["name"] = "猎手阿尔迪莫",
                }, -- [2]
                {
                    ["id"] = 2422,
                    ["image"] = 3753157,
                    ["name"] = "太阳之王的救赎",
                }, -- [3]
                {
                    ["id"] = 2418,
                    ["image"] = 3752156,
                    ["name"] = "圣物匠赛·墨克斯",
                }, -- [4]
                {
                    ["id"] = 2428,
                    ["image"] = 3752174,
                    ["name"] = "饥饿的毁灭者",
                }, -- [5]
                {
                    ["id"] = 2420,
                    ["image"] = 3752178,
                    ["name"] = "伊涅瓦·暗脉女勋爵",
                }, -- [6]
                {
                    ["id"] = 2426,
                    ["image"] = 3753159,
                    ["name"] = "猩红议会",
                }, -- [7]
                {
                    ["id"] = 2394,
                    ["image"] = 3752191,
                    ["name"] = "泥拳",
                }, -- [8]
                {
                    ["id"] = 2425,
                    ["image"] = 3753156,
                    ["name"] = "顽石军团干将",
                }, -- [9]
                {
                    ["id"] = 2424,
                    ["image"] = 3752159,
                    ["name"] = "德纳修斯大帝",
                }, -- [10]
            },
        }, -- [2]
        {
            ["id"] = 1193,
            ["image"] = 4182020,
            ["name"] = "统御圣所",
            ["bosses"] = {
                {
                    ["id"] = 2435,
                    ["image"] = 4071444,
                    ["name"] = "塔拉格鲁",
                }, -- [1]
                {
                    ["id"] = 2442,
                    ["image"] = 4071426,
                    ["name"] = "典狱长之眼",
                }, -- [2]
                {
                    ["id"] = 2439,
                    ["image"] = 4071445,
                    ["name"] = "九武神",
                }, -- [3]
                {
                    ["id"] = 2444,
                    ["image"] = 4071439,
                    ["name"] = "耐奥祖的残迹",
                }, -- [4]
                {
                    ["id"] = 2445,
                    ["image"] = 4071442,
                    ["name"] = "裂魂者多尔玛赞",
                }, -- [5]
                {
                    ["id"] = 2443,
                    ["image"] = 4079051,
                    ["name"] = "痛楚工匠莱兹纳尔",
                }, -- [6]
                {
                    ["id"] = 2446,
                    ["image"] = 4071428,
                    ["name"] = "初诞者的卫士",
                }, -- [7]
                {
                    ["id"] = 2447,
                    ["image"] = 4071427,
                    ["name"] = "命运撰写师罗-卡洛",
                }, -- [8]
                {
                    ["id"] = 2440,
                    ["image"] = 4071435,
                    ["name"] = "克尔苏加德",
                }, -- [9]
                {
                    ["id"] = 2441,
                    ["image"] = 4071443,
                    ["name"] = "希尔瓦娜斯·风行者",
                }, -- [10]
            },
        }, -- [3]
        {
            ["id"] = 1195,
            ["image"] = 4423752,
            ["name"] = "初诞者圣墓",
            ["bosses"] = {
                {
                    ["id"] = 2458,
                    ["image"] = 4465340,
                    ["name"] = "警戒卫士",
                }, -- [1]
                {
                    ["id"] = 2465,
                    ["image"] = 4465339,
                    ["name"] = "司垢莱克斯，无穷噬灭者",
                }, -- [2]
                {
                    ["id"] = 2470,
                    ["image"] = 4423749,
                    ["name"] = "圣物匠赛·墨克斯",
                }, -- [3]
                {
                    ["id"] = 2459,
                    ["image"] = 4465333,
                    ["name"] = "道茜歌妮，堕落先知",
                }, -- [4]
                {
                    ["id"] = 2460,
                    ["image"] = 4465337,
                    ["name"] = "死亡万神殿原型体",
                }, -- [5]
                {
                    ["id"] = 2461,
                    ["image"] = 4465335,
                    ["name"] = "首席造物师利许威姆",
                }, -- [6]
                {
                    ["id"] = 2463,
                    ["image"] = 4423738,
                    ["name"] = "回收者黑伦度斯",
                }, -- [7]
                {
                    ["id"] = 2469,
                    ["image"] = 4423747,
                    ["name"] = "安度因·乌瑞恩",
                }, -- [8]
                {
                    ["id"] = 2457,
                    ["image"] = 4465336,
                    ["name"] = "恐惧双王",
                }, -- [9]
                {
                    ["id"] = 2467,
                    ["image"] = 4465338,
                    ["name"] = "莱葛隆",
                }, -- [10]
                {
                    ["id"] = 2464,
                    ["image"] = 4465334,
                    ["name"] = "典狱长",
                }, -- [11]
            },
        }, -- [4]
        {
            ["id"] = 1187,
            ["image"] = 3759914,
            ["name"] = "伤逝剧场",
            ["bosses"] = {
                {
                    ["id"] = 2397,
                    ["image"] = 3752153,
                    ["name"] = "狭路相逢",
                }, -- [1]
                {
                    ["id"] = 2401,
                    ["image"] = 3752169,
                    ["name"] = "斩血",
                }, -- [2]
                {
                    ["id"] = 2390,
                    ["image"] = 3752199,
                    ["name"] = "无堕者哈夫",
                }, -- [3]
                {
                    ["id"] = 2389,
                    ["image"] = 3753154,
                    ["name"] = "库尔萨洛克",
                }, -- [4]
                {
                    ["id"] = 2417,
                    ["image"] = 3752182,
                    ["name"] = "无尽女皇莫德蕾莎",
                }, -- [5]
            },
        }, -- [5]
        {
            ["id"] = 1183,
            ["image"] = 3759911,
            ["name"] = "凋魂之殇",
            ["bosses"] = {
                {
                    ["id"] = 2419,
                    ["image"] = 3752168,
                    ["name"] = "酤团",
                }, -- [1]
                {
                    ["id"] = 2403,
                    ["image"] = 3752162,
                    ["name"] = "伊库斯博士",
                }, -- [2]
                {
                    ["id"] = 2423,
                    ["image"] = 3752163,
                    ["name"] = "多米娜·毒刃",
                }, -- [3]
                {
                    ["id"] = 2404,
                    ["image"] = 3752180,
                    ["name"] = "斯特拉达玛侯爵",
                }, -- [4]
            },
        }, -- [6]
        {
            ["id"] = 1194,
            ["image"] = 4182022,
            ["name"] = "塔扎维什，帷纱集市",
            ["bosses"] = {
                {
                    ["id"] = 2437,
                    ["image"] = 4071449,
                    ["name"] = "哨卫佐·菲克斯",
                }, -- [1]
                {
                    ["id"] = 2454,
                    ["image"] = 4071447,
                    ["name"] = "卖品会",
                }, -- [2]
                {
                    ["id"] = 2436,
                    ["image"] = 4071438,
                    ["name"] = "收发室乱战",
                }, -- [3]
                {
                    ["id"] = 2452,
                    ["image"] = 4071448,
                    ["name"] = "麦扎的绿洲",
                }, -- [4]
                {
                    ["id"] = 2451,
                    ["image"] = 4071440,
                    ["name"] = "索·阿兹密",
                }, -- [5]
                {
                    ["id"] = 2448,
                    ["image"] = 4071429,
                    ["name"] = "希尔布兰德",
                }, -- [6]
                {
                    ["id"] = 2449,
                    ["image"] = 4071446,
                    ["name"] = "时空船长钩尾",
                }, -- [7]
                {
                    ["id"] = 2455,
                    ["image"] = 4071441,
                    ["name"] = "索·莉亚",
                }, -- [8]
            },
        }, -- [7]
        {
            ["id"] = 1184,
            ["image"] = 3759909,
            ["name"] = "塞兹仙林的迷雾",
            ["bosses"] = {
                {
                    ["id"] = 2400,
                    ["image"] = 3753152,
                    ["name"] = "英格拉·马洛克",
                }, -- [1]
                {
                    ["id"] = 2402,
                    ["image"] = 3752181,
                    ["name"] = "唤雾者",
                }, -- [2]
                {
                    ["id"] = 2405,
                    ["image"] = 3752194,
                    ["name"] = "特雷德奥瓦",
                }, -- [3]
            },
        }, -- [8]
        {
            ["id"] = 1188,
            ["image"] = 3759915,
            ["name"] = "彼界",
            ["bosses"] = {
                {
                    ["id"] = 2408,
                    ["image"] = 3752170,
                    ["name"] = "夺灵者哈卡",
                }, -- [1]
                {
                    ["id"] = 2409,
                    ["image"] = 3752193,
                    ["name"] = "法力风暴夫妇",
                }, -- [2]
                {
                    ["id"] = 2398,
                    ["image"] = 3753147,
                    ["name"] = "商人赛·艾柯莎",
                }, -- [3]
                {
                    ["id"] = 2410,
                    ["image"] = 3752184,
                    ["name"] = "穆厄扎拉",
                }, -- [4]
            },
        }, -- [9]
        {
            ["id"] = 1186,
            ["image"] = 3759913,
            ["name"] = "晋升高塔",
            ["bosses"] = {
                {
                    ["id"] = 2399,
                    ["image"] = 3752177,
                    ["name"] = "金-塔拉",
                }, -- [1]
                {
                    ["id"] = 2416,
                    ["image"] = 3752198,
                    ["name"] = "雯图纳柯丝",
                }, -- [2]
                {
                    ["id"] = 2414,
                    ["image"] = 3752189,
                    ["name"] = "奥莱芙莉安",
                }, -- [3]
                {
                    ["id"] = 2412,
                    ["image"] = 3752160,
                    ["name"] = "疑虑圣杰德沃丝",
                }, -- [4]
            },
        }, -- [10]
        {
            ["id"] = 1185,
            ["image"] = 3759908,
            ["name"] = "赎罪大厅",
            ["bosses"] = {
                {
                    ["id"] = 2406,
                    ["image"] = 3752171,
                    ["name"] = "哈尔吉亚斯，罪污巨像",
                }, -- [1]
                {
                    ["id"] = 2387,
                    ["image"] = 3752165,
                    ["name"] = "艾谢朗",
                }, -- [2]
                {
                    ["id"] = 2411,
                    ["image"] = 3753150,
                    ["name"] = "高阶裁决官阿丽兹",
                }, -- [3]
                {
                    ["id"] = 2413,
                    ["image"] = 3752179,
                    ["name"] = "宫务大臣",
                }, -- [4]
            },
        }, -- [11]
        {
            ["id"] = 1189,
            ["image"] = 3759912,
            ["name"] = "赤红深渊",
            ["bosses"] = {
                {
                    ["id"] = 2388,
                    ["image"] = 3753153,
                    ["name"] = "贪食的克里克西斯",
                }, -- [1]
                {
                    ["id"] = 2415,
                    ["image"] = 3753148,
                    ["name"] = "执行者塔沃德",
                }, -- [2]
                {
                    ["id"] = 2421,
                    ["image"] = 3753149,
                    ["name"] = "大学监贝律莉娅",
                }, -- [3]
                {
                    ["id"] = 2407,
                    ["image"] = 3752167,
                    ["name"] = "卡尔将军",
                }, -- [4]
            },
        }, -- [12]
        {
            ["id"] = 1182,
            ["image"] = 3759910,
            ["name"] = "通灵战潮",
            ["bosses"] = {
                {
                    ["id"] = 2395,
                    ["image"] = 3752157,
                    ["name"] = "凋骨",
                }, -- [1]
                {
                    ["id"] = 2391,
                    ["image"] = 3753146,
                    ["name"] = "收割者阿玛厄斯",
                }, -- [2]
                {
                    ["id"] = 2392,
                    ["image"] = 3753158,
                    ["name"] = "外科医生缝肉",
                }, -- [3]
                {
                    ["id"] = 2396,
                    ["image"] = 3753155,
                    ["name"] = "缚霜者纳尔佐",
                }, -- [4]
            },
        }, -- [13]
    },
    ["巫妖王之怒"] = {
        {
            ["id"] = 753,
            ["image"] = 1396596,
            ["name"] = "阿尔卡冯的宝库",
            ["bosses"] = {
                {
                    ["id"] = 1597,
                    ["image"] = 1385715,
                    ["name"] = "岩石看守者阿尔卡冯",
                }, -- [1]
                {
                    ["id"] = 1598,
                    ["image"] = 1385727,
                    ["name"] = "风暴看守者埃玛尔隆",
                }, -- [2]
                {
                    ["id"] = 1599,
                    ["image"] = 1385748,
                    ["name"] = "火焰看守者科拉隆",
                }, -- [3]
                {
                    ["id"] = 1600,
                    ["image"] = 1385767,
                    ["name"] = "寒冰看守者图拉旺",
                }, -- [4]
            },
        }, -- [1]
        {
            ["id"] = 754,
            ["image"] = 1396587,
            ["name"] = "纳克萨玛斯",
            ["bosses"] = {
                {
                    ["id"] = 1601,
                    ["image"] = 1378964,
                    ["name"] = "阿努布雷坎",
                }, -- [1]
                {
                    ["id"] = 1602,
                    ["image"] = 1378980,
                    ["name"] = "黑女巫法琳娜",
                }, -- [2]
                {
                    ["id"] = 1603,
                    ["image"] = 1378994,
                    ["name"] = "迈克斯纳",
                }, -- [3]
                {
                    ["id"] = 1604,
                    ["image"] = 1379004,
                    ["name"] = "药剂师诺斯",
                }, -- [4]
                {
                    ["id"] = 1605,
                    ["image"] = 1378984,
                    ["name"] = "肮脏的希尔盖",
                }, -- [5]
                {
                    ["id"] = 1606,
                    ["image"] = 1378991,
                    ["name"] = "洛欧塞布",
                }, -- [6]
                {
                    ["id"] = 1607,
                    ["image"] = 1378988,
                    ["name"] = "教官拉苏维奥斯",
                }, -- [7]
                {
                    ["id"] = 1608,
                    ["image"] = 1378979,
                    ["name"] = "收割者戈提克",
                }, -- [8]
                {
                    ["id"] = 1609,
                    ["image"] = 1385732,
                    ["name"] = "天启四骑士",
                }, -- [9]
                {
                    ["id"] = 1610,
                    ["image"] = 1379005,
                    ["name"] = "帕奇维克",
                }, -- [10]
                {
                    ["id"] = 1611,
                    ["image"] = 1378981,
                    ["name"] = "格罗布鲁斯",
                }, -- [11]
                {
                    ["id"] = 1612,
                    ["image"] = 1378977,
                    ["name"] = "格拉斯",
                }, -- [12]
                {
                    ["id"] = 1613,
                    ["image"] = 1379019,
                    ["name"] = "塔迪乌斯",
                }, -- [13]
                {
                    ["id"] = 1614,
                    ["image"] = 1379010,
                    ["name"] = "萨菲隆",
                }, -- [14]
                {
                    ["id"] = 1615,
                    ["image"] = 1378989,
                    ["name"] = "克尔苏加德",
                }, -- [15]
            },
        }, -- [2]
        {
            ["id"] = 755,
            ["image"] = 1396588,
            ["name"] = "黑曜石圣殿",
            ["bosses"] = {
                {
                    ["id"] = 1616,
                    ["image"] = 1385765,
                    ["name"] = "萨塔里奥",
                }, -- [1]
            },
        }, -- [3]
        {
            ["id"] = 756,
            ["image"] = 1396581,
            ["name"] = "永恒之眼",
            ["bosses"] = {
                {
                    ["id"] = 1617,
                    ["image"] = 1385753,
                    ["name"] = "玛里苟斯",
                }, -- [1]
            },
        }, -- [4]
        {
            ["id"] = 759,
            ["image"] = 1396595,
            ["name"] = "奥杜尔",
            ["bosses"] = {
                {
                    ["id"] = 1637,
                    ["image"] = 1385731,
                    ["name"] = "烈焰巨兽",
                }, -- [1]
                {
                    ["id"] = 1638,
                    ["image"] = 1385742,
                    ["name"] = "掌炉者伊格尼斯",
                }, -- [2]
                {
                    ["id"] = 1639,
                    ["image"] = 1385763,
                    ["name"] = "锋鳞",
                }, -- [3]
                {
                    ["id"] = 1640,
                    ["image"] = 1385773,
                    ["name"] = "XT-002拆解者",
                }, -- [4]
                {
                    ["id"] = 1641,
                    ["image"] = 1390439,
                    ["name"] = "钢铁议会",
                }, -- [5]
                {
                    ["id"] = 1642,
                    ["image"] = 1385747,
                    ["name"] = "科隆加恩",
                }, -- [6]
                {
                    ["id"] = 1643,
                    ["image"] = 1385717,
                    ["name"] = "欧尔莉亚",
                }, -- [7]
                {
                    ["id"] = 1644,
                    ["image"] = 1385740,
                    ["name"] = "霍迪尔",
                }, -- [8]
                {
                    ["id"] = 1645,
                    ["image"] = 1385770,
                    ["name"] = "托里姆",
                }, -- [9]
                {
                    ["id"] = 1646,
                    ["image"] = 1385733,
                    ["name"] = "弗蕾亚",
                }, -- [10]
                {
                    ["id"] = 1647,
                    ["image"] = 1385754,
                    ["name"] = "米米尔隆",
                }, -- [11]
                {
                    ["id"] = 1648,
                    ["image"] = 1385735,
                    ["name"] = "维扎克斯将军",
                }, -- [12]
                {
                    ["id"] = 1649,
                    ["image"] = 1385774,
                    ["name"] = "尤格-萨隆",
                }, -- [13]
                {
                    ["id"] = 1650,
                    ["image"] = 1385713,
                    ["name"] = "观察者奥尔加隆",
                }, -- [14]
            },
        }, -- [5]
        {
            ["id"] = 757,
            ["image"] = 1396594,
            ["name"] = "十字军的试炼",
            ["bosses"] = {
                {
                    ["id"] = 1618,
                    ["image"] = 1390440,
                    ["name"] = "诺森德猛兽",
                }, -- [1]
                {
                    ["id"] = 1619,
                    ["image"] = 1385752,
                    ["name"] = "加拉克苏斯大王",
                }, -- [2]
                {
                    ["id"] = 1620,
                    ["image"] = 1390442,
                    ["name"] = "联盟的冠军",
                }, -- [3]
                {
                    ["id"] = 1622,
                    ["image"] = 1390443,
                    ["name"] = "瓦格里双子",
                }, -- [4]
                {
                    ["id"] = 1623,
                    ["image"] = 607542,
                    ["name"] = "阿努巴拉克",
                }, -- [5]
            },
        }, -- [6]
        {
            ["id"] = 760,
            ["image"] = 1396589,
            ["name"] = "奥妮克希亚的巢穴",
            ["bosses"] = {
                {
                    ["id"] = 1651,
                    ["image"] = 1379025,
                    ["name"] = "奥妮克希亚",
                }, -- [1]
            },
        }, -- [7]
        {
            ["id"] = 758,
            ["image"] = 1396583,
            ["name"] = "冰冠堡垒",
            ["bosses"] = {
                {
                    ["id"] = 1624,
                    ["image"] = 1378992,
                    ["name"] = "玛洛加尔领主",
                }, -- [1]
                {
                    ["id"] = 1625,
                    ["image"] = 1378990,
                    ["name"] = "亡语者女士",
                }, -- [2]
                {
                    ["id"] = 1627,
                    ["image"] = 1385736,
                    ["name"] = "冰冠冰川炮舰战",
                }, -- [3]
                {
                    ["id"] = 1628,
                    ["image"] = 1378970,
                    ["name"] = "死亡使者萨鲁法尔",
                }, -- [4]
                {
                    ["id"] = 1629,
                    ["image"] = 1378972,
                    ["name"] = "烂肠",
                }, -- [5]
                {
                    ["id"] = 1630,
                    ["image"] = 1379009,
                    ["name"] = "腐面",
                }, -- [6]
                {
                    ["id"] = 1631,
                    ["image"] = 1379007,
                    ["name"] = "普崔塞德教授",
                }, -- [7]
                {
                    ["id"] = 1632,
                    ["image"] = 1385721,
                    ["name"] = "鲜血王子议会",
                }, -- [8]
                {
                    ["id"] = 1633,
                    ["image"] = 1378967,
                    ["name"] = "鲜血女王兰娜瑟尔",
                }, -- [9]
                {
                    ["id"] = 1634,
                    ["image"] = 1379023,
                    ["name"] = "踏梦者瓦莉瑟瑞娅",
                }, -- [10]
                {
                    ["id"] = 1635,
                    ["image"] = 1379014,
                    ["name"] = "辛达苟萨",
                }, -- [11]
                {
                    ["id"] = 1636,
                    ["image"] = 607688,
                    ["name"] = "巫妖王",
                }, -- [12]
            },
        }, -- [8]
        {
            ["id"] = 761,
            ["image"] = 1396590,
            ["name"] = "红玉圣殿",
            ["bosses"] = {
                {
                    ["id"] = 1652,
                    ["image"] = 1385738,
                    ["name"] = "海里昂",
                }, -- [1]
            },
        }, -- [9]
        {
            ["id"] = 286,
            ["image"] = 608227,
            ["name"] = "乌特加德之巅",
            ["bosses"] = {
                {
                    ["id"] = 641,
                    ["image"] = 607778,
                    ["name"] = "席瓦拉·索格蕾",
                }, -- [1]
                {
                    ["id"] = 642,
                    ["image"] = 607620,
                    ["name"] = "戈托克·苍蹄",
                }, -- [2]
                {
                    ["id"] = 643,
                    ["image"] = 607773,
                    ["name"] = "残忍的斯卡迪",
                }, -- [3]
                {
                    ["id"] = 644,
                    ["image"] = 607674,
                    ["name"] = "伊米隆国王",
                }, -- [4]
            },
        }, -- [10]
        {
            ["id"] = 285,
            ["image"] = 608226,
            ["name"] = "乌特加德城堡",
            ["bosses"] = {
                {
                    ["id"] = 638,
                    ["image"] = 607743,
                    ["name"] = "凯雷塞斯王子",
                }, -- [1]
                {
                    ["id"] = 639,
                    ["image"] = 607774,
                    ["name"] = "斯卡瓦尔德和达尔隆",
                }, -- [2]
                {
                    ["id"] = 640,
                    ["image"] = 607659,
                    ["name"] = "掠夺者因格瓦尔",
                }, -- [3]
            },
        }, -- [11]
        {
            ["id"] = 284,
            ["image"] = 608224,
            ["name"] = "冠军的试炼",
            ["bosses"] = {
                {
                    ["id"] = 834,
                    ["image"] = 607621,
                    ["name"] = "总冠军",
                }, -- [1]
                {
                    ["id"] = 635,
                    ["image"] = 607591,
                    ["name"] = "纯洁者耶德瑞克",
                }, -- [2]
                {
                    ["id"] = 636,
                    ["image"] = 607547,
                    ["name"] = "银色神官帕尔崔丝",
                }, -- [3]
                {
                    ["id"] = 637,
                    ["image"] = 607787,
                    ["name"] = "黑骑士",
                }, -- [4]
            },
        }, -- [12]
        {
            ["id"] = 279,
            ["image"] = 608219,
            ["name"] = "净化斯坦索姆",
            ["bosses"] = {
                {
                    ["id"] = 611,
                    ["image"] = 607711,
                    ["name"] = "肉钩",
                }, -- [1]
                {
                    ["id"] = 612,
                    ["image"] = 607763,
                    ["name"] = "塑血者沙尔拉姆",
                }, -- [2]
                {
                    ["id"] = 613,
                    ["image"] = 607567,
                    ["name"] = "时光领主埃博克",
                }, -- [3]
                {
                    ["id"] = 614,
                    ["image"] = 607708,
                    ["name"] = "玛尔加尼斯",
                }, -- [4]
            },
        }, -- [13]
        {
            ["id"] = 274,
            ["image"] = 608203,
            ["name"] = "古达克",
            ["bosses"] = {
                {
                    ["id"] = 592,
                    ["image"] = 607776,
                    ["name"] = "斯拉德兰",
                }, -- [1]
                {
                    ["id"] = 593,
                    ["image"] = 607589,
                    ["name"] = "达卡莱巨像",
                }, -- [2]
                {
                    ["id"] = 594,
                    ["image"] = 607716,
                    ["name"] = "莫拉比",
                }, -- [3]
                {
                    ["id"] = 596,
                    ["image"] = 607605,
                    ["name"] = "迦尔达拉",
                }, -- [4]
            },
        }, -- [14]
        {
            ["id"] = 271,
            ["image"] = 608192,
            ["name"] = "安卡赫特：古代王国",
            ["bosses"] = {
                {
                    ["id"] = 580,
                    ["image"] = 607593,
                    ["name"] = "纳多克斯长老",
                }, -- [1]
                {
                    ["id"] = 581,
                    ["image"] = 607744,
                    ["name"] = "塔达拉姆王子",
                }, -- [2]
                {
                    ["id"] = 582,
                    ["image"] = 607667,
                    ["name"] = "耶戈达·觅影者",
                }, -- [3]
                {
                    ["id"] = 584,
                    ["image"] = 607639,
                    ["name"] = "传令官沃拉兹",
                }, -- [4]
            },
        }, -- [15]
        {
            ["id"] = 277,
            ["image"] = 608206,
            ["name"] = "岩石大厅",
            ["bosses"] = {
                {
                    ["id"] = 604,
                    ["image"] = 607679,
                    ["name"] = "克莱斯塔卢斯",
                }, -- [1]
                {
                    ["id"] = 605,
                    ["image"] = 607706,
                    ["name"] = "悲伤圣女",
                }, -- [2]
                {
                    ["id"] = 606,
                    ["image"] = 607797,
                    ["name"] = "远古法庭",
                }, -- [3]
                {
                    ["id"] = 607,
                    ["image"] = 607772,
                    ["name"] = "塑铁者斯约尼尔",
                }, -- [4]
            },
        }, -- [16]
        {
            ["id"] = 276,
            ["image"] = 608205,
            ["name"] = "映像大厅",
            ["bosses"] = {
                {
                    ["id"] = 601,
                    ["image"] = 607601,
                    ["name"] = "法瑞克",
                }, -- [1]
                {
                    ["id"] = 602,
                    ["image"] = 607710,
                    ["name"] = "玛维恩",
                }, -- [2]
                {
                    ["id"] = 603,
                    ["image"] = 607688,
                    ["name"] = "逃离阿尔萨斯",
                }, -- [3]
            },
        }, -- [17]
        {
            ["id"] = 280,
            ["image"] = 608220,
            ["name"] = "灵魂洪炉",
            ["bosses"] = {
                {
                    ["id"] = 615,
                    ["image"] = 607559,
                    ["name"] = "布隆亚姆",
                }, -- [1]
                {
                    ["id"] = 616,
                    ["image"] = 607585,
                    ["name"] = "噬魂者",
                }, -- [2]
            },
        }, -- [18]
        {
            ["id"] = 283,
            ["image"] = 608228,
            ["name"] = "紫罗兰监狱",
            ["bosses"] = {
                {
                    ["id"] = 626,
                    ["image"] = 607597,
                    ["name"] = "埃雷克姆",
                }, -- [1]
                {
                    ["id"] = 627,
                    ["image"] = 607717,
                    ["name"] = "摩拉格",
                }, -- [2]
                {
                    ["id"] = 628,
                    ["image"] = 607654,
                    ["name"] = "艾库隆",
                }, -- [3]
                {
                    ["id"] = 629,
                    ["image"] = 607821,
                    ["name"] = "谢沃兹",
                }, -- [4]
                {
                    ["id"] = 630,
                    ["image"] = 607685,
                    ["name"] = "拉文索尔",
                }, -- [5]
                {
                    ["id"] = 631,
                    ["image"] = 607825,
                    ["name"] = "湮灭者祖拉玛特",
                }, -- [6]
                {
                    ["id"] = 632,
                    ["image"] = 607573,
                    ["name"] = "塞安妮苟萨",
                }, -- [7]
            },
        }, -- [19]
        {
            ["id"] = 272,
            ["image"] = 608194,
            ["name"] = "艾卓-尼鲁布",
            ["bosses"] = {
                {
                    ["id"] = 585,
                    ["image"] = 607678,
                    ["name"] = "看门者克里克希尔",
                }, -- [1]
                {
                    ["id"] = 586,
                    ["image"] = 607633,
                    ["name"] = "哈多诺克斯",
                }, -- [2]
                {
                    ["id"] = 587,
                    ["image"] = 607542,
                    ["name"] = "阿努巴拉克",
                }, -- [3]
            },
        }, -- [20]
        {
            ["id"] = 278,
            ["image"] = 608210,
            ["name"] = "萨隆矿坑",
            ["bosses"] = {
                {
                    ["id"] = 608,
                    ["image"] = 607603,
                    ["name"] = "熔炉之主加弗斯特",
                }, -- [1]
                {
                    ["id"] = 609,
                    ["image"] = 607677,
                    ["name"] = "伊克和科瑞克",
                }, -- [2]
                {
                    ["id"] = 610,
                    ["image"] = 607765,
                    ["name"] = "天灾领主泰兰努斯",
                }, -- [3]
            },
        }, -- [21]
        {
            ["id"] = 273,
            ["image"] = 608201,
            ["name"] = "达克萨隆要塞",
            ["bosses"] = {
                {
                    ["id"] = 588,
                    ["image"] = 607798,
                    ["name"] = "托尔戈",
                }, -- [1]
                {
                    ["id"] = 589,
                    ["image"] = 607727,
                    ["name"] = "召唤者诺沃斯",
                }, -- [2]
                {
                    ["id"] = 590,
                    ["image"] = 607672,
                    ["name"] = "暴龙之王爵德",
                }, -- [3]
                {
                    ["id"] = 591,
                    ["image"] = 607790,
                    ["name"] = "先知萨隆亚",
                }, -- [4]
            },
        }, -- [22]
        {
            ["id"] = 275,
            ["image"] = 608204,
            ["name"] = "闪电大厅",
            ["bosses"] = {
                {
                    ["id"] = 597,
                    ["image"] = 607611,
                    ["name"] = "比亚格里将军",
                }, -- [1]
                {
                    ["id"] = 598,
                    ["image"] = 607809,
                    ["name"] = "沃尔坎",
                }, -- [2]
                {
                    ["id"] = 599,
                    ["image"] = 607663,
                    ["name"] = "艾欧纳尔",
                }, -- [3]
                {
                    ["id"] = 600,
                    ["image"] = 607690,
                    ["name"] = "洛肯",
                }, -- [4]
            },
        }, -- [23]
        {
            ["id"] = 281,
            ["image"] = 608221,
            ["name"] = "魔枢",
            ["bosses"] = {
                {
                    ["id"] = 618,
                    ["image"] = 607623,
                    ["name"] = "大魔导师泰蕾丝塔",
                }, -- [1]
                {
                    ["id"] = 619,
                    ["image"] = 607540,
                    ["name"] = "阿诺玛鲁斯",
                }, -- [2]
                {
                    ["id"] = 620,
                    ["image"] = 607735,
                    ["name"] = "塑树者奥莫洛克",
                }, -- [3]
                {
                    ["id"] = 621,
                    ["image"] = 607671,
                    ["name"] = "克莉斯塔萨",
                }, -- [4]
            },
        }, -- [24]
        {
            ["id"] = 282,
            ["image"] = 608222,
            ["name"] = "魔环",
            ["bosses"] = {
                {
                    ["id"] = 622,
                    ["image"] = 607590,
                    ["name"] = "审讯者达库斯",
                }, -- [1]
                {
                    ["id"] = 623,
                    ["image"] = 607802,
                    ["name"] = "瓦尔洛斯·云击",
                }, -- [2]
                {
                    ["id"] = 624,
                    ["image"] = 607702,
                    ["name"] = "法师领主伊洛姆",
                }, -- [3]
                {
                    ["id"] = 625,
                    ["image"] = 607687,
                    ["name"] = "魔网守护者埃雷苟斯",
                }, -- [4]
            },
        }, -- [25]
    },
    ["大地的裂变"] = {
        {
            ["id"] = 75,
            ["image"] = 522349,
            ["name"] = "巴拉丁监狱",
            ["bosses"] = {
                {
                    ["id"] = 139,
                    ["image"] = 522198,
                    ["name"] = "阿尔加洛斯",
                }, -- [1]
                {
                    ["id"] = 140,
                    ["image"] = 523207,
                    ["name"] = "欧库塔尔",
                }, -- [2]
                {
                    ["id"] = 339,
                    ["image"] = 571742,
                    ["name"] = "憎恨女王阿丽萨巴尔",
                }, -- [3]
            },
        }, -- [1]
        {
            ["id"] = 72,
            ["image"] = 522355,
            ["name"] = "暮光堡垒",
            ["bosses"] = {
                {
                    ["id"] = 156,
                    ["image"] = 522232,
                    ["name"] = "哈尔弗斯·碎龙者",
                }, -- [1]
                {
                    ["id"] = 157,
                    ["image"] = 522274,
                    ["name"] = "瑟纳利昂和瓦里昂娜",
                }, -- [2]
                {
                    ["id"] = 158,
                    ["image"] = 522224,
                    ["name"] = "升腾者议会",
                }, -- [3]
                {
                    ["id"] = 167,
                    ["image"] = 522212,
                    ["name"] = "古加尔",
                }, -- [4]
                {
                    ["id"] = 168,
                    ["image"] = 522270,
                    ["name"] = "希奈丝特拉",
                }, -- [5]
            },
        }, -- [2]
        {
            ["id"] = 74,
            ["image"] = 522359,
            ["name"] = "风神王座",
            ["bosses"] = {
                {
                    ["id"] = 154,
                    ["image"] = 522196,
                    ["name"] = "风之议会",
                }, -- [1]
                {
                    ["id"] = 155,
                    ["image"] = 522191,
                    ["name"] = "奥拉基尔",
                }, -- [2]
            },
        }, -- [3]
        {
            ["id"] = 73,
            ["image"] = 522351,
            ["name"] = "黑翼血环",
            ["bosses"] = {
                {
                    ["id"] = 169,
                    ["image"] = 522250,
                    ["name"] = "全能金刚防御系统",
                }, -- [1]
                {
                    ["id"] = 170,
                    ["image"] = 522251,
                    ["name"] = "熔喉",
                }, -- [2]
                {
                    ["id"] = 171,
                    ["image"] = 522202,
                    ["name"] = "艾卓曼德斯",
                }, -- [3]
                {
                    ["id"] = 172,
                    ["image"] = 522211,
                    ["name"] = "奇美隆",
                }, -- [4]
                {
                    ["id"] = 173,
                    ["image"] = 522252,
                    ["name"] = "马洛拉克",
                }, -- [5]
                {
                    ["id"] = 174,
                    ["image"] = 522255,
                    ["name"] = "奈法利安的末日",
                }, -- [6]
            },
        }, -- [4]
        {
            ["id"] = 78,
            ["image"] = 522353,
            ["name"] = "火焰之地",
            ["bosses"] = {
                {
                    ["id"] = 192,
                    ["image"] = 522208,
                    ["name"] = "贝丝缇拉克",
                }, -- [1]
                {
                    ["id"] = 193,
                    ["image"] = 522248,
                    ["name"] = "雷奥利斯领主",
                }, -- [2]
                {
                    ["id"] = 194,
                    ["image"] = 522193,
                    ["name"] = "奥利瑟拉佐尔",
                }, -- [3]
                {
                    ["id"] = 195,
                    ["image"] = 522268,
                    ["name"] = "沙恩诺克斯",
                }, -- [4]
                {
                    ["id"] = 196,
                    ["image"] = 522204,
                    ["name"] = "护门人贝尔洛克",
                }, -- [5]
                {
                    ["id"] = 197,
                    ["image"] = 522223,
                    ["name"] = "管理者鹿盔",
                }, -- [6]
                {
                    ["id"] = 198,
                    ["image"] = 522261,
                    ["name"] = "拉格纳罗斯",
                }, -- [7]
            },
        }, -- [5]
        {
            ["id"] = 187,
            ["image"] = 571753,
            ["name"] = "巨龙之魂",
            ["bosses"] = {
                {
                    ["id"] = 311,
                    ["image"] = 536058,
                    ["name"] = "莫卓克",
                }, -- [1]
                {
                    ["id"] = 324,
                    ["image"] = 536061,
                    ["name"] = "督军佐诺兹",
                }, -- [2]
                {
                    ["id"] = 325,
                    ["image"] = 536062,
                    ["name"] = "不眠的约萨希",
                }, -- [3]
                {
                    ["id"] = 317,
                    ["image"] = 536057,
                    ["name"] = "缚风者哈格拉",
                }, -- [4]
                {
                    ["id"] = 331,
                    ["image"] = 571750,
                    ["name"] = "奥卓克希昂",
                }, -- [5]
                {
                    ["id"] = 332,
                    ["image"] = 571752,
                    ["name"] = "战争大师黑角",
                }, -- [6]
                {
                    ["id"] = 318,
                    ["image"] = 536056,
                    ["name"] = "死亡之翼的背脊",
                }, -- [7]
                {
                    ["id"] = 333,
                    ["image"] = 536055,
                    ["name"] = "疯狂的死亡之翼",
                }, -- [8]
            },
        }, -- [6]
        {
            ["id"] = 67,
            ["image"] = 522360,
            ["name"] = "巨石之核",
            ["bosses"] = {
                {
                    ["id"] = 110,
                    ["image"] = 522215,
                    ["name"] = "克伯鲁斯",
                }, -- [1]
                {
                    ["id"] = 111,
                    ["image"] = 522271,
                    ["name"] = "岩皮",
                }, -- [2]
                {
                    ["id"] = 112,
                    ["image"] = 522258,
                    ["name"] = "欧泽鲁克",
                }, -- [3]
                {
                    ["id"] = 113,
                    ["image"] = 522237,
                    ["name"] = "高阶女祭司艾苏尔",
                }, -- [4]
            },
        }, -- [7]
        {
            ["id"] = 64,
            ["image"] = 522358,
            ["name"] = "影牙城堡",
            ["bosses"] = {
                {
                    ["id"] = 96,
                    ["image"] = 522205,
                    ["name"] = "灰葬男爵",
                }, -- [1]
                {
                    ["id"] = 97,
                    ["image"] = 522206,
                    ["name"] = "席瓦莱恩男爵",
                }, -- [2]
                {
                    ["id"] = 98,
                    ["image"] = 522213,
                    ["name"] = "指挥官斯普林瓦尔",
                }, -- [3]
                {
                    ["id"] = 99,
                    ["image"] = 522249,
                    ["name"] = "沃登勋爵",
                }, -- [4]
                {
                    ["id"] = 100,
                    ["image"] = 522247,
                    ["name"] = "高弗雷勋爵",
                }, -- [5]
            },
        }, -- [8]
        {
            ["id"] = 69,
            ["image"] = 522357,
            ["name"] = "托维尔失落之城",
            ["bosses"] = {
                {
                    ["id"] = 117,
                    ["image"] = 523205,
                    ["name"] = "胡辛姆将军",
                }, -- [1]
                {
                    ["id"] = 118,
                    ["image"] = 522246,
                    ["name"] = "锁喉",
                }, -- [2]
                {
                    ["id"] = 119,
                    ["image"] = 522239,
                    ["name"] = "高阶预言者巴林姆",
                }, -- [3]
                {
                    ["id"] = 122,
                    ["image"] = 522269,
                    ["name"] = "希亚玛特",
                }, -- [4]
            },
        }, -- [9]
        {
            ["id"] = 68,
            ["image"] = 522361,
            ["name"] = "旋云之巅",
            ["bosses"] = {
                {
                    ["id"] = 114,
                    ["image"] = 522229,
                    ["name"] = "大宰相埃尔坦",
                }, -- [1]
                {
                    ["id"] = 115,
                    ["image"] = 522192,
                    ["name"] = "阿尔泰鲁斯",
                }, -- [2]
                {
                    ["id"] = 116,
                    ["image"] = 522200,
                    ["name"] = "西风君王阿萨德",
                }, -- [3]
            },
        }, -- [10]
        {
            ["id"] = 184,
            ["image"] = 571754,
            ["name"] = "时光之末",
            ["bosses"] = {
                {
                    ["id"] = 340,
                    ["image"] = 571744,
                    ["name"] = "贝恩的残影",
                }, -- [1]
                {
                    ["id"] = 285,
                    ["image"] = 571745,
                    ["name"] = "吉安娜的残影",
                }, -- [2]
                {
                    ["id"] = 323,
                    ["image"] = 571748,
                    ["name"] = "希尔瓦娜斯的残影",
                }, -- [3]
                {
                    ["id"] = 283,
                    ["image"] = 571749,
                    ["name"] = "泰兰德的残影",
                }, -- [4]
                {
                    ["id"] = 289,
                    ["image"] = 536059,
                    ["name"] = "姆诺兹多",
                }, -- [5]
            },
        }, -- [11]
        {
            ["id"] = 186,
            ["image"] = 571755,
            ["name"] = "暮光审判",
            ["bosses"] = {
                {
                    ["id"] = 322,
                    ["image"] = 571743,
                    ["name"] = "阿奎里恩",
                }, -- [1]
                {
                    ["id"] = 342,
                    ["image"] = 536054,
                    ["name"] = "埃希拉·黎明克星",
                }, -- [2]
                {
                    ["id"] = 341,
                    ["image"] = 536053,
                    ["name"] = "大主教本尼迪塔斯",
                }, -- [3]
            },
        }, -- [12]
        {
            ["id"] = 71,
            ["image"] = 522354,
            ["name"] = "格瑞姆巴托",
            ["bosses"] = {
                {
                    ["id"] = 131,
                    ["image"] = 522227,
                    ["name"] = "乌比斯将军",
                }, -- [1]
                {
                    ["id"] = 132,
                    ["image"] = 522226,
                    ["name"] = "铸炉之主索朗格斯",
                }, -- [2]
                {
                    ["id"] = 133,
                    ["image"] = 522218,
                    ["name"] = "达加·燃影者",
                }, -- [3]
                {
                    ["id"] = 134,
                    ["image"] = 522222,
                    ["name"] = "地狱公爵埃鲁达克",
                }, -- [4]
            },
        }, -- [13]
        {
            ["id"] = 63,
            ["image"] = 522352,
            ["name"] = "死亡矿井",
            ["bosses"] = {
                {
                    ["id"] = 89,
                    ["image"] = 522228,
                    ["name"] = "格拉布托克",
                }, -- [1]
                {
                    ["id"] = 90,
                    ["image"] = 522234,
                    ["name"] = "赫利克斯·破甲",
                }, -- [2]
                {
                    ["id"] = 91,
                    ["image"] = 522225,
                    ["name"] = "死神5000",
                }, -- [3]
                {
                    ["id"] = 92,
                    ["image"] = 522189,
                    ["name"] = "撕心狼将军",
                }, -- [4]
                {
                    ["id"] = 93,
                    ["image"] = 522210,
                    ["name"] = "“船长”曲奇",
                }, -- [5]
            },
        }, -- [14]
        {
            ["id"] = 185,
            ["image"] = 571756,
            ["name"] = "永恒之井",
            ["bosses"] = {
                {
                    ["id"] = 290,
                    ["image"] = 536060,
                    ["name"] = "佩罗萨恩",
                }, -- [1]
                {
                    ["id"] = 291,
                    ["image"] = 571747,
                    ["name"] = "艾萨拉女王",
                }, -- [2]
                {
                    ["id"] = 292,
                    ["image"] = 571746,
                    ["name"] = "玛诺洛斯与瓦罗森",
                }, -- [3]
            },
        }, -- [15]
        {
            ["id"] = 65,
            ["image"] = 522362,
            ["name"] = "潮汐王座",
            ["bosses"] = {
                {
                    ["id"] = 101,
                    ["image"] = 522245,
                    ["name"] = "纳兹夏尔女士",
                }, -- [1]
                {
                    ["id"] = 102,
                    ["image"] = 522214,
                    ["name"] = "指挥官乌尔索克，腐烂王子",
                }, -- [2]
                {
                    ["id"] = 103,
                    ["image"] = 522253,
                    ["name"] = "蛊心魔古厄夏",
                }, -- [3]
                {
                    ["id"] = 104,
                    ["image"] = 522259,
                    ["name"] = "厄祖玛特",
                }, -- [4]
            },
        }, -- [16]
        {
            ["id"] = 76,
            ["image"] = 522364,
            ["name"] = "祖尔格拉布",
            ["bosses"] = {
                {
                    ["id"] = 175,
                    ["image"] = 522236,
                    ["name"] = "高阶祭司温诺希斯",
                }, -- [1]
                {
                    ["id"] = 176,
                    ["image"] = 522209,
                    ["name"] = "血领主曼多基尔",
                }, -- [2]
                {
                    ["id"] = 177,
                    ["image"] = 522230,
                    ["name"] = "疯狂之缘——格里雷克",
                }, -- [3]
                {
                    ["id"] = 178,
                    ["image"] = 522233,
                    ["name"] = "疯狂之缘——哈扎拉尔",
                }, -- [4]
                {
                    ["id"] = 179,
                    ["image"] = 522263,
                    ["name"] = "疯狂之缘——雷纳塔基",
                }, -- [5]
                {
                    ["id"] = 180,
                    ["image"] = 522279,
                    ["name"] = "疯狂之缘——乌苏雷",
                }, -- [6]
                {
                    ["id"] = 181,
                    ["image"] = 522238,
                    ["name"] = "高阶祭司基尔娜拉",
                }, -- [7]
                {
                    ["id"] = 184,
                    ["image"] = 522280,
                    ["name"] = "赞吉尔",
                }, -- [8]
                {
                    ["id"] = 185,
                    ["image"] = 522243,
                    ["name"] = "碎神者金度",
                }, -- [9]
            },
        }, -- [17]
        {
            ["id"] = 77,
            ["image"] = 522363,
            ["name"] = "祖阿曼",
            ["bosses"] = {
                {
                    ["id"] = 186,
                    ["image"] = 522190,
                    ["name"] = "埃基尔松",
                }, -- [1]
                {
                    ["id"] = 187,
                    ["image"] = 522254,
                    ["name"] = "纳洛拉克",
                }, -- [2]
                {
                    ["id"] = 188,
                    ["image"] = 522242,
                    ["name"] = "加亚莱",
                }, -- [3]
                {
                    ["id"] = 189,
                    ["image"] = 522231,
                    ["name"] = "哈尔拉兹",
                }, -- [4]
                {
                    ["id"] = 190,
                    ["image"] = 522235,
                    ["name"] = "妖术领主玛拉卡斯",
                }, -- [5]
                {
                    ["id"] = 191,
                    ["image"] = 522217,
                    ["name"] = "达卡拉",
                }, -- [6]
            },
        }, -- [18]
        {
            ["id"] = 70,
            ["image"] = 522356,
            ["name"] = "起源大厅",
            ["bosses"] = {
                {
                    ["id"] = 124,
                    ["image"] = 522272,
                    ["name"] = "神殿守护者安努尔",
                }, -- [1]
                {
                    ["id"] = 125,
                    ["image"] = 522219,
                    ["name"] = "地怒者塔赫",
                }, -- [2]
                {
                    ["id"] = 126,
                    ["image"] = 522195,
                    ["name"] = "安拉斐特",
                }, -- [3]
                {
                    ["id"] = 127,
                    ["image"] = 522241,
                    ["name"] = "伊希斯特，魔法的造物",
                }, -- [4]
                {
                    ["id"] = 128,
                    ["image"] = 522194,
                    ["name"] = "阿穆纳伊，生命的造物",
                }, -- [5]
                {
                    ["id"] = 129,
                    ["image"] = 522267,
                    ["name"] = "塞特斯，毁灭的造物",
                }, -- [6]
                {
                    ["id"] = 130,
                    ["image"] = 522262,
                    ["name"] = "拉夏，太阳的造物",
                }, -- [7]
            },
        }, -- [19]
        {
            ["id"] = 66,
            ["image"] = 522350,
            ["name"] = "黑石岩窟",
            ["bosses"] = {
                {
                    ["id"] = 105,
                    ["image"] = 522266,
                    ["name"] = "摧骨者罗姆欧格",
                }, -- [1]
                {
                    ["id"] = 106,
                    ["image"] = 522216,
                    ["name"] = "柯尔拉，暮光之兆",
                }, -- [2]
                {
                    ["id"] = 107,
                    ["image"] = 522244,
                    ["name"] = "卡尔什·断钢",
                }, -- [3]
                {
                    ["id"] = 108,
                    ["image"] = 522207,
                    ["name"] = "如花",
                }, -- [4]
                {
                    ["id"] = 109,
                    ["image"] = 522201,
                    ["name"] = "升腾者领主奥西迪斯",
                }, -- [5]
            },
        }, -- [20]
    },
    ["燃烧的远征"] = {
        {
            ["id"] = 745,
            ["image"] = 1396584,
            ["name"] = "卡拉赞",
            ["bosses"] = {
                {
                    ["id"] = 1552,
                    ["image"] = 1385766,
                    ["name"] = "仆役宿舍",
                }, -- [1]
                {
                    ["id"] = 1553,
                    ["image"] = 1378965,
                    ["name"] = "猎手阿图门",
                }, -- [2]
                {
                    ["id"] = 1554,
                    ["image"] = 1378999,
                    ["name"] = "莫罗斯",
                }, -- [3]
                {
                    ["id"] = 1555,
                    ["image"] = 1378997,
                    ["name"] = "贞节圣女",
                }, -- [4]
                {
                    ["id"] = 1556,
                    ["image"] = 1385758,
                    ["name"] = "歌剧院",
                }, -- [5]
                {
                    ["id"] = 1557,
                    ["image"] = 1379020,
                    ["name"] = "馆长",
                }, -- [6]
                {
                    ["id"] = 1559,
                    ["image"] = 1379012,
                    ["name"] = "埃兰之影",
                }, -- [7]
                {
                    ["id"] = 1560,
                    ["image"] = 1379017,
                    ["name"] = "特雷斯坦·邪蹄",
                }, -- [8]
                {
                    ["id"] = 1561,
                    ["image"] = 1379002,
                    ["name"] = "虚空幽龙",
                }, -- [9]
                {
                    ["id"] = 1764,
                    ["image"] = 1385724,
                    ["name"] = "国际象棋",
                }, -- [10]
                {
                    ["id"] = 1563,
                    ["image"] = 1379006,
                    ["name"] = "玛克扎尔王子",
                }, -- [11]
            },
        }, -- [1]
        {
            ["id"] = 746,
            ["image"] = 1396582,
            ["name"] = "格鲁尔的巢穴",
            ["bosses"] = {
                {
                    ["id"] = 1564,
                    ["image"] = 1378985,
                    ["name"] = "莫加尔大王",
                }, -- [1]
                {
                    ["id"] = 1565,
                    ["image"] = 1378982,
                    ["name"] = "屠龙者格鲁尔",
                }, -- [2]
            },
        }, -- [2]
        {
            ["id"] = 747,
            ["image"] = 1396585,
            ["name"] = "玛瑟里顿的巢穴",
            ["bosses"] = {
                {
                    ["id"] = 1566,
                    ["image"] = 1378996,
                    ["name"] = "玛瑟里顿",
                }, -- [1]
            },
        }, -- [3]
        {
            ["id"] = 748,
            ["image"] = 608199,
            ["name"] = "毒蛇神殿",
            ["bosses"] = {
                {
                    ["id"] = 1567,
                    ["image"] = 1385741,
                    ["name"] = "不稳定的海度斯",
                }, -- [1]
                {
                    ["id"] = 1568,
                    ["image"] = 1385768,
                    ["name"] = "鱼斯拉",
                }, -- [2]
                {
                    ["id"] = 1569,
                    ["image"] = 1385751,
                    ["name"] = "盲眼者莱欧瑟拉斯",
                }, -- [3]
                {
                    ["id"] = 1570,
                    ["image"] = 1385729,
                    ["name"] = "深水领主卡拉瑟雷斯",
                }, -- [4]
                {
                    ["id"] = 1571,
                    ["image"] = 1385756,
                    ["name"] = "莫洛格里·踏潮者",
                }, -- [5]
                {
                    ["id"] = 1572,
                    ["image"] = 1385750,
                    ["name"] = "瓦丝琪",
                }, -- [6]
            },
        }, -- [4]
        {
            ["id"] = 749,
            ["image"] = 608218,
            ["name"] = "风暴要塞",
            ["bosses"] = {
                {
                    ["id"] = 1573,
                    ["image"] = 1385712,
                    ["name"] = "奥",
                }, -- [1]
                {
                    ["id"] = 1574,
                    ["image"] = 1385772,
                    ["name"] = "空灵机甲",
                }, -- [2]
                {
                    ["id"] = 1575,
                    ["image"] = 1385739,
                    ["name"] = "大星术师索兰莉安",
                }, -- [3]
                {
                    ["id"] = 1576,
                    ["image"] = 607669,
                    ["name"] = "凯尔萨斯·逐日者",
                }, -- [4]
            },
        }, -- [5]
        {
            ["id"] = 750,
            ["image"] = 608198,
            ["name"] = "海加尔山之战",
            ["bosses"] = {
                {
                    ["id"] = 1577,
                    ["image"] = 1385762,
                    ["name"] = "雷基·冬寒",
                }, -- [1]
                {
                    ["id"] = 1578,
                    ["image"] = 1385714,
                    ["name"] = "安纳塞隆",
                }, -- [2]
                {
                    ["id"] = 1579,
                    ["image"] = 1385745,
                    ["name"] = "卡兹洛加",
                }, -- [3]
                {
                    ["id"] = 1580,
                    ["image"] = 1385719,
                    ["name"] = "阿兹加洛",
                }, -- [4]
                {
                    ["id"] = 1581,
                    ["image"] = 1385716,
                    ["name"] = "阿克蒙德",
                }, -- [5]
            },
        }, -- [6]
        {
            ["id"] = 751,
            ["image"] = 1396579,
            ["name"] = "黑暗神殿",
            ["bosses"] = {
                {
                    ["id"] = 1582,
                    ["image"] = 1378986,
                    ["name"] = "高阶督军纳因图斯",
                }, -- [1]
                {
                    ["id"] = 1583,
                    ["image"] = 1379016,
                    ["name"] = "苏普雷姆斯",
                }, -- [2]
                {
                    ["id"] = 1584,
                    ["image"] = 1379011,
                    ["name"] = "阿卡玛之影",
                }, -- [3]
                {
                    ["id"] = 1585,
                    ["image"] = 1379018,
                    ["name"] = "塔隆·血魔",
                }, -- [4]
                {
                    ["id"] = 1586,
                    ["image"] = 1378983,
                    ["name"] = "古尔图格·血沸",
                }, -- [5]
                {
                    ["id"] = 1587,
                    ["image"] = 1385764,
                    ["name"] = "灵魂之匣",
                }, -- [6]
                {
                    ["id"] = 1588,
                    ["image"] = 1379000,
                    ["name"] = "莎赫拉丝主母",
                }, -- [7]
                {
                    ["id"] = 1589,
                    ["image"] = 1385743,
                    ["name"] = "伊利达雷议会",
                }, -- [8]
                {
                    ["id"] = 1590,
                    ["image"] = 1378987,
                    ["name"] = "伊利丹·怒风",
                }, -- [9]
            },
        }, -- [7]
        {
            ["id"] = 752,
            ["image"] = 1396592,
            ["name"] = "太阳之井高地",
            ["bosses"] = {
                {
                    ["id"] = 1591,
                    ["image"] = 1385744,
                    ["name"] = "卡雷苟斯",
                }, -- [1]
                {
                    ["id"] = 1592,
                    ["image"] = 1385722,
                    ["name"] = "布鲁塔卢斯",
                }, -- [2]
                {
                    ["id"] = 1593,
                    ["image"] = 1385730,
                    ["name"] = "菲米丝",
                }, -- [3]
                {
                    ["id"] = 1594,
                    ["image"] = 1390438,
                    ["name"] = "艾瑞达双子",
                }, -- [4]
                {
                    ["id"] = 1595,
                    ["image"] = 1385757,
                    ["name"] = "穆鲁",
                }, -- [5]
                {
                    ["id"] = 1596,
                    ["image"] = 1385746,
                    ["name"] = "基尔加丹",
                }, -- [6]
            },
        }, -- [8]
        {
            ["id"] = 248,
            ["image"] = 608207,
            ["name"] = "地狱火城墙",
            ["bosses"] = {
                {
                    ["id"] = 527,
                    ["image"] = 607817,
                    ["name"] = "巡视者加戈玛",
                }, -- [1]
                {
                    ["id"] = 528,
                    ["image"] = 607734,
                    ["name"] = "无疤者奥摩尔",
                }, -- [2]
                {
                    ["id"] = 529,
                    ["image"] = 607803,
                    ["name"] = "传令官瓦兹德",
                }, -- [3]
            },
        }, -- [9]
        {
            ["id"] = 252,
            ["image"] = 608193,
            ["name"] = "塞泰克大厅",
            ["bosses"] = {
                {
                    ["id"] = 541,
                    ["image"] = 607583,
                    ["name"] = "黑暗编织者塞斯",
                }, -- [1]
                {
                    ["id"] = 543,
                    ["image"] = 607780,
                    ["name"] = "利爪之王艾吉斯",
                }, -- [2]
            },
        }, -- [10]
        {
            ["id"] = 247,
            ["image"] = 608193,
            ["name"] = "奥金尼地穴",
            ["bosses"] = {
                {
                    ["id"] = 523,
                    ["image"] = 607771,
                    ["name"] = "死亡观察者希尔拉克",
                }, -- [1]
                {
                    ["id"] = 524,
                    ["image"] = 607600,
                    ["name"] = "大主教玛拉达尔",
                }, -- [2]
            },
        }, -- [11]
        {
            ["id"] = 260,
            ["image"] = 608199,
            ["name"] = "奴隶围栏",
            ["bosses"] = {
                {
                    ["id"] = 570,
                    ["image"] = 607715,
                    ["name"] = "背叛者门努",
                }, -- [1]
                {
                    ["id"] = 571,
                    ["image"] = 607759,
                    ["name"] = "巨钳鲁克玛尔",
                }, -- [2]
                {
                    ["id"] = 572,
                    ["image"] = 607750,
                    ["name"] = "夸格米拉",
                }, -- [3]
            },
        }, -- [12]
        {
            ["id"] = 262,
            ["image"] = 608199,
            ["name"] = "幽暗沼泽",
            ["bosses"] = {
                {
                    ["id"] = 576,
                    ["image"] = 607649,
                    ["name"] = "霍加尔芬",
                }, -- [1]
                {
                    ["id"] = 577,
                    ["image"] = 607614,
                    ["name"] = "加兹安",
                }, -- [2]
                {
                    ["id"] = 578,
                    ["image"] = 607779,
                    ["name"] = "沼地领主穆塞雷克",
                }, -- [3]
                {
                    ["id"] = 579,
                    ["image"] = 607788,
                    ["name"] = "黑色阔步者",
                }, -- [4]
            },
        }, -- [13]
        {
            ["id"] = 251,
            ["image"] = 608198,
            ["name"] = "旧希尔斯布莱德丘陵",
            ["bosses"] = {
                {
                    ["id"] = 538,
                    ["image"] = 607689,
                    ["name"] = "德拉克中尉",
                }, -- [1]
                {
                    ["id"] = 539,
                    ["image"] = 607561,
                    ["name"] = "斯卡洛克上尉",
                }, -- [2]
                {
                    ["id"] = 540,
                    ["image"] = 607596,
                    ["name"] = "时空猎手",
                }, -- [3]
            },
        }, -- [14]
        {
            ["id"] = 253,
            ["image"] = 608193,
            ["name"] = "暗影迷宫",
            ["bosses"] = {
                {
                    ["id"] = 544,
                    ["image"] = 607536,
                    ["name"] = "赫尔默大使",
                }, -- [1]
                {
                    ["id"] = 545,
                    ["image"] = 607555,
                    ["name"] = "煽动者布莱卡特",
                }, -- [2]
                {
                    ["id"] = 546,
                    ["image"] = 607625,
                    ["name"] = "沃匹尔大师",
                }, -- [3]
                {
                    ["id"] = 547,
                    ["image"] = 607720,
                    ["name"] = "摩摩尔",
                }, -- [4]
            },
        }, -- [15]
        {
            ["id"] = 250,
            ["image"] = 608193,
            ["name"] = "法力陵墓",
            ["bosses"] = {
                {
                    ["id"] = 534,
                    ["image"] = 607738,
                    ["name"] = "潘德莫努斯",
                }, -- [1]
                {
                    ["id"] = 535,
                    ["image"] = 607782,
                    ["name"] = "塔瓦洛克",
                }, -- [2]
                {
                    ["id"] = 537,
                    ["image"] = 607726,
                    ["name"] = "节点亲王沙法尔",
                }, -- [3]
            },
        }, -- [16]
        {
            ["id"] = 257,
            ["image"] = 608218,
            ["name"] = "生态船",
            ["bosses"] = {
                {
                    ["id"] = 558,
                    ["image"] = 607570,
                    ["name"] = "指挥官萨拉妮丝",
                }, -- [1]
                {
                    ["id"] = 559,
                    ["image"] = 607641,
                    ["name"] = "高级植物学家弗雷温",
                }, -- [2]
                {
                    ["id"] = 560,
                    ["image"] = 607794,
                    ["name"] = "看管者索恩格林",
                }, -- [3]
                {
                    ["id"] = 561,
                    ["image"] = 607683,
                    ["name"] = "拉伊",
                }, -- [4]
                {
                    ["id"] = 562,
                    ["image"] = 607816,
                    ["name"] = "迁跃扭木",
                }, -- [5]
            },
        }, -- [17]
        {
            ["id"] = 259,
            ["image"] = 608207,
            ["name"] = "破碎大厅",
            ["bosses"] = {
                {
                    ["id"] = 566,
                    ["image"] = 607624,
                    ["name"] = "高阶术士奈瑟库斯",
                }, -- [1]
                {
                    ["id"] = 568,
                    ["image"] = 607811,
                    ["name"] = "战争使者沃姆罗格",
                }, -- [2]
                {
                    ["id"] = 569,
                    ["image"] = 607812,
                    ["name"] = "酋长卡加斯·刃拳",
                }, -- [3]
            },
        }, -- [18]
        {
            ["id"] = 254,
            ["image"] = 608218,
            ["name"] = "禁魔监狱",
            ["bosses"] = {
                {
                    ["id"] = 548,
                    ["image"] = 607823,
                    ["name"] = "自由的瑟雷凯斯",
                }, -- [1]
                {
                    ["id"] = 549,
                    ["image"] = 607574,
                    ["name"] = "末日预言者达尔莉安",
                }, -- [2]
                {
                    ["id"] = 550,
                    ["image"] = 607820,
                    ["name"] = "天怒预言者苏克拉底",
                }, -- [3]
                {
                    ["id"] = 551,
                    ["image"] = 607635,
                    ["name"] = "预言者斯克瑞斯",
                }, -- [4]
            },
        }, -- [19]
        {
            ["id"] = 258,
            ["image"] = 608218,
            ["name"] = "能源舰",
            ["bosses"] = {
                {
                    ["id"] = 563,
                    ["image"] = 607712,
                    ["name"] = "机械领主卡帕西图斯",
                }, -- [1]
                {
                    ["id"] = 564,
                    ["image"] = 607725,
                    ["name"] = "灵术师塞比瑟蕾",
                }, -- [2]
                {
                    ["id"] = 565,
                    ["image"] = 607739,
                    ["name"] = "计算者帕萨雷恩",
                }, -- [3]
            },
        }, -- [20]
        {
            ["id"] = 261,
            ["image"] = 608199,
            ["name"] = "蒸汽地窟",
            ["bosses"] = {
                {
                    ["id"] = 573,
                    ["image"] = 607651,
                    ["name"] = "水术师瑟丝比娅",
                }, -- [1]
                {
                    ["id"] = 574,
                    ["image"] = 607713,
                    ["name"] = "机械师斯蒂里格",
                }, -- [2]
                {
                    ["id"] = 575,
                    ["image"] = 607815,
                    ["name"] = "督军卡利瑟里斯",
                }, -- [3]
            },
        }, -- [21]
        {
            ["id"] = 249,
            ["image"] = 608208,
            ["name"] = "魔导师平台",
            ["bosses"] = {
                {
                    ["id"] = 530,
                    ["image"] = 607767,
                    ["name"] = "塞林·火心",
                }, -- [1]
                {
                    ["id"] = 531,
                    ["image"] = 607806,
                    ["name"] = "维萨鲁斯",
                }, -- [2]
                {
                    ["id"] = 532,
                    ["image"] = 607742,
                    ["name"] = "女祭司德莉希亚",
                }, -- [3]
                {
                    ["id"] = 533,
                    ["image"] = 607669,
                    ["name"] = "凯尔萨斯·逐日者",
                }, -- [4]
            },
        }, -- [22]
        {
            ["id"] = 256,
            ["image"] = 608207,
            ["name"] = "鲜血熔炉",
            ["bosses"] = {
                {
                    ["id"] = 555,
                    ["image"] = 607789,
                    ["name"] = "制造者",
                }, -- [1]
                {
                    ["id"] = 556,
                    ["image"] = 607558,
                    ["name"] = "布洛戈克",
                }, -- [2]
                {
                    ["id"] = 557,
                    ["image"] = 607670,
                    ["name"] = "击碎者克里丹",
                }, -- [3]
            },
        }, -- [23]
        {
            ["id"] = 255,
            ["image"] = 608198,
            ["name"] = "黑色沼泽",
            ["bosses"] = {
                {
                    ["id"] = 552,
                    ["image"] = 607566,
                    ["name"] = "时空领主德亚",
                }, -- [1]
                {
                    ["id"] = 553,
                    ["image"] = 607784,
                    ["name"] = "坦普卢斯",
                }, -- [2]
                {
                    ["id"] = 554,
                    ["image"] = 607529,
                    ["name"] = "埃欧努斯",
                }, -- [3]
            },
        }, -- [24]
    },
    ["经典旧世"] = {
        {
            ["id"] = 741,
            ["image"] = 1396586,
            ["name"] = "熔火之心",
            ["bosses"] = {
                {
                    ["id"] = 1519,
                    ["image"] = 1378993,
                    ["name"] = "鲁西弗隆",
                }, -- [1]
                {
                    ["id"] = 1520,
                    ["image"] = 1378995,
                    ["name"] = "玛格曼达",
                }, -- [2]
                {
                    ["id"] = 1521,
                    ["image"] = 1378976,
                    ["name"] = "基赫纳斯",
                }, -- [3]
                {
                    ["id"] = 1522,
                    ["image"] = 1378975,
                    ["name"] = "加尔",
                }, -- [4]
                {
                    ["id"] = 1523,
                    ["image"] = 1379013,
                    ["name"] = "沙斯拉尔",
                }, -- [5]
                {
                    ["id"] = 1524,
                    ["image"] = 1378966,
                    ["name"] = "迦顿男爵",
                }, -- [6]
                {
                    ["id"] = 1525,
                    ["image"] = 1379015,
                    ["name"] = "萨弗隆先驱者",
                }, -- [7]
                {
                    ["id"] = 1526,
                    ["image"] = 1378978,
                    ["name"] = "焚化者古雷曼格",
                }, -- [8]
                {
                    ["id"] = 1527,
                    ["image"] = 1378998,
                    ["name"] = "管理者埃克索图斯",
                }, -- [9]
                {
                    ["id"] = 1528,
                    ["image"] = 522261,
                    ["name"] = "拉格纳罗斯",
                }, -- [10]
            },
        }, -- [1]
        {
            ["id"] = 742,
            ["image"] = 1396580,
            ["name"] = "黑翼之巢",
            ["bosses"] = {
                {
                    ["id"] = 1529,
                    ["image"] = 1379008,
                    ["name"] = "狂野的拉佐格尔",
                }, -- [1]
                {
                    ["id"] = 1530,
                    ["image"] = 1379022,
                    ["name"] = "堕落的瓦拉斯塔兹",
                }, -- [2]
                {
                    ["id"] = 1531,
                    ["image"] = 1378968,
                    ["name"] = "勒什雷尔",
                }, -- [3]
                {
                    ["id"] = 1532,
                    ["image"] = 1378973,
                    ["name"] = "费尔默",
                }, -- [4]
                {
                    ["id"] = 1533,
                    ["image"] = 1378971,
                    ["name"] = "埃博诺克",
                }, -- [5]
                {
                    ["id"] = 1534,
                    ["image"] = 1378974,
                    ["name"] = "弗莱格尔",
                }, -- [6]
                {
                    ["id"] = 1535,
                    ["image"] = 1378969,
                    ["name"] = "克洛玛古斯",
                }, -- [7]
                {
                    ["id"] = 1536,
                    ["image"] = 1379001,
                    ["name"] = "奈法利安",
                }, -- [8]
            },
        }, -- [2]
        {
            ["id"] = 743,
            ["image"] = 1396591,
            ["name"] = "安其拉废墟",
            ["bosses"] = {
                {
                    ["id"] = 1537,
                    ["image"] = 1385749,
                    ["name"] = "库林纳克斯",
                }, -- [1]
                {
                    ["id"] = 1538,
                    ["image"] = 1385734,
                    ["name"] = "拉贾克斯将军",
                }, -- [2]
                {
                    ["id"] = 1539,
                    ["image"] = 1385755,
                    ["name"] = "莫阿姆",
                }, -- [3]
                {
                    ["id"] = 1540,
                    ["image"] = 1385723,
                    ["name"] = "吞咽者布鲁",
                }, -- [4]
                {
                    ["id"] = 1541,
                    ["image"] = 1385718,
                    ["name"] = "狩猎者阿亚米斯",
                }, -- [5]
                {
                    ["id"] = 1542,
                    ["image"] = 1385759,
                    ["name"] = "无疤者奥斯里安",
                }, -- [6]
            },
        }, -- [3]
        {
            ["id"] = 744,
            ["image"] = 1396593,
            ["name"] = "安其拉神殿",
            ["bosses"] = {
                {
                    ["id"] = 1543,
                    ["image"] = 1385769,
                    ["name"] = "预言者斯克拉姆",
                }, -- [1]
                {
                    ["id"] = 1547,
                    ["image"] = 1390436,
                    ["name"] = "安其拉三宝",
                }, -- [2]
                {
                    ["id"] = 1544,
                    ["image"] = 1385720,
                    ["name"] = "沙尔图拉",
                }, -- [3]
                {
                    ["id"] = 1545,
                    ["image"] = 1385728,
                    ["name"] = "顽强的范克瑞斯",
                }, -- [4]
                {
                    ["id"] = 1548,
                    ["image"] = 1385771,
                    ["name"] = "维希度斯",
                }, -- [5]
                {
                    ["id"] = 1546,
                    ["image"] = 1385761,
                    ["name"] = "哈霍兰公主",
                }, -- [6]
                {
                    ["id"] = 1549,
                    ["image"] = 1390437,
                    ["name"] = "双子皇帝",
                }, -- [7]
                {
                    ["id"] = 1550,
                    ["image"] = 1385760,
                    ["name"] = "奥罗",
                }, -- [8]
                {
                    ["id"] = 1551,
                    ["image"] = 1385726,
                    ["name"] = "克苏恩",
                }, -- [9]
            },
        }, -- [4]
        {
            ["id"] = 234,
            ["image"] = 608213,
            ["name"] = "剃刀沼泽",
            ["bosses"] = {
                {
                    ["id"] = 896,
                    ["image"] = 607531,
                    ["name"] = "猎手布塔斯克",
                }, -- [1]
                {
                    ["id"] = 895,
                    ["image"] = 607760,
                    ["name"] = "鲁古格",
                }, -- [2]
                {
                    ["id"] = 899,
                    ["image"] = 607736,
                    ["name"] = "督军拉姆塔斯",
                }, -- [3]
                {
                    ["id"] = 900,
                    ["image"] = 1064175,
                    ["name"] = "盲眼猎手格罗亚特",
                }, -- [4]
                {
                    ["id"] = 901,
                    ["image"] = 607563,
                    ["name"] = "卡尔加·刺肋",
                }, -- [5]
            },
        }, -- [5]
        {
            ["id"] = 233,
            ["image"] = 608212,
            ["name"] = "剃刀高地",
            ["bosses"] = {
                {
                    ["id"] = 1142,
                    ["image"] = 607633,
                    ["name"] = "阿鲁克斯",
                }, -- [1]
                {
                    ["id"] = 433,
                    ["image"] = 607718,
                    ["name"] = "火眼莫德雷斯",
                }, -- [2]
                {
                    ["id"] = 1143,
                    ["image"] = 1064178,
                    ["name"] = "麦什伦",
                }, -- [3]
                {
                    ["id"] = 1146,
                    ["image"] = 607584,
                    ["name"] = "亡语者布莱克松",
                }, -- [4]
                {
                    ["id"] = 1141,
                    ["image"] = 607537,
                    ["name"] = "寒冰之王亚门纳尔",
                }, -- [5]
            },
        }, -- [6]
        {
            ["id"] = 230,
            ["image"] = 608200,
            ["name"] = "厄运之槌",
            ["bosses"] = {
                {
                    ["id"] = 402,
                    ["image"] = 607824,
                    ["name"] = "瑟雷姆·刺蹄",
                }, -- [1]
                {
                    ["id"] = 403,
                    ["image"] = 607653,
                    ["name"] = "海多斯博恩",
                }, -- [2]
                {
                    ["id"] = 404,
                    ["image"] = 607686,
                    ["name"] = "蕾瑟塔蒂丝",
                }, -- [3]
                {
                    ["id"] = 405,
                    ["image"] = 607533,
                    ["name"] = "荒野变形者奥兹恩",
                }, -- [4]
                {
                    ["id"] = 406,
                    ["image"] = 607785,
                    ["name"] = "特迪斯·扭木",
                }, -- [5]
                {
                    ["id"] = 407,
                    ["image"] = 607656,
                    ["name"] = "伊琳娜·暗木",
                }, -- [6]
                {
                    ["id"] = 408,
                    ["image"] = 607703,
                    ["name"] = "卡雷迪斯镇长",
                }, -- [7]
                {
                    ["id"] = 409,
                    ["image"] = 607657,
                    ["name"] = "伊莫塔尔",
                }, -- [8]
                {
                    ["id"] = 410,
                    ["image"] = 607745,
                    ["name"] = "托塞德林王子",
                }, -- [9]
                {
                    ["id"] = 411,
                    ["image"] = 607630,
                    ["name"] = "卫兵摩尔达",
                }, -- [10]
                {
                    ["id"] = 412,
                    ["image"] = 607777,
                    ["name"] = "践踏者克雷格",
                }, -- [11]
                {
                    ["id"] = 413,
                    ["image"] = 607629,
                    ["name"] = "卫兵芬古斯",
                }, -- [12]
                {
                    ["id"] = 414,
                    ["image"] = 607631,
                    ["name"] = "卫兵斯里基克",
                }, -- [13]
                {
                    ["id"] = 415,
                    ["image"] = 607560,
                    ["name"] = "克罗卡斯",
                }, -- [14]
                {
                    ["id"] = 416,
                    ["image"] = 607565,
                    ["name"] = "观察者克鲁什",
                }, -- [15]
                {
                    ["id"] = 417,
                    ["image"] = 607673,
                    ["name"] = "戈多克大王",
                }, -- [16]
            },
        }, -- [7]
        {
            ["id"] = 240,
            ["image"] = 608229,
            ["name"] = "哀嚎洞穴",
            ["bosses"] = {
                {
                    ["id"] = 474,
                    ["image"] = 607680,
                    ["name"] = "安娜科德拉",
                }, -- [1]
                {
                    ["id"] = 476,
                    ["image"] = 607696,
                    ["name"] = "皮萨斯",
                }, -- [2]
                {
                    ["id"] = 475,
                    ["image"] = 607693,
                    ["name"] = "考布莱恩",
                }, -- [3]
                {
                    ["id"] = 477,
                    ["image"] = 607676,
                    ["name"] = "克雷什",
                }, -- [4]
                {
                    ["id"] = 478,
                    ["image"] = 607775,
                    ["name"] = "斯卡姆",
                }, -- [5]
                {
                    ["id"] = 479,
                    ["image"] = 607698,
                    ["name"] = "瑟芬迪斯",
                }, -- [6]
                {
                    ["id"] = 480,
                    ["image"] = 607805,
                    ["name"] = "永生者沃尔丹",
                }, -- [7]
                {
                    ["id"] = 481,
                    ["image"] = 607721,
                    ["name"] = "吞噬者穆坦努斯",
                }, -- [8]
            },
        }, -- [8]
        {
            ["id"] = 239,
            ["image"] = 608225,
            ["name"] = "奥达曼",
            ["bosses"] = {
                {
                    ["id"] = 467,
                    ["image"] = 607757,
                    ["name"] = "鲁维罗什",
                }, -- [1]
                {
                    ["id"] = 468,
                    ["image"] = 607550,
                    ["name"] = "失落的矮人",
                }, -- [2]
                {
                    ["id"] = 469,
                    ["image"] = 607664,
                    ["name"] = "艾隆纳亚",
                }, -- [3]
                {
                    ["id"] = 748,
                    ["image"] = 607729,
                    ["name"] = "黑曜石哨兵",
                }, -- [4]
                {
                    ["id"] = 470,
                    ["image"] = 607538,
                    ["name"] = "远古巨石卫士",
                }, -- [5]
                {
                    ["id"] = 471,
                    ["image"] = 607606,
                    ["name"] = "加加恩·火锤",
                }, -- [6]
                {
                    ["id"] = 472,
                    ["image"] = 607626,
                    ["name"] = "格瑞姆洛克",
                }, -- [7]
                {
                    ["id"] = 473,
                    ["image"] = 607546,
                    ["name"] = "阿扎达斯",
                }, -- [8]
            },
        }, -- [9]
        {
            ["id"] = 64,
            ["image"] = 522358,
            ["name"] = "影牙城堡",
            ["bosses"] = {
                {
                    ["id"] = 96,
                    ["image"] = 522205,
                    ["name"] = "灰葬男爵",
                }, -- [1]
                {
                    ["id"] = 97,
                    ["image"] = 522206,
                    ["name"] = "席瓦莱恩男爵",
                }, -- [2]
                {
                    ["id"] = 98,
                    ["image"] = 522213,
                    ["name"] = "指挥官斯普林瓦尔",
                }, -- [3]
                {
                    ["id"] = 99,
                    ["image"] = 522249,
                    ["name"] = "沃登勋爵",
                }, -- [4]
                {
                    ["id"] = 100,
                    ["image"] = 522247,
                    ["name"] = "高弗雷勋爵",
                }, -- [5]
            },
        }, -- [10]
        {
            ["id"] = 226,
            ["image"] = 608211,
            ["name"] = "怒焰裂谷",
            ["bosses"] = {
                {
                    ["id"] = 694,
                    ["image"] = 608309,
                    ["name"] = "阿达罗格",
                }, -- [1]
                {
                    ["id"] = 695,
                    ["image"] = 608310,
                    ["name"] = "黑暗萨满柯兰萨",
                }, -- [2]
                {
                    ["id"] = 696,
                    ["image"] = 522251,
                    ["name"] = "焰喉",
                }, -- [3]
                {
                    ["id"] = 697,
                    ["image"] = 608315,
                    ["name"] = "熔岩守卫戈多斯",
                }, -- [4]
            },
        }, -- [11]
        {
            ["id"] = 236,
            ["image"] = 608216,
            ["name"] = "斯坦索姆",
            ["bosses"] = {
                {
                    ["id"] = 443,
                    ["image"] = 607637,
                    ["name"] = "弗雷斯特恩",
                }, -- [1]
                {
                    ["id"] = 445,
                    ["image"] = 607795,
                    ["name"] = "悲惨的提米",
                }, -- [2]
                {
                    ["id"] = 749,
                    ["image"] = 607569,
                    ["name"] = "指挥官玛洛尔",
                }, -- [3]
                {
                    ["id"] = 446,
                    ["image"] = 607818,
                    ["name"] = "希望破坏者威利",
                }, -- [4]
                {
                    ["id"] = 448,
                    ["image"] = 607660,
                    ["name"] = "档案管理员加尔福特",
                }, -- [5]
                {
                    ["id"] = 449,
                    ["image"] = 607551,
                    ["name"] = "巴纳扎尔",
                }, -- [6]
                {
                    ["id"] = 450,
                    ["image"] = 607792,
                    ["name"] = "不可宽恕者",
                }, -- [7]
                {
                    ["id"] = 451,
                    ["image"] = 607553,
                    ["name"] = "安娜丝塔丽男爵夫人",
                }, -- [8]
                {
                    ["id"] = 452,
                    ["image"] = 607724,
                    ["name"] = "奈鲁布恩坎",
                }, -- [9]
                {
                    ["id"] = 453,
                    ["image"] = 607707,
                    ["name"] = "苍白的玛勒基",
                }, -- [10]
                {
                    ["id"] = 454,
                    ["image"] = 607791,
                    ["name"] = "巴瑟拉斯镇长",
                }, -- [11]
                {
                    ["id"] = 455,
                    ["image"] = 607752,
                    ["name"] = "吞咽者拉姆斯登",
                }, -- [12]
                {
                    ["id"] = 456,
                    ["image"] = 607692,
                    ["name"] = "奥里克斯·瑞文戴尔领主",
                }, -- [13]
            },
        }, -- [12]
        {
            ["id"] = 63,
            ["image"] = 522352,
            ["name"] = "死亡矿井",
            ["bosses"] = {
                {
                    ["id"] = 89,
                    ["image"] = 522228,
                    ["name"] = "格拉布托克",
                }, -- [1]
                {
                    ["id"] = 90,
                    ["image"] = 522234,
                    ["name"] = "赫利克斯·破甲",
                }, -- [2]
                {
                    ["id"] = 91,
                    ["image"] = 522225,
                    ["name"] = "死神5000",
                }, -- [3]
                {
                    ["id"] = 92,
                    ["image"] = 522189,
                    ["name"] = "撕心狼将军",
                }, -- [4]
                {
                    ["id"] = 93,
                    ["image"] = 522210,
                    ["name"] = "“船长”曲奇",
                }, -- [5]
            },
        }, -- [13]
        {
            ["id"] = 232,
            ["image"] = 608209,
            ["name"] = "玛拉顿",
            ["bosses"] = {
                {
                    ["id"] = 423,
                    ["image"] = 607728,
                    ["name"] = "诺克赛恩",
                }, -- [1]
                {
                    ["id"] = 424,
                    ["image"] = 607756,
                    ["name"] = "锐刺鞭笞者",
                }, -- [2]
                {
                    ["id"] = 425,
                    ["image"] = 607796,
                    ["name"] = "工匠吉兹洛克",
                }, -- [3]
                {
                    ["id"] = 427,
                    ["image"] = 607699,
                    ["name"] = "维利塔恩",
                }, -- [4]
                {
                    ["id"] = 428,
                    ["image"] = 607562,
                    ["name"] = "被诅咒的塞雷布拉斯",
                }, -- [5]
                {
                    ["id"] = 429,
                    ["image"] = 607684,
                    ["name"] = "兰斯利德",
                }, -- [6]
                {
                    ["id"] = 430,
                    ["image"] = 607761,
                    ["name"] = "洛特格里普",
                }, -- [7]
                {
                    ["id"] = 431,
                    ["image"] = 607747,
                    ["name"] = "瑟莱德丝公主",
                }, -- [8]
            },
        }, -- [14]
        {
            ["id"] = 238,
            ["image"] = 608223,
            ["name"] = "监狱",
            ["bosses"] = {
                {
                    ["id"] = 464,
                    ["image"] = 4776138,
                    ["name"] = "霍格",
                }, -- [1]
                {
                    ["id"] = 465,
                    ["image"] = 607695,
                    ["name"] = "灼热勋爵",
                }, -- [2]
                {
                    ["id"] = 466,
                    ["image"] = 607753,
                    ["name"] = "兰多菲·摩洛克",
                }, -- [3]
            },
        }, -- [15]
        {
            ["id"] = 241,
            ["image"] = 608230,
            ["name"] = "祖尔法拉克",
            ["bosses"] = {
                {
                    ["id"] = 483,
                    ["image"] = 607614,
                    ["name"] = "加兹瑞拉",
                }, -- [1]
                {
                    ["id"] = 484,
                    ["image"] = 607541,
                    ["name"] = "安图苏尔",
                }, -- [2]
                {
                    ["id"] = 485,
                    ["image"] = 607793,
                    ["name"] = "殉教者塞卡",
                }, -- [3]
                {
                    ["id"] = 486,
                    ["image"] = 607819,
                    ["name"] = "巫医祖穆拉恩",
                }, -- [4]
                {
                    ["id"] = 487,
                    ["image"] = 607723,
                    ["name"] = "耐克鲁姆和塞瑟斯",
                }, -- [5]
                {
                    ["id"] = 489,
                    ["image"] = 607564,
                    ["name"] = "乌克兹·沙顶",
                }, -- [6]
            },
        }, -- [16]
        {
            ["id"] = 316,
            ["image"] = 608214,
            ["name"] = "血色修道院",
            ["bosses"] = {
                {
                    ["id"] = 688,
                    ["image"] = 630853,
                    ["name"] = "裂魂者萨尔诺斯",
                }, -- [1]
                {
                    ["id"] = 671,
                    ["image"] = 630818,
                    ["name"] = "科洛夫修士",
                }, -- [2]
                {
                    ["id"] = 674,
                    ["image"] = 607643,
                    ["name"] = "大检察官怀特迈恩",
                }, -- [3]
            },
        }, -- [17]
        {
            ["id"] = 311,
            ["image"] = 643262,
            ["name"] = "血色大厅",
            ["bosses"] = {
                {
                    ["id"] = 660,
                    ["image"] = 630833,
                    ["name"] = "驯犬者布兰恩",
                }, -- [1]
                {
                    ["id"] = 654,
                    ["image"] = 630816,
                    ["name"] = "武器大师哈兰",
                }, -- [2]
                {
                    ["id"] = 656,
                    ["image"] = 630825,
                    ["name"] = "织焰者孔格勒",
                }, -- [3]
            },
        }, -- [18]
        {
            ["id"] = 231,
            ["image"] = 608202,
            ["name"] = "诺莫瑞根",
            ["bosses"] = {
                {
                    ["id"] = 419,
                    ["image"] = 607628,
                    ["name"] = "格鲁比斯",
                }, -- [1]
                {
                    ["id"] = 420,
                    ["image"] = 607808,
                    ["name"] = "粘性辐射尘",
                }, -- [2]
                {
                    ["id"] = 421,
                    ["image"] = 607594,
                    ["name"] = "电刑器6000型",
                }, -- [3]
                {
                    ["id"] = 418,
                    ["image"] = 607572,
                    ["name"] = "群体打击者9-60",
                }, -- [4]
                {
                    ["id"] = 422,
                    ["image"] = 607714,
                    ["name"] = "机械师瑟玛普拉格",
                }, -- [5]
            },
        }, -- [19]
        {
            ["id"] = 246,
            ["image"] = 608215,
            ["name"] = "通灵学院",
            ["bosses"] = {
                {
                    ["id"] = 659,
                    ["image"] = 630835,
                    ["name"] = "指导者寒心",
                }, -- [1]
                {
                    ["id"] = 663,
                    ["image"] = 607666,
                    ["name"] = "詹迪斯·巴罗夫",
                }, -- [2]
                {
                    ["id"] = 665,
                    ["image"] = 607755,
                    ["name"] = "血骨傀儡",
                }, -- [3]
                {
                    ["id"] = 666,
                    ["image"] = 630838,
                    ["name"] = "莉莉安·沃斯",
                }, -- [4]
                {
                    ["id"] = 684,
                    ["image"] = 607582,
                    ["name"] = "黑暗院长加丁",
                }, -- [5]
            },
        }, -- [20]
        {
            ["id"] = 237,
            ["image"] = 608217,
            ["name"] = "阿塔哈卡神庙",
            ["bosses"] = {
                {
                    ["id"] = 457,
                    ["image"] = 607548,
                    ["name"] = "哈卡的化身",
                }, -- [1]
                {
                    ["id"] = 458,
                    ["image"] = 607665,
                    ["name"] = "预言者迦玛兰",
                }, -- [2]
                {
                    ["id"] = 459,
                    ["image"] = 608311,
                    ["name"] = "梦境守望者",
                }, -- [3]
                {
                    ["id"] = 463,
                    ["image"] = 607768,
                    ["name"] = "伊兰尼库斯的阴影",
                }, -- [4]
            },
        }, -- [21]
        {
            ["id"] = 227,
            ["image"] = 608195,
            ["name"] = "黑暗深渊",
            ["bosses"] = {
                {
                    ["id"] = 368,
                    ["image"] = 1064179,
                    ["name"] = "加摩拉",
                }, -- [1]
                {
                    ["id"] = 436,
                    ["image"] = 1064180,
                    ["name"] = "多米尼娜",
                }, -- [2]
                {
                    ["id"] = 426,
                    ["image"] = 522214,
                    ["name"] = "征服者克鲁尔",
                }, -- [3]
                {
                    ["id"] = 1145,
                    ["image"] = 1064181,
                    ["name"] = "苏克",
                }, -- [4]
                {
                    ["id"] = 447,
                    ["image"] = 1064182,
                    ["name"] = "深渊守护者",
                }, -- [5]
                {
                    ["id"] = 1144,
                    ["image"] = 1064183,
                    ["name"] = "刽子手戈尔",
                }, -- [6]
                {
                    ["id"] = 437,
                    ["image"] = 1064184,
                    ["name"] = "暮光领主巴赛尔",
                }, -- [7]
                {
                    ["id"] = 444,
                    ["image"] = 607532,
                    ["name"] = "阿库麦尔",
                }, -- [8]
            },
        }, -- [22]
        {
            ["id"] = 229,
            ["image"] = 608197,
            ["name"] = "黑石塔下层",
            ["bosses"] = {
                {
                    ["id"] = 388,
                    ["image"] = 607645,
                    ["name"] = "欧莫克大王",
                }, -- [1]
                {
                    ["id"] = 389,
                    ["image"] = 607769,
                    ["name"] = "暗影猎手沃什加斯",
                }, -- [2]
                {
                    ["id"] = 390,
                    ["image"] = 607810,
                    ["name"] = "指挥官沃恩",
                }, -- [3]
                {
                    ["id"] = 391,
                    ["image"] = 607719,
                    ["name"] = "烟网蛛后",
                }, -- [4]
                {
                    ["id"] = 392,
                    ["image"] = 607801,
                    ["name"] = "尤洛克·暗嚎",
                }, -- [5]
                {
                    ["id"] = 393,
                    ["image"] = 607751,
                    ["name"] = "军需官兹格雷斯",
                }, -- [6]
                {
                    ["id"] = 394,
                    ["image"] = 607634,
                    ["name"] = "哈雷肯",
                }, -- [7]
                {
                    ["id"] = 395,
                    ["image"] = 607615,
                    ["name"] = "奴役者基兹鲁尔",
                }, -- [8]
                {
                    ["id"] = 396,
                    ["image"] = 607737,
                    ["name"] = "维姆萨拉克",
                }, -- [9]
            },
        }, -- [23]
        {
            ["id"] = 228,
            ["image"] = 608196,
            ["name"] = "黑石深渊",
            ["bosses"] = {
                {
                    ["id"] = 369,
                    ["image"] = 607644,
                    ["name"] = "审讯官格斯塔恩",
                }, -- [1]
                {
                    ["id"] = 370,
                    ["image"] = 607697,
                    ["name"] = "洛考尔",
                }, -- [2]
                {
                    ["id"] = 371,
                    ["image"] = 607647,
                    ["name"] = "驯犬者格雷布玛尔",
                }, -- [3]
                {
                    ["id"] = 372,
                    ["image"] = 608314,
                    ["name"] = "秩序竞技场",
                }, -- [4]
                {
                    ["id"] = 373,
                    ["image"] = 607749,
                    ["name"] = "控火师罗格雷恩",
                }, -- [5]
                {
                    ["id"] = 374,
                    ["image"] = 607694,
                    ["name"] = "伊森迪奥斯",
                }, -- [6]
                {
                    ["id"] = 375,
                    ["image"] = 607814,
                    ["name"] = "典狱官斯迪尔基斯",
                }, -- [7]
                {
                    ["id"] = 376,
                    ["image"] = 607602,
                    ["name"] = "弗诺斯·达克维尔",
                }, -- [8]
                {
                    ["id"] = 377,
                    ["image"] = 607549,
                    ["name"] = "贝尔加",
                }, -- [9]
                {
                    ["id"] = 378,
                    ["image"] = 607610,
                    ["name"] = "怒炉将军",
                }, -- [10]
                {
                    ["id"] = 379,
                    ["image"] = 607618,
                    ["name"] = "傀儡统帅阿格曼奇",
                }, -- [11]
                {
                    ["id"] = 380,
                    ["image"] = 607650,
                    ["name"] = "霍尔雷·黑须",
                }, -- [12]
                {
                    ["id"] = 381,
                    ["image"] = 607740,
                    ["name"] = "法拉克斯",
                }, -- [13]
                {
                    ["id"] = 383,
                    ["image"] = 607741,
                    ["name"] = "普拉格",
                }, -- [14]
                {
                    ["id"] = 384,
                    ["image"] = 607535,
                    ["name"] = "弗莱拉斯总大使",
                }, -- [15]
                {
                    ["id"] = 385,
                    ["image"] = 607587,
                    ["name"] = "黑铁七贤",
                }, -- [16]
                {
                    ["id"] = 386,
                    ["image"] = 607705,
                    ["name"] = "玛格姆斯",
                }, -- [17]
                {
                    ["id"] = 387,
                    ["image"] = 607595,
                    ["name"] = "达格兰·索瑞森大帝",
                }, -- [18]
            },
        }, -- [24]
    },
    ["争霸艾泽拉斯"] = {
        {
            ["id"] = 1028,
            ["image"] = 2178279,
            ["name"] = "艾泽拉斯",
            ["bosses"] = {
                {
                    ["id"] = 2378,
                    ["image"] = 3284400,
                    ["name"] = "大女皇夏柯扎拉",
                }, -- [1]
                {
                    ["id"] = 2381,
                    ["image"] = 3284401,
                    ["name"] = "碎地者弗克拉兹",
                }, -- [2]
                {
                    ["id"] = 2363,
                    ["image"] = 3012063,
                    ["name"] = "维科玛拉",
                }, -- [3]
                {
                    ["id"] = 2362,
                    ["image"] = 3012061,
                    ["name"] = "奥玛斯，缚魂者",
                }, -- [4]
                {
                    ["id"] = 2329,
                    ["image"] = 2497782,
                    ["name"] = "森林之王伊弗斯",
                }, -- [5]
                {
                    ["id"] = 2212,
                    ["image"] = 2176752,
                    ["name"] = "雄狮之吼",
                }, -- [6]
                {
                    ["id"] = 2139,
                    ["image"] = 2176755,
                    ["name"] = "提赞",
                }, -- [7]
                {
                    ["id"] = 2141,
                    ["image"] = 2176734,
                    ["name"] = "基阿拉克",
                }, -- [8]
                {
                    ["id"] = 2197,
                    ["image"] = 2176731,
                    ["name"] = "冰雹构造体",
                }, -- [9]
                {
                    ["id"] = 2198,
                    ["image"] = 2176760,
                    ["name"] = "战争使者耶纳基兹",
                }, -- [10]
                {
                    ["id"] = 2199,
                    ["image"] = 2176716,
                    ["name"] = "蔚索斯，飞翼台风",
                }, -- [11]
                {
                    ["id"] = 2210,
                    ["image"] = 2176723,
                    ["name"] = "食沙者克劳洛克",
                }, -- [12]
            },
        }, -- [1]
        {
            ["id"] = 1031,
            ["image"] = 2178277,
            ["name"] = "奥迪尔",
            ["bosses"] = {
                {
                    ["id"] = 2168,
                    ["image"] = 2176749,
                    ["name"] = "塔罗克",
                }, -- [1]
                {
                    ["id"] = 2167,
                    ["image"] = 2176741,
                    ["name"] = "纯净圣母",
                }, -- [2]
                {
                    ["id"] = 2146,
                    ["image"] = 2176725,
                    ["name"] = "腐臭吞噬者",
                }, -- [3]
                {
                    ["id"] = 2169,
                    ["image"] = 2176761,
                    ["name"] = "泽克沃兹，恩佐斯的传令官",
                }, -- [4]
                {
                    ["id"] = 2166,
                    ["image"] = 2176757,
                    ["name"] = "维克提斯",
                }, -- [5]
                {
                    ["id"] = 2195,
                    ["image"] = 2176762,
                    ["name"] = "重生者祖尔",
                }, -- [6]
                {
                    ["id"] = 2194,
                    ["image"] = 2176742,
                    ["name"] = "拆解者米斯拉克斯",
                }, -- [7]
                {
                    ["id"] = 2147,
                    ["image"] = 2176728,
                    ["name"] = "戈霍恩",
                }, -- [8]
            },
        }, -- [2]
        {
            ["id"] = 1176,
            ["image"] = 2482729,
            ["name"] = "达萨罗之战",
            ["bosses"] = {
                {
                    ["id"] = 2333,
                    ["image"] = 2497778,
                    ["name"] = "圣光勇士",
                }, -- [1]
                {
                    ["id"] = 2325,
                    ["image"] = 2497783,
                    ["name"] = "丛林之王格洛恩",
                }, -- [2]
                {
                    ["id"] = 2341,
                    ["image"] = 2529383,
                    ["name"] = "玉火大师",
                }, -- [3]
                {
                    ["id"] = 2342,
                    ["image"] = 2497790,
                    ["name"] = "丰灵",
                }, -- [4]
                {
                    ["id"] = 2330,
                    ["image"] = 2497779,
                    ["name"] = "神选者教团",
                }, -- [5]
                {
                    ["id"] = 2335,
                    ["image"] = 2497784,
                    ["name"] = "拉斯塔哈大王",
                }, -- [6]
                {
                    ["id"] = 2334,
                    ["image"] = 2497788,
                    ["name"] = "大工匠梅卡托克",
                }, -- [7]
                {
                    ["id"] = 2337,
                    ["image"] = 2497786,
                    ["name"] = "风暴之墙阻击战",
                }, -- [8]
                {
                    ["id"] = 2343,
                    ["image"] = 2497785,
                    ["name"] = "吉安娜·普罗德摩尔",
                }, -- [9]
            },
        }, -- [3]
        {
            ["id"] = 1177,
            ["image"] = 2498193,
            ["name"] = "风暴熔炉",
            ["bosses"] = {
                {
                    ["id"] = 2328,
                    ["image"] = 2497795,
                    ["name"] = "无眠秘党",
                }, -- [1]
                {
                    ["id"] = 2332,
                    ["image"] = 2497794,
                    ["name"] = "乌纳特，虚空先驱",
                }, -- [2]
            },
        }, -- [4]
        {
            ["id"] = 1179,
            ["image"] = 3025320,
            ["name"] = "永恒王宫",
            ["bosses"] = {
                {
                    ["id"] = 2352,
                    ["image"] = 3012047,
                    ["name"] = "深渊指挥官西瓦拉",
                }, -- [1]
                {
                    ["id"] = 2347,
                    ["image"] = 3012062,
                    ["name"] = "黑水巨鳗",
                }, -- [2]
                {
                    ["id"] = 2353,
                    ["image"] = 3012058,
                    ["name"] = "艾萨拉之辉",
                }, -- [3]
                {
                    ["id"] = 2354,
                    ["image"] = 3012055,
                    ["name"] = "艾什凡女勋爵",
                }, -- [4]
                {
                    ["id"] = 2351,
                    ["image"] = 3012054,
                    ["name"] = "奥戈佐亚",
                }, -- [5]
                {
                    ["id"] = 2359,
                    ["image"] = 3012057,
                    ["name"] = "女王法庭",
                }, -- [6]
                {
                    ["id"] = 2349,
                    ["image"] = 3012064,
                    ["name"] = "扎库尔，尼奥罗萨先驱",
                }, -- [7]
                {
                    ["id"] = 2361,
                    ["image"] = 3012056,
                    ["name"] = "艾萨拉女王",
                }, -- [8]
            },
        }, -- [5]
        {
            ["id"] = 1180,
            ["image"] = 3221463,
            ["name"] = "尼奥罗萨，觉醒之城",
            ["bosses"] = {
                {
                    ["id"] = 2368,
                    ["image"] = 3256385,
                    ["name"] = "黑龙帝王拉希奥",
                }, -- [1]
                {
                    ["id"] = 2365,
                    ["image"] = 3256380,
                    ["name"] = "玛乌特",
                }, -- [2]
                {
                    ["id"] = 2369,
                    ["image"] = 3256384,
                    ["name"] = "先知斯基特拉",
                }, -- [3]
                {
                    ["id"] = 2377,
                    ["image"] = 3256386,
                    ["name"] = "黑暗审判官夏奈什",
                }, -- [4]
                {
                    ["id"] = 2372,
                    ["image"] = 3256378,
                    ["name"] = "主脑",
                }, -- [5]
                {
                    ["id"] = 2367,
                    ["image"] = 3256383,
                    ["name"] = "无厌者夏德哈",
                }, -- [6]
                {
                    ["id"] = 2373,
                    ["image"] = 3256377,
                    ["name"] = "德雷阿佳丝",
                }, -- [7]
                {
                    ["id"] = 2374,
                    ["image"] = 3256379,
                    ["name"] = "伊格诺斯，重生之蚀",
                }, -- [8]
                {
                    ["id"] = 2370,
                    ["image"] = 3257677,
                    ["name"] = "维克修娜",
                }, -- [9]
                {
                    ["id"] = 2364,
                    ["image"] = 3256382,
                    ["name"] = "虚无者莱登",
                }, -- [10]
                {
                    ["id"] = 2366,
                    ["image"] = 3256376,
                    ["name"] = "恩佐斯的外壳",
                }, -- [11]
                {
                    ["id"] = 2375,
                    ["image"] = 3256381,
                    ["name"] = "腐蚀者恩佐斯",
                }, -- [12]
            },
        }, -- [6]
        {
            ["id"] = 1023,
            ["image"] = 2178272,
            ["name"] = "围攻伯拉勒斯",
            ["bosses"] = {
                {
                    ["id"] = 2133,
                    ["image"] = 2176746,
                    ["name"] = "拜恩比吉中士",
                }, -- [1]
                {
                    ["id"] = 2173,
                    ["image"] = 2176722,
                    ["name"] = "恐怖船长洛克伍德",
                }, -- [2]
                {
                    ["id"] = 2134,
                    ["image"] = 2176730,
                    ["name"] = "哈达尔·黑渊",
                }, -- [3]
                {
                    ["id"] = 2140,
                    ["image"] = 2176758,
                    ["name"] = "维克戈斯",
                }, -- [4]
            },
        }, -- [7]
        {
            ["id"] = 1022,
            ["image"] = 2178275,
            ["name"] = "地渊孢林",
            ["bosses"] = {
                {
                    ["id"] = 2157,
                    ["image"] = 2176724,
                    ["name"] = "长者莉娅克萨",
                }, -- [1]
                {
                    ["id"] = 2131,
                    ["image"] = 2176719,
                    ["name"] = "被感染的岩喉",
                }, -- [2]
                {
                    ["id"] = 2130,
                    ["image"] = 2176748,
                    ["name"] = "孢子召唤师赞查",
                }, -- [3]
                {
                    ["id"] = 2158,
                    ["image"] = 2176756,
                    ["name"] = "不羁畸变怪",
                }, -- [4]
            },
        }, -- [8]
        {
            ["id"] = 1030,
            ["image"] = 2178273,
            ["name"] = "塞塔里斯神庙",
            ["bosses"] = {
                {
                    ["id"] = 2142,
                    ["image"] = 2176710,
                    ["name"] = "阿德里斯和阿斯匹克斯",
                }, -- [1]
                {
                    ["id"] = 2143,
                    ["image"] = 2176739,
                    ["name"] = "米利克萨",
                }, -- [2]
                {
                    ["id"] = 2144,
                    ["image"] = 2176727,
                    ["name"] = "加瓦兹特",
                }, -- [3]
                {
                    ["id"] = 2145,
                    ["image"] = 2176713,
                    ["name"] = "塞塔里斯的化身",
                }, -- [4]
            },
        }, -- [9]
        {
            ["id"] = 1002,
            ["image"] = 2178276,
            ["name"] = "托尔达戈",
            ["bosses"] = {
                {
                    ["id"] = 2097,
                    ["image"] = 2176753,
                    ["name"] = "泥沙女王",
                }, -- [1]
                {
                    ["id"] = 2098,
                    ["image"] = 2176733,
                    ["name"] = "杰斯·豪里斯",
                }, -- [2]
                {
                    ["id"] = 2099,
                    ["image"] = 2176735,
                    ["name"] = "骑士队长瓦莱莉",
                }, -- [3]
                {
                    ["id"] = 2096,
                    ["image"] = 2176743,
                    ["name"] = "科古斯狱长",
                }, -- [4]
            },
        }, -- [10]
        {
            ["id"] = 1012,
            ["image"] = 2178274,
            ["name"] = "暴富矿区！！",
            ["bosses"] = {
                {
                    ["id"] = 2109,
                    ["image"] = 2176718,
                    ["name"] = "投币式群体打击者",
                }, -- [1]
                {
                    ["id"] = 2114,
                    ["image"] = 2176714,
                    ["name"] = "艾泽洛克",
                }, -- [2]
                {
                    ["id"] = 2115,
                    ["image"] = 2176745,
                    ["name"] = "瑞克莎·流火",
                }, -- [3]
                {
                    ["id"] = 2116,
                    ["image"] = 2176740,
                    ["name"] = "商业大亨拉兹敦克",
                }, -- [4]
            },
        }, -- [11]
        {
            ["id"] = 1021,
            ["image"] = 2178278,
            ["name"] = "维克雷斯庄园",
            ["bosses"] = {
                {
                    ["id"] = 2125,
                    ["image"] = 2176732,
                    ["name"] = "毒心三姝",
                }, -- [1]
                {
                    ["id"] = 2126,
                    ["image"] = 2176747,
                    ["name"] = "魂缚巨像",
                }, -- [2]
                {
                    ["id"] = 2127,
                    ["image"] = 2176744,
                    ["name"] = "贪食的拉尔",
                }, -- [3]
                {
                    ["id"] = 2128,
                    ["image"] = 2176736,
                    ["name"] = "维克雷斯勋爵和夫人",
                }, -- [4]
                {
                    ["id"] = 2129,
                    ["image"] = 2176729,
                    ["name"] = "高莱克·图尔",
                }, -- [5]
            },
        }, -- [12]
        {
            ["id"] = 1001,
            ["image"] = 1778893,
            ["name"] = "自由镇",
            ["bosses"] = {
                {
                    ["id"] = 2102,
                    ["image"] = 1778351,
                    ["name"] = "天空上尉库拉格",
                }, -- [1]
                {
                    ["id"] = 2093,
                    ["image"] = 1778346,
                    ["name"] = "海盗议会",
                }, -- [2]
                {
                    ["id"] = 2094,
                    ["image"] = 1778350,
                    ["name"] = "藏宝竞技场",
                }, -- [3]
                {
                    ["id"] = 2095,
                    ["image"] = 1778347,
                    ["name"] = "哈兰·斯威提",
                }, -- [4]
            },
        }, -- [13]
        {
            ["id"] = 1041,
            ["image"] = 2178269,
            ["name"] = "诸王之眠",
            ["bosses"] = {
                {
                    ["id"] = 2165,
                    ["image"] = 2176751,
                    ["name"] = "黄金风蛇",
                }, -- [1]
                {
                    ["id"] = 2171,
                    ["image"] = 2176738,
                    ["name"] = "殓尸者姆沁巴",
                }, -- [2]
                {
                    ["id"] = 2170,
                    ["image"] = 2176750,
                    ["name"] = "部族议会",
                }, -- [3]
                {
                    ["id"] = 2172,
                    ["image"] = 2176720,
                    ["name"] = "始皇达萨",
                }, -- [4]
            },
        }, -- [14]
        {
            ["id"] = 968,
            ["image"] = 1778892,
            ["name"] = "阿塔达萨",
            ["bosses"] = {
                {
                    ["id"] = 2082,
                    ["image"] = 1778348,
                    ["name"] = "女祭司阿伦扎",
                }, -- [1]
                {
                    ["id"] = 2036,
                    ["image"] = 1778352,
                    ["name"] = "沃卡尔",
                }, -- [2]
                {
                    ["id"] = 2083,
                    ["image"] = 1778349,
                    ["name"] = "莱赞",
                }, -- [3]
                {
                    ["id"] = 2030,
                    ["image"] = 1778353,
                    ["name"] = "亚兹玛",
                }, -- [4]
            },
        }, -- [15]
        {
            ["id"] = 1036,
            ["image"] = 2178271,
            ["name"] = "风暴神殿",
            ["bosses"] = {
                {
                    ["id"] = 2153,
                    ["image"] = 2176712,
                    ["name"] = "阿库希尔",
                }, -- [1]
                {
                    ["id"] = 2154,
                    ["image"] = 2176754,
                    ["name"] = "海贤议会",
                }, -- [2]
                {
                    ["id"] = 2155,
                    ["image"] = 2176737,
                    ["name"] = "斯托颂勋爵",
                }, -- [3]
                {
                    ["id"] = 2156,
                    ["image"] = 2176759,
                    ["name"] = "低语者沃尔兹斯",
                }, -- [4]
            },
        }, -- [16]
        {
            ["id"] = 1178,
            ["image"] = 3025325,
            ["name"] = "麦卡贡行动",
            ["bosses"] = {
                {
                    ["id"] = 2357,
                    ["image"] = 3012050,
                    ["name"] = "戈巴马克国王",
                }, -- [1]
                {
                    ["id"] = 2358,
                    ["image"] = 3012048,
                    ["name"] = "冈克",
                }, -- [2]
                {
                    ["id"] = 2360,
                    ["image"] = 3012059,
                    ["name"] = "崔克茜和耐诺",
                }, -- [3]
                {
                    ["id"] = 2355,
                    ["image"] = 3012049,
                    ["name"] = "HK-8型空中压制单位",
                }, -- [4]
                {
                    ["id"] = 2336,
                    ["image"] = 3012060,
                    ["name"] = "坦克大战",
                }, -- [5]
                {
                    ["id"] = 2339,
                    ["image"] = 3012052,
                    ["name"] = "狂犬K.U.-J.0.",
                }, -- [6]
                {
                    ["id"] = 2348,
                    ["image"] = 3012053,
                    ["name"] = "机械师的花园",
                }, -- [7]
                {
                    ["id"] = 2331,
                    ["image"] = 3012051,
                    ["name"] = "麦卡贡国王",
                }, -- [8]
            },
        }, -- [17]
    },
    ["军团再临"] = {
        {
            ["id"] = 822,
            ["image"] = 1411854,
            ["name"] = "破碎群岛",
            ["bosses"] = {
                {
                    ["id"] = 1790,
                    ["image"] = 1411023,
                    ["name"] = "鬼母阿娜",
                }, -- [1]
                {
                    ["id"] = 1956,
                    ["image"] = 1134499,
                    ["name"] = "阿波克隆",
                }, -- [2]
                {
                    ["id"] = 1883,
                    ["image"] = 1385722,
                    ["name"] = "布鲁塔卢斯",
                }, -- [3]
                {
                    ["id"] = 1774,
                    ["image"] = 1411024,
                    ["name"] = "卡拉米尔",
                }, -- [4]
                {
                    ["id"] = 1789,
                    ["image"] = 1411025,
                    ["name"] = "冷血的杜贡",
                }, -- [5]
                {
                    ["id"] = 1795,
                    ["image"] = 1472454,
                    ["name"] = "浮骸",
                }, -- [6]
                {
                    ["id"] = 1770,
                    ["image"] = 1411026,
                    ["name"] = "胡墨格里斯",
                }, -- [7]
                {
                    ["id"] = 1769,
                    ["image"] = 1411027,
                    ["name"] = "勒凡图斯",
                }, -- [8]
                {
                    ["id"] = 1884,
                    ["image"] = 1579937,
                    ["name"] = "马利费库斯",
                }, -- [9]
                {
                    ["id"] = 1783,
                    ["image"] = 1411028,
                    ["name"] = "魔王纳扎克",
                }, -- [10]
                {
                    ["id"] = 1749,
                    ["image"] = 1411029,
                    ["name"] = "尼索格",
                }, -- [11]
                {
                    ["id"] = 1763,
                    ["image"] = 1411030,
                    ["name"] = "沙索斯",
                }, -- [12]
                {
                    ["id"] = 1885,
                    ["image"] = 1579941,
                    ["name"] = "丝瓦什",
                }, -- [13]
                {
                    ["id"] = 1756,
                    ["image"] = 1411031,
                    ["name"] = "夺魂者",
                }, -- [14]
                {
                    ["id"] = 1796,
                    ["image"] = 1472455,
                    ["name"] = "凋零者吉姆",
                }, -- [15]
            },
        }, -- [1]
        {
            ["id"] = 768,
            ["image"] = 1452687,
            ["name"] = "翡翠梦魇",
            ["bosses"] = {
                {
                    ["id"] = 1703,
                    ["image"] = 1410972,
                    ["name"] = "尼珊德拉",
                }, -- [1]
                {
                    ["id"] = 1738,
                    ["image"] = 1410960,
                    ["name"] = "伊格诺斯，腐蚀之心",
                }, -- [2]
                {
                    ["id"] = 1744,
                    ["image"] = 1410947,
                    ["name"] = "艾乐瑞瑟·雷弗拉尔",
                }, -- [3]
                {
                    ["id"] = 1667,
                    ["image"] = 1410991,
                    ["name"] = "乌索克",
                }, -- [4]
                {
                    ["id"] = 1704,
                    ["image"] = 1410945,
                    ["name"] = "梦魇之龙",
                }, -- [5]
                {
                    ["id"] = 1750,
                    ["image"] = 1410940,
                    ["name"] = "塞纳留斯",
                }, -- [6]
                {
                    ["id"] = 1726,
                    ["image"] = 1410994,
                    ["name"] = "萨维斯",
                }, -- [7]
            },
        }, -- [2]
        {
            ["id"] = 861,
            ["image"] = 1537284,
            ["name"] = "勇气试炼",
            ["bosses"] = {
                {
                    ["id"] = 1819,
                    ["image"] = 1410974,
                    ["name"] = "奥丁",
                }, -- [1]
                {
                    ["id"] = 1830,
                    ["image"] = 1536491,
                    ["name"] = "高姆",
                }, -- [2]
                {
                    ["id"] = 1829,
                    ["image"] = 1410957,
                    ["name"] = "海拉",
                }, -- [3]
            },
        }, -- [3]
        {
            ["id"] = 786,
            ["image"] = 1450575,
            ["name"] = "暗夜要塞",
            ["bosses"] = {
                {
                    ["id"] = 1706,
                    ["image"] = 1410981,
                    ["name"] = "斯考匹隆",
                }, -- [1]
                {
                    ["id"] = 1725,
                    ["image"] = 1410941,
                    ["name"] = "时空畸体",
                }, -- [2]
                {
                    ["id"] = 1731,
                    ["image"] = 1410989,
                    ["name"] = "崔利艾克斯",
                }, -- [3]
                {
                    ["id"] = 1751,
                    ["image"] = 1410983,
                    ["name"] = "魔剑士奥鲁瑞尔",
                }, -- [4]
                {
                    ["id"] = 1762,
                    ["image"] = 1410987,
                    ["name"] = "提克迪奥斯",
                }, -- [5]
                {
                    ["id"] = 1713,
                    ["image"] = 1410965,
                    ["name"] = "克洛苏斯",
                }, -- [6]
                {
                    ["id"] = 1761,
                    ["image"] = 1410939,
                    ["name"] = "高级植物学家特尔安",
                }, -- [7]
                {
                    ["id"] = 1732,
                    ["image"] = 1410984,
                    ["name"] = "占星师艾塔乌斯",
                }, -- [8]
                {
                    ["id"] = 1743,
                    ["image"] = 1410954,
                    ["name"] = "大魔导师艾利桑德",
                }, -- [9]
                {
                    ["id"] = 1737,
                    ["image"] = 1410955,
                    ["name"] = "古尔丹",
                }, -- [10]
            },
        }, -- [4]
        {
            ["id"] = 875,
            ["image"] = 1616106,
            ["name"] = "萨格拉斯之墓",
            ["bosses"] = {
                {
                    ["id"] = 1862,
                    ["image"] = 1579934,
                    ["name"] = "格罗斯",
                }, -- [1]
                {
                    ["id"] = 1867,
                    ["image"] = 1579936,
                    ["name"] = "恶魔审判庭",
                }, -- [2]
                {
                    ["id"] = 1856,
                    ["image"] = 1579940,
                    ["name"] = "哈亚坦",
                }, -- [3]
                {
                    ["id"] = 1903,
                    ["image"] = 1579935,
                    ["name"] = "月之姐妹",
                }, -- [4]
                {
                    ["id"] = 1861,
                    ["image"] = 1579939,
                    ["name"] = "主母萨丝琳",
                }, -- [5]
                {
                    ["id"] = 1896,
                    ["image"] = 1579943,
                    ["name"] = "绝望的聚合体",
                }, -- [6]
                {
                    ["id"] = 1897,
                    ["image"] = 1579933,
                    ["name"] = "戒卫侍女",
                }, -- [7]
                {
                    ["id"] = 1873,
                    ["image"] = 1579932,
                    ["name"] = "堕落的化身",
                }, -- [8]
                {
                    ["id"] = 1898,
                    ["image"] = 1385746,
                    ["name"] = "基尔加丹",
                }, -- [9]
            },
        }, -- [5]
        {
            ["id"] = 959,
            ["image"] = 1718212,
            ["name"] = "侵入点",
            ["bosses"] = {
                {
                    ["id"] = 2010,
                    ["image"] = 1715215,
                    ["name"] = "主母芙努娜",
                }, -- [1]
                {
                    ["id"] = 2011,
                    ["image"] = 1715216,
                    ["name"] = "妖女奥露拉黛儿",
                }, -- [2]
                {
                    ["id"] = 2012,
                    ["image"] = 1715212,
                    ["name"] = "审判官梅托",
                }, -- [3]
                {
                    ["id"] = 2013,
                    ["image"] = 1715217,
                    ["name"] = "奥库拉鲁斯",
                }, -- [4]
                {
                    ["id"] = 2014,
                    ["image"] = 1715221,
                    ["name"] = "索塔纳索尔",
                }, -- [5]
                {
                    ["id"] = 2015,
                    ["image"] = 1715218,
                    ["name"] = "深渊领主维尔姆斯",
                }, -- [6]
            },
        }, -- [6]
        {
            ["id"] = 946,
            ["image"] = 1718211,
            ["name"] = "安托鲁斯，燃烧王座",
            ["bosses"] = {
                {
                    ["id"] = 1992,
                    ["image"] = 1715210,
                    ["name"] = "加洛西灭世者",
                }, -- [1]
                {
                    ["id"] = 1987,
                    ["image"] = 1715209,
                    ["name"] = "萨格拉斯的恶犬",
                }, -- [2]
                {
                    ["id"] = 1997,
                    ["image"] = 1715225,
                    ["name"] = "安托兰统帅议会",
                }, -- [3]
                {
                    ["id"] = 1985,
                    ["image"] = 1715219,
                    ["name"] = "传送门守护者哈萨贝尔",
                }, -- [4]
                {
                    ["id"] = 2025,
                    ["image"] = 1715208,
                    ["name"] = "生命的缚誓者艾欧娜尔",
                }, -- [5]
                {
                    ["id"] = 2009,
                    ["image"] = 1715211,
                    ["name"] = "猎魂者伊墨纳尔",
                }, -- [6]
                {
                    ["id"] = 2004,
                    ["image"] = 1715213,
                    ["name"] = "金加洛斯",
                }, -- [7]
                {
                    ["id"] = 1983,
                    ["image"] = 1715223,
                    ["name"] = "瓦里玛萨斯",
                }, -- [8]
                {
                    ["id"] = 1986,
                    ["image"] = 1715222,
                    ["name"] = "破坏魔女巫会",
                }, -- [9]
                {
                    ["id"] = 1984,
                    ["image"] = 1715207,
                    ["name"] = "阿格拉玛",
                }, -- [10]
                {
                    ["id"] = 2031,
                    ["image"] = 1715536,
                    ["name"] = "寂灭者阿古斯",
                }, -- [11]
            },
        }, -- [7]
        {
            ["id"] = 727,
            ["image"] = 1411856,
            ["name"] = "噬魂之喉",
            ["bosses"] = {
                {
                    ["id"] = 1502,
                    ["image"] = 1410995,
                    ["name"] = "堕落君王伊米隆",
                }, -- [1]
                {
                    ["id"] = 1512,
                    ["image"] = 1410956,
                    ["name"] = "哈布隆",
                }, -- [2]
                {
                    ["id"] = 1663,
                    ["image"] = 1410957,
                    ["name"] = "海拉",
                }, -- [3]
            },
        }, -- [8]
        {
            ["id"] = 767,
            ["image"] = 1450574,
            ["name"] = "奈萨里奥的巢穴",
            ["bosses"] = {
                {
                    ["id"] = 1662,
                    ["image"] = 1410976,
                    ["name"] = "洛克莫拉",
                }, -- [1]
                {
                    ["id"] = 1665,
                    ["image"] = 1410990,
                    ["name"] = "乌拉罗格·塑山",
                }, -- [2]
                {
                    ["id"] = 1673,
                    ["image"] = 1410971,
                    ["name"] = "纳拉萨斯",
                }, -- [3]
                {
                    ["id"] = 1687,
                    ["image"] = 1410944,
                    ["name"] = "地底之王达古尔",
                }, -- [4]
            },
        }, -- [9]
        {
            ["id"] = 707,
            ["image"] = 1411858,
            ["name"] = "守望者地窟",
            ["bosses"] = {
                {
                    ["id"] = 1467,
                    ["image"] = 1410988,
                    ["name"] = "提拉宋·萨瑟利尔",
                }, -- [1]
                {
                    ["id"] = 1695,
                    ["image"] = 1410962,
                    ["name"] = "审判官托蒙托鲁姆",
                }, -- [2]
                {
                    ["id"] = 1468,
                    ["image"] = 1410937,
                    ["name"] = "阿什高姆",
                }, -- [3]
                {
                    ["id"] = 1469,
                    ["image"] = 1410952,
                    ["name"] = "格雷泽",
                }, -- [4]
                {
                    ["id"] = 1470,
                    ["image"] = 1410942,
                    ["name"] = "科达娜·邪歌",
                }, -- [5]
            },
        }, -- [10]
        {
            ["id"] = 945,
            ["image"] = 1718213,
            ["name"] = "执政团之座",
            ["bosses"] = {
                {
                    ["id"] = 1979,
                    ["image"] = 1715226,
                    ["name"] = "晋升者祖拉尔",
                }, -- [1]
                {
                    ["id"] = 1980,
                    ["image"] = 1715220,
                    ["name"] = "萨普瑞什",
                }, -- [2]
                {
                    ["id"] = 1981,
                    ["image"] = 1715224,
                    ["name"] = "总督奈扎尔",
                }, -- [3]
                {
                    ["id"] = 1982,
                    ["image"] = 1715214,
                    ["name"] = "鲁拉",
                }, -- [4]
            },
        }, -- [11]
        {
            ["id"] = 900,
            ["image"] = 1616922,
            ["name"] = "永夜大教堂",
            ["bosses"] = {
                {
                    ["id"] = 1905,
                    ["image"] = 1579930,
                    ["name"] = "阿格洛诺克斯",
                }, -- [1]
                {
                    ["id"] = 1906,
                    ["image"] = 1579942,
                    ["name"] = "轻蔑的萨什比特",
                }, -- [2]
                {
                    ["id"] = 1904,
                    ["image"] = 1579931,
                    ["name"] = "多玛塔克斯",
                }, -- [3]
                {
                    ["id"] = 1878,
                    ["image"] = 1579938,
                    ["name"] = "孟菲斯托斯",
                }, -- [4]
            },
        }, -- [12]
        {
            ["id"] = 777,
            ["image"] = 1498155,
            ["name"] = "突袭紫罗兰监狱",
            ["bosses"] = {
                {
                    ["id"] = 1693,
                    ["image"] = 1410950,
                    ["name"] = "溃面",
                }, -- [1]
                {
                    ["id"] = 1694,
                    ["image"] = 1410980,
                    ["name"] = "颤栗之喉",
                }, -- [2]
                {
                    ["id"] = 1702,
                    ["image"] = 1410938,
                    ["name"] = "鲜血公主萨安娜",
                }, -- [3]
                {
                    ["id"] = 1686,
                    ["image"] = 1410969,
                    ["name"] = "夺心者卡什",
                }, -- [4]
                {
                    ["id"] = 1688,
                    ["image"] = 1410968,
                    ["name"] = "米尔菲丝·法力风暴",
                }, -- [5]
                {
                    ["id"] = 1696,
                    ["image"] = 1410935,
                    ["name"] = "阿努贝斯特",
                }, -- [6]
                {
                    ["id"] = 1697,
                    ["image"] = 1410977,
                    ["name"] = "赛尔奥隆",
                }, -- [7]
                {
                    ["id"] = 1711,
                    ["image"] = 1410948,
                    ["name"] = "邪能领主贝图格",
                }, -- [8]
            },
        }, -- [13]
        {
            ["id"] = 800,
            ["image"] = 1498156,
            ["name"] = "群星庭院",
            ["bosses"] = {
                {
                    ["id"] = 1718,
                    ["image"] = 1410975,
                    ["name"] = "巡逻队长加多",
                }, -- [1]
                {
                    ["id"] = 1719,
                    ["image"] = 1410985,
                    ["name"] = "塔丽克萨·火冠",
                }, -- [2]
                {
                    ["id"] = 1720,
                    ["image"] = 1410933,
                    ["name"] = "顾问麦兰杜斯",
                }, -- [3]
            },
        }, -- [14]
        {
            ["id"] = 716,
            ["image"] = 1498157,
            ["name"] = "艾萨拉之眼",
            ["bosses"] = {
                {
                    ["id"] = 1480,
                    ["image"] = 1410992,
                    ["name"] = "督军帕杰什",
                }, -- [1]
                {
                    ["id"] = 1490,
                    ["image"] = 1410966,
                    ["name"] = "积怨夫人",
                }, -- [2]
                {
                    ["id"] = 1491,
                    ["image"] = 1410964,
                    ["name"] = "深须国王",
                }, -- [3]
                {
                    ["id"] = 1479,
                    ["image"] = 1410978,
                    ["name"] = "瑟芬崔斯克",
                }, -- [4]
                {
                    ["id"] = 1492,
                    ["image"] = 1410993,
                    ["name"] = "艾萨拉之怒",
                }, -- [5]
            },
        }, -- [15]
        {
            ["id"] = 721,
            ["image"] = 1498158,
            ["name"] = "英灵殿",
            ["bosses"] = {
                {
                    ["id"] = 1485,
                    ["image"] = 1410958,
                    ["name"] = "海姆达尔",
                }, -- [1]
                {
                    ["id"] = 1486,
                    ["image"] = 1410959,
                    ["name"] = "赫娅",
                }, -- [2]
                {
                    ["id"] = 1487,
                    ["image"] = 1410949,
                    ["name"] = "芬雷尔",
                }, -- [3]
                {
                    ["id"] = 1488,
                    ["image"] = 1410953,
                    ["name"] = "神王斯科瓦尔德",
                }, -- [4]
                {
                    ["id"] = 1489,
                    ["image"] = 1410974,
                    ["name"] = "奥丁",
                }, -- [5]
            },
        }, -- [16]
        {
            ["id"] = 860,
            ["image"] = 1537283,
            ["name"] = "重返卡拉赞",
            ["bosses"] = {
                {
                    ["id"] = 1820,
                    ["image"] = 1536495,
                    ["name"] = "歌剧院：魔法坏女巫",
                }, -- [1]
                {
                    ["id"] = 1826,
                    ["image"] = 1536494,
                    ["name"] = "歌剧院：西部故事",
                }, -- [2]
                {
                    ["id"] = 1827,
                    ["image"] = 1536493,
                    ["name"] = "歌剧院：美女与野兽",
                }, -- [3]
                {
                    ["id"] = 1825,
                    ["image"] = 1378997,
                    ["name"] = "贞节圣女",
                }, -- [4]
                {
                    ["id"] = 1835,
                    ["image"] = 1536490,
                    ["name"] = "猎手阿图门",
                }, -- [5]
                {
                    ["id"] = 1837,
                    ["image"] = 1378999,
                    ["name"] = "莫罗斯",
                }, -- [6]
                {
                    ["id"] = 1836,
                    ["image"] = 1379020,
                    ["name"] = "馆长",
                }, -- [7]
                {
                    ["id"] = 1817,
                    ["image"] = 1536496,
                    ["name"] = "麦迪文之影",
                }, -- [8]
                {
                    ["id"] = 1818,
                    ["image"] = 1536492,
                    ["name"] = "魔力吞噬者",
                }, -- [9]
                {
                    ["id"] = 1838,
                    ["image"] = 1536497,
                    ["name"] = "监视者维兹艾德姆",
                }, -- [10]
            },
        }, -- [17]
        {
            ["id"] = 726,
            ["image"] = 1411857,
            ["name"] = "魔法回廊",
            ["bosses"] = {
                {
                    ["id"] = 1497,
                    ["image"] = 1410963,
                    ["name"] = "伊凡尔",
                }, -- [1]
                {
                    ["id"] = 1498,
                    ["image"] = 1410943,
                    ["name"] = "科蒂拉克斯",
                }, -- [2]
                {
                    ["id"] = 1499,
                    ["image"] = 1410951,
                    ["name"] = "萨卡尔将军",
                }, -- [3]
                {
                    ["id"] = 1500,
                    ["image"] = 1410970,
                    ["name"] = "纳尔提拉",
                }, -- [4]
                {
                    ["id"] = 1501,
                    ["image"] = 1410934,
                    ["name"] = "顾问凡多斯",
                }, -- [5]
            },
        }, -- [18]
        {
            ["id"] = 762,
            ["image"] = 1411855,
            ["name"] = "黑心林地",
            ["bosses"] = {
                {
                    ["id"] = 1654,
                    ["image"] = 1410936,
                    ["name"] = "大德鲁伊格兰达里斯",
                }, -- [1]
                {
                    ["id"] = 1655,
                    ["image"] = 1410973,
                    ["name"] = "橡树之心",
                }, -- [2]
                {
                    ["id"] = 1656,
                    ["image"] = 1410946,
                    ["name"] = "德萨隆",
                }, -- [3]
                {
                    ["id"] = 1657,
                    ["image"] = 1410979,
                    ["name"] = "萨维斯之影",
                }, -- [4]
            },
        }, -- [19]
        {
            ["id"] = 740,
            ["image"] = 1411853,
            ["name"] = "黑鸦堡垒",
            ["bosses"] = {
                {
                    ["id"] = 1518,
                    ["image"] = 1410986,
                    ["name"] = "融合之魂",
                }, -- [1]
                {
                    ["id"] = 1653,
                    ["image"] = 1410961,
                    ["name"] = "伊莉萨娜·拉文凯斯",
                }, -- [2]
                {
                    ["id"] = 1664,
                    ["image"] = 1410982,
                    ["name"] = "可恨的斯麦斯帕",
                }, -- [3]
                {
                    ["id"] = 1672,
                    ["image"] = 1410967,
                    ["name"] = "库塔洛斯·拉文凯斯",
                }, -- [4]
            },
        }, -- [20]
    },
}