---------------------------------------------------------------------
-- File: Cell\RaidDebuffs\ExpansionData\ExpansionData_zhTW.lua
-- Author: enderneko (enderneko-dev@outlook.com)
-- Created : 2023-09-03 19:55:43 +08:00
-- Modified: 2024-05-04 17:31:48 +08:00
---------------------------------------------------------------------

if not LOCALE_zhTW then return end

Cell_ExpansionData.locale = "zhTW"

Cell_ExpansionData.expansions = {
    "巨龍崛起",
    "暗影之境",
    "決戰艾澤拉斯",
    "軍臨天下",
    "德拉諾之霸",
    "潘達利亞之謎",
    "浩劫與重生",
    "巫妖王之怒",
    "燃燒的遠征",
    "艾澤拉斯",
}

Cell_ExpansionData.data = {
    ["艾澤拉斯"] = {
        {
            ["id"] = 741,
            ["image"] = 1396586,
            ["name"] = "熔火之心",
            ["bosses"] = {
                {
                    ["id"] = 1519,
                    ["image"] = 1378993,
                    ["name"] = "魯西弗隆",
                }, -- [1]
                {
                    ["id"] = 1520,
                    ["image"] = 1378995,
                    ["name"] = "瑪格曼達",
                }, -- [2]
                {
                    ["id"] = 1521,
                    ["image"] = 1378976,
                    ["name"] = "基赫納斯",
                }, -- [3]
                {
                    ["id"] = 1522,
                    ["image"] = 1378975,
                    ["name"] = "加爾",
                }, -- [4]
                {
                    ["id"] = 1523,
                    ["image"] = 1379013,
                    ["name"] = "沙斯拉爾",
                }, -- [5]
                {
                    ["id"] = 1524,
                    ["image"] = 1378966,
                    ["name"] = "迦頓男爵",
                }, -- [6]
                {
                    ["id"] = 1525,
                    ["image"] = 1379015,
                    ["name"] = "薩弗隆先驅者",
                }, -- [7]
                {
                    ["id"] = 1526,
                    ["image"] = 1378978,
                    ["name"] = "『焚化者』古雷曼格",
                }, -- [8]
                {
                    ["id"] = 1527,
                    ["image"] = 1378998,
                    ["name"] = "管理者埃克索圖斯",
                }, -- [9]
                {
                    ["id"] = 1528,
                    ["image"] = 522261,
                    ["name"] = "拉格納羅斯",
                }, -- [10]
            },
        }, -- [1]
        {
            ["id"] = 742,
            ["image"] = 1396580,
            ["name"] = "黑翼之巢",
            ["bosses"] = {
                {
                    ["id"] = 1529,
                    ["image"] = 1379008,
                    ["name"] = "狂野的拉佐格爾",
                }, -- [1]
                {
                    ["id"] = 1530,
                    ["image"] = 1379022,
                    ["name"] = "墮落的瓦拉斯塔茲",
                }, -- [2]
                {
                    ["id"] = 1531,
                    ["image"] = 1378968,
                    ["name"] = "幼龍領主勒西雷爾",
                }, -- [3]
                {
                    ["id"] = 1532,
                    ["image"] = 1378973,
                    ["name"] = "費爾默",
                }, -- [4]
                {
                    ["id"] = 1533,
                    ["image"] = 1378971,
                    ["name"] = "埃博諾克",
                }, -- [5]
                {
                    ["id"] = 1534,
                    ["image"] = 1378974,
                    ["name"] = "弗萊格爾",
                }, -- [6]
                {
                    ["id"] = 1535,
                    ["image"] = 1378969,
                    ["name"] = "克洛瑪古斯",
                }, -- [7]
                {
                    ["id"] = 1536,
                    ["image"] = 1379001,
                    ["name"] = "奈法利安",
                }, -- [8]
            },
        }, -- [2]
        {
            ["id"] = 743,
            ["image"] = 1396591,
            ["name"] = "安其拉廢墟",
            ["bosses"] = {
                {
                    ["id"] = 1537,
                    ["image"] = 1385749,
                    ["name"] = "庫林納克斯",
                }, -- [1]
                {
                    ["id"] = 1538,
                    ["image"] = 1385734,
                    ["name"] = "拉賈克斯將軍",
                }, -- [2]
                {
                    ["id"] = 1539,
                    ["image"] = 1385755,
                    ["name"] = "莫阿姆",
                }, -- [3]
                {
                    ["id"] = 1540,
                    ["image"] = 1385723,
                    ["name"] = "『暴食者』布魯",
                }, -- [4]
                {
                    ["id"] = 1541,
                    ["image"] = 1385718,
                    ["name"] = "『狩獵者』阿亞米斯",
                }, -- [5]
                {
                    ["id"] = 1542,
                    ["image"] = 1385759,
                    ["name"] = "『無疤者』奧斯里安",
                }, -- [6]
            },
        }, -- [3]
        {
            ["id"] = 744,
            ["image"] = 1396593,
            ["name"] = "安其拉神廟",
            ["bosses"] = {
                {
                    ["id"] = 1543,
                    ["image"] = 1385769,
                    ["name"] = "預言者斯克拉姆",
                }, -- [1]
                {
                    ["id"] = 1547,
                    ["image"] = 1390436,
                    ["name"] = "異種蠍皇族",
                }, -- [2]
                {
                    ["id"] = 1544,
                    ["image"] = 1385720,
                    ["name"] = "戰地衛士沙爾圖拉",
                }, -- [3]
                {
                    ["id"] = 1545,
                    ["image"] = 1385728,
                    ["name"] = "不屈的范克里斯",
                }, -- [4]
                {
                    ["id"] = 1548,
                    ["image"] = 1385771,
                    ["name"] = "維希度斯",
                }, -- [5]
                {
                    ["id"] = 1546,
                    ["image"] = 1385761,
                    ["name"] = "哈霍蘭公主",
                }, -- [6]
                {
                    ["id"] = 1549,
                    ["image"] = 1390437,
                    ["name"] = "雙子帝王",
                }, -- [7]
                {
                    ["id"] = 1550,
                    ["image"] = 1385760,
                    ["name"] = "奧羅",
                }, -- [8]
                {
                    ["id"] = 1551,
                    ["image"] = 1385726,
                    ["name"] = "克蘇恩",
                }, -- [9]
            },
        }, -- [4]
        {
            ["id"] = 234,
            ["image"] = 608213,
            ["name"] = "剃刀沼澤",
            ["bosses"] = {
                {
                    ["id"] = 896,
                    ["image"] = 607531,
                    ["name"] = "獵人骨牙",
                }, -- [1]
                {
                    ["id"] = 895,
                    ["image"] = 607760,
                    ["name"] = "魯古格",
                }, -- [2]
                {
                    ["id"] = 899,
                    ["image"] = 607736,
                    ["name"] = "督軍拉姆塔斯",
                }, -- [3]
                {
                    ["id"] = 900,
                    ["image"] = 1064175,
                    ["name"] = "『盲眼獵手』格羅亞特",
                }, -- [4]
                {
                    ["id"] = 901,
                    ["image"] = 607563,
                    ["name"] = "卡爾加‧刺肋",
                }, -- [5]
            },
        }, -- [5]
        {
            ["id"] = 233,
            ["image"] = 608212,
            ["name"] = "剃刀高地",
            ["bosses"] = {
                {
                    ["id"] = 1142,
                    ["image"] = 607633,
                    ["name"] = "阿魯斯",
                }, -- [1]
                {
                    ["id"] = 433,
                    ["image"] = 607718,
                    ["name"] = "火眼莫德雷斯",
                }, -- [2]
                {
                    ["id"] = 1143,
                    ["image"] = 1064178,
                    ["name"] = "肉疙瘩",
                }, -- [3]
                {
                    ["id"] = 1146,
                    ["image"] = 607584,
                    ["name"] = "亡語者黑棘",
                }, -- [4]
                {
                    ["id"] = 1141,
                    ["image"] = 607537,
                    ["name"] = "『寒冰使者』亞門納爾",
                }, -- [5]
            },
        }, -- [6]
        {
            ["id"] = 230,
            ["image"] = 608200,
            ["name"] = "厄運之槌",
            ["bosses"] = {
                {
                    ["id"] = 402,
                    ["image"] = 607824,
                    ["name"] = "瑟雷姆‧刺蹄",
                }, -- [1]
                {
                    ["id"] = 403,
                    ["image"] = 607653,
                    ["name"] = "海多斯博恩",
                }, -- [2]
                {
                    ["id"] = 404,
                    ["image"] = 607686,
                    ["name"] = "蕾瑟塔蒂絲",
                }, -- [3]
                {
                    ["id"] = 405,
                    ["image"] = 607533,
                    ["name"] = "『狂野變形者』奧茲恩",
                }, -- [4]
                {
                    ["id"] = 406,
                    ["image"] = 607785,
                    ["name"] = "特迪斯‧扭木",
                }, -- [5]
                {
                    ["id"] = 407,
                    ["image"] = 607656,
                    ["name"] = "伊琳娜‧鴉橡",
                }, -- [6]
                {
                    ["id"] = 408,
                    ["image"] = 607703,
                    ["name"] = "博學者卡雷迪斯",
                }, -- [7]
                {
                    ["id"] = 409,
                    ["image"] = 607657,
                    ["name"] = "伊莫塔爾",
                }, -- [8]
                {
                    ["id"] = 410,
                    ["image"] = 607745,
                    ["name"] = "托塞德林王子",
                }, -- [9]
                {
                    ["id"] = 411,
                    ["image"] = 607630,
                    ["name"] = "守衛摩爾達",
                }, -- [10]
                {
                    ["id"] = 412,
                    ["image"] = 607777,
                    ["name"] = "踐踏者克雷格",
                }, -- [11]
                {
                    ["id"] = 413,
                    ["image"] = 607629,
                    ["name"] = "守衛芬古斯",
                }, -- [12]
                {
                    ["id"] = 414,
                    ["image"] = 607631,
                    ["name"] = "守衛斯里基克",
                }, -- [13]
                {
                    ["id"] = 415,
                    ["image"] = 607560,
                    ["name"] = "隊長克羅卡斯",
                }, -- [14]
                {
                    ["id"] = 416,
                    ["image"] = 607565,
                    ["name"] = "『觀察者』克魯什",
                }, -- [15]
                {
                    ["id"] = 417,
                    ["image"] = 607673,
                    ["name"] = "戈多克大王",
                }, -- [16]
            },
        }, -- [7]
        {
            ["id"] = 240,
            ["image"] = 608229,
            ["name"] = "哀嚎洞穴",
            ["bosses"] = {
                {
                    ["id"] = 474,
                    ["image"] = 607680,
                    ["name"] = "安娜科德拉女士",
                }, -- [1]
                {
                    ["id"] = 476,
                    ["image"] = 607696,
                    ["name"] = "皮薩斯領主",
                }, -- [2]
                {
                    ["id"] = 475,
                    ["image"] = 607693,
                    ["name"] = "考布萊恩領主",
                }, -- [3]
                {
                    ["id"] = 477,
                    ["image"] = 607676,
                    ["name"] = "克雷什",
                }, -- [4]
                {
                    ["id"] = 478,
                    ["image"] = 607775,
                    ["name"] = "斯卡姆",
                }, -- [5]
                {
                    ["id"] = 479,
                    ["image"] = 607698,
                    ["name"] = "瑟芬迪斯領主",
                }, -- [6]
                {
                    ["id"] = 480,
                    ["image"] = 607805,
                    ["name"] = "永生的沃爾丹",
                }, -- [7]
                {
                    ["id"] = 481,
                    ["image"] = 607721,
                    ["name"] = "『吞噬者』穆坦努斯",
                }, -- [8]
            },
        }, -- [8]
        {
            ["id"] = 239,
            ["image"] = 608225,
            ["name"] = "奧達曼",
            ["bosses"] = {
                {
                    ["id"] = 467,
                    ["image"] = 607757,
                    ["name"] = "魯維羅什",
                }, -- [1]
                {
                    ["id"] = 468,
                    ["image"] = 607550,
                    ["name"] = "失落的矮人",
                }, -- [2]
                {
                    ["id"] = 469,
                    ["image"] = 607664,
                    ["name"] = "艾隆納亞",
                }, -- [3]
                {
                    ["id"] = 748,
                    ["image"] = 607729,
                    ["name"] = "黑曜石哨兵",
                }, -- [4]
                {
                    ["id"] = 470,
                    ["image"] = 607538,
                    ["name"] = "上古石之守衛者",
                }, -- [5]
                {
                    ["id"] = 471,
                    ["image"] = 607606,
                    ["name"] = "加加恩‧火錘",
                }, -- [6]
                {
                    ["id"] = 472,
                    ["image"] = 607626,
                    ["name"] = "格瑞姆洛克",
                }, -- [7]
                {
                    ["id"] = 473,
                    ["image"] = 607546,
                    ["name"] = "阿札達斯",
                }, -- [8]
            },
        }, -- [9]
        {
            ["id"] = 64,
            ["image"] = 522358,
            ["name"] = "影牙城堡",
            ["bosses"] = {
                {
                    ["id"] = 96,
                    ["image"] = 522205,
                    ["name"] = "艾胥柏利男爵",
                }, -- [1]
                {
                    ["id"] = 97,
                    ["image"] = 522206,
                    ["name"] = "席瓦萊恩男爵",
                }, -- [2]
                {
                    ["id"] = 98,
                    ["image"] = 522213,
                    ["name"] = "指揮官斯普林瓦爾",
                }, -- [3]
                {
                    ["id"] = 99,
                    ["image"] = 522249,
                    ["name"] = "瓦爾登領主",
                }, -- [4]
                {
                    ["id"] = 100,
                    ["image"] = 522247,
                    ["name"] = "高佛雷領主",
                }, -- [5]
            },
        }, -- [10]
        {
            ["id"] = 226,
            ["image"] = 608211,
            ["name"] = "怒焰裂谷",
            ["bosses"] = {
                {
                    ["id"] = 694,
                    ["image"] = 608309,
                    ["name"] = "阿達洛葛",
                }, -- [1]
                {
                    ["id"] = 695,
                    ["image"] = 608310,
                    ["name"] = "黑暗薩滿坷蘭索",
                }, -- [2]
                {
                    ["id"] = 696,
                    ["image"] = 522251,
                    ["name"] = "斯納格瑪",
                }, -- [3]
                {
                    ["id"] = 697,
                    ["image"] = 608315,
                    ["name"] = "熔岩守衛哥爾多斯",
                }, -- [4]
            },
        }, -- [11]
        {
            ["id"] = 236,
            ["image"] = 608216,
            ["name"] = "斯坦索姆",
            ["bosses"] = {
                {
                    ["id"] = 443,
                    ["image"] = 607637,
                    ["name"] = "爐邊歌手弗瑞斯坦",
                }, -- [1]
                {
                    ["id"] = 445,
                    ["image"] = 607795,
                    ["name"] = "殘忍的提米",
                }, -- [2]
                {
                    ["id"] = 749,
                    ["image"] = 607569,
                    ["name"] = "指揮官瑪洛爾",
                }, -- [3]
                {
                    ["id"] = 446,
                    ["image"] = 607818,
                    ["name"] = "威利‧希望破除者",
                }, -- [4]
                {
                    ["id"] = 448,
                    ["image"] = 607660,
                    ["name"] = "古卷管理者加爾福特",
                }, -- [5]
                {
                    ["id"] = 449,
                    ["image"] = 607551,
                    ["name"] = "巴納札爾",
                }, -- [6]
                {
                    ["id"] = 450,
                    ["image"] = 607792,
                    ["name"] = "不可寬恕者",
                }, -- [7]
                {
                    ["id"] = 451,
                    ["image"] = 607553,
                    ["name"] = "安娜絲塔麗男爵夫人",
                }, -- [8]
                {
                    ["id"] = 452,
                    ["image"] = 607724,
                    ["name"] = "奈幽布恩坎",
                }, -- [9]
                {
                    ["id"] = 453,
                    ["image"] = 607707,
                    ["name"] = "蒼白的瑪勒基",
                }, -- [10]
                {
                    ["id"] = 454,
                    ["image"] = 607791,
                    ["name"] = "巴瑟拉斯鎮長",
                }, -- [11]
                {
                    ["id"] = 455,
                    ["image"] = 607752,
                    ["name"] = "『暴食者』拉姆斯登",
                }, -- [12]
                {
                    ["id"] = 456,
                    ["image"] = 607692,
                    ["name"] = "奧里爾斯‧瑞文戴爾領主",
                }, -- [13]
            },
        }, -- [12]
        {
            ["id"] = 63,
            ["image"] = 522352,
            ["name"] = "死亡礦坑",
            ["bosses"] = {
                {
                    ["id"] = 89,
                    ["image"] = 522228,
                    ["name"] = "格魯巴托克",
                }, -- [1]
                {
                    ["id"] = 90,
                    ["image"] = 522234,
                    ["name"] = "赫利克斯‧碎輪者",
                }, -- [2]
                {
                    ["id"] = 91,
                    ["image"] = 522225,
                    ["name"] = "敵人收割者5000型",
                }, -- [3]
                {
                    ["id"] = 92,
                    ["image"] = 522189,
                    ["name"] = "利普斯納爾上將",
                }, -- [4]
                {
                    ["id"] = 93,
                    ["image"] = 522210,
                    ["name"] = "『船長』餅乾",
                }, -- [5]
            },
        }, -- [13]
        {
            ["id"] = 232,
            ["image"] = 608209,
            ["name"] = "瑪拉頓",
            ["bosses"] = {
                {
                    ["id"] = 423,
                    ["image"] = 607728,
                    ["name"] = "諾克賽恩",
                }, -- [1]
                {
                    ["id"] = 424,
                    ["image"] = 607756,
                    ["name"] = "銳刺鞭笞者",
                }, -- [2]
                {
                    ["id"] = 425,
                    ["image"] = 607796,
                    ["name"] = "技工吉茲洛克",
                }, -- [3]
                {
                    ["id"] = 427,
                    ["image"] = 607699,
                    ["name"] = "維利塔恩領主",
                }, -- [4]
                {
                    ["id"] = 428,
                    ["image"] = 607562,
                    ["name"] = "被詛咒的塞雷布拉斯",
                }, -- [5]
                {
                    ["id"] = 429,
                    ["image"] = 607684,
                    ["name"] = "蘭斯利德",
                }, -- [6]
                {
                    ["id"] = 430,
                    ["image"] = 607761,
                    ["name"] = "洛特格里普",
                }, -- [7]
                {
                    ["id"] = 431,
                    ["image"] = 607747,
                    ["name"] = "瑟萊德絲公主",
                }, -- [8]
            },
        }, -- [14]
        {
            ["id"] = 238,
            ["image"] = 608223,
            ["name"] = "監獄",
            ["bosses"] = {
                {
                    ["id"] = 464,
                    ["image"] = 4776138,
                    ["name"] = "霍格",
                }, -- [1]
                {
                    ["id"] = 465,
                    ["image"] = 607695,
                    ["name"] = "歐玻西特王",
                }, -- [2]
                {
                    ["id"] = 466,
                    ["image"] = 607753,
                    ["name"] = "藍道夫‧摩洛克",
                }, -- [3]
            },
        }, -- [15]
        {
            ["id"] = 241,
            ["image"] = 608230,
            ["name"] = "祖爾法拉克",
            ["bosses"] = {
                {
                    ["id"] = 483,
                    ["image"] = 607614,
                    ["name"] = "加茲瑞拉",
                }, -- [1]
                {
                    ["id"] = 484,
                    ["image"] = 607541,
                    ["name"] = "安圖蘇爾",
                }, -- [2]
                {
                    ["id"] = 485,
                    ["image"] = 607793,
                    ["name"] = "『殉教者』塞卡",
                }, -- [3]
                {
                    ["id"] = 486,
                    ["image"] = 607819,
                    ["name"] = "巫醫祖穆拉恩",
                }, -- [4]
                {
                    ["id"] = 487,
                    ["image"] = 607723,
                    ["name"] = "耐克倫&塞瑟斯",
                }, -- [5]
                {
                    ["id"] = 489,
                    ["image"] = 607564,
                    ["name"] = "烏克茲‧沙頂",
                }, -- [6]
            },
        }, -- [16]
        {
            ["id"] = 316,
            ["image"] = 608214,
            ["name"] = "血色修道院",
            ["bosses"] = {
                {
                    ["id"] = 688,
                    ["image"] = 630853,
                    ["name"] = "『靈魂撕裂者』薩爾諾斯",
                }, -- [1]
                {
                    ["id"] = 671,
                    ["image"] = 630818,
                    ["name"] = "克羅夫修士",
                }, -- [2]
                {
                    ["id"] = 674,
                    ["image"] = 607643,
                    ["name"] = "高階審判官懷特邁恩",
                }, -- [3]
            },
        }, -- [17]
        {
            ["id"] = 311,
            ["image"] = 643262,
            ["name"] = "血色大廳",
            ["bosses"] = {
                {
                    ["id"] = 660,
                    ["image"] = 630833,
                    ["name"] = "馴犬者布勞恩",
                }, -- [1]
                {
                    ["id"] = 654,
                    ["image"] = 630816,
                    ["name"] = "武器大師哈倫",
                }, -- [2]
                {
                    ["id"] = 656,
                    ["image"] = 630825,
                    ["name"] = "織焰者喀格勒",
                }, -- [3]
            },
        }, -- [18]
        {
            ["id"] = 231,
            ["image"] = 608202,
            ["name"] = "諾姆瑞根",
            ["bosses"] = {
                {
                    ["id"] = 419,
                    ["image"] = 607628,
                    ["name"] = "格魯比斯",
                }, -- [1]
                {
                    ["id"] = 420,
                    ["image"] = 607808,
                    ["name"] = "黏性輻射塵",
                }, -- [2]
                {
                    ["id"] = 421,
                    ["image"] = 607594,
                    ["name"] = "電刑器6000型",
                }, -- [3]
                {
                    ["id"] = 418,
                    ["image"] = 607572,
                    ["name"] = "群體打擊者9-60",
                }, -- [4]
                {
                    ["id"] = 422,
                    ["image"] = 607714,
                    ["name"] = "機電師瑟瑪普拉格",
                }, -- [5]
            },
        }, -- [19]
        {
            ["id"] = 246,
            ["image"] = 608215,
            ["name"] = "通靈學院",
            ["bosses"] = {
                {
                    ["id"] = 659,
                    ["image"] = 630835,
                    ["name"] = "講師冷心",
                }, -- [1]
                {
                    ["id"] = 663,
                    ["image"] = 607666,
                    ["name"] = "詹迪斯‧巴羅夫",
                }, -- [2]
                {
                    ["id"] = 665,
                    ["image"] = 607755,
                    ["name"] = "血骨傀儡",
                }, -- [3]
                {
                    ["id"] = 666,
                    ["image"] = 630838,
                    ["name"] = "莉莉安‧佛斯",
                }, -- [4]
                {
                    ["id"] = 684,
                    ["image"] = 607582,
                    ["name"] = "黑暗院長加丁",
                }, -- [5]
            },
        }, -- [20]
        {
            ["id"] = 237,
            ["image"] = 608217,
            ["name"] = "阿塔哈卡神廟",
            ["bosses"] = {
                {
                    ["id"] = 457,
                    ["image"] = 607548,
                    ["name"] = "哈卡的化身",
                }, -- [1]
                {
                    ["id"] = 458,
                    ["image"] = 607665,
                    ["name"] = "『預言者』迦瑪蘭",
                }, -- [2]
                {
                    ["id"] = 459,
                    ["image"] = 608311,
                    ["name"] = "夢境看守者",
                }, -- [3]
                {
                    ["id"] = 463,
                    ["image"] = 607768,
                    ["name"] = "伊蘭尼庫斯之影",
                }, -- [4]
            },
        }, -- [21]
        {
            ["id"] = 227,
            ["image"] = 608195,
            ["name"] = "黑澗深淵",
            ["bosses"] = {
                {
                    ["id"] = 368,
                    ["image"] = 1064179,
                    ["name"] = "加摩拉",
                }, -- [1]
                {
                    ["id"] = 436,
                    ["image"] = 1064180,
                    ["name"] = "朵米娜",
                }, -- [2]
                {
                    ["id"] = 426,
                    ["image"] = 522214,
                    ["name"] = "征服者寇烏爾",
                }, -- [3]
                {
                    ["id"] = 1145,
                    ["image"] = 1064181,
                    ["name"] = "瑟拉克",
                }, -- [4]
                {
                    ["id"] = 447,
                    ["image"] = 1064182,
                    ["name"] = "深淵守護者",
                }, -- [5]
                {
                    ["id"] = 1144,
                    ["image"] = 1064183,
                    ["name"] = "處決者戈爾",
                }, -- [6]
                {
                    ["id"] = 437,
                    ["image"] = 1064184,
                    ["name"] = "暮光領主巴賽爾",
                }, -- [7]
                {
                    ["id"] = 444,
                    ["image"] = 607532,
                    ["name"] = "阿庫麥爾",
                }, -- [8]
            },
        }, -- [22]
        {
            ["id"] = 229,
            ["image"] = 608197,
            ["name"] = "黑石塔下層",
            ["bosses"] = {
                {
                    ["id"] = 388,
                    ["image"] = 607645,
                    ["name"] = "歐莫克大王",
                }, -- [1]
                {
                    ["id"] = 389,
                    ["image"] = 607769,
                    ["name"] = "暗影獵手沃許加斯",
                }, -- [2]
                {
                    ["id"] = 390,
                    ["image"] = 607810,
                    ["name"] = "將領沃恩",
                }, -- [3]
                {
                    ["id"] = 391,
                    ["image"] = 607719,
                    ["name"] = "煙網蛛后",
                }, -- [4]
                {
                    ["id"] = 392,
                    ["image"] = 607801,
                    ["name"] = "烏洛克‧末日嚎",
                }, -- [5]
                {
                    ["id"] = 393,
                    ["image"] = 607751,
                    ["name"] = "軍需官茲格雷斯",
                }, -- [6]
                {
                    ["id"] = 394,
                    ["image"] = 607634,
                    ["name"] = "哈雷肯",
                }, -- [7]
                {
                    ["id"] = 395,
                    ["image"] = 607615,
                    ["name"] = "『奴役者』基茲盧爾",
                }, -- [8]
                {
                    ["id"] = 396,
                    ["image"] = 607737,
                    ["name"] = "維姆薩拉克主宰",
                }, -- [9]
            },
        }, -- [23]
        {
            ["id"] = 228,
            ["image"] = 608196,
            ["name"] = "黑石深淵",
            ["bosses"] = {
                {
                    ["id"] = 369,
                    ["image"] = 607644,
                    ["name"] = "高階審問者格斯塔恩",
                }, -- [1]
                {
                    ["id"] = 370,
                    ["image"] = 607697,
                    ["name"] = "洛考爾領主",
                }, -- [2]
                {
                    ["id"] = 371,
                    ["image"] = 607647,
                    ["name"] = "馴犬者格雷布瑪爾",
                }, -- [3]
                {
                    ["id"] = 372,
                    ["image"] = 608314,
                    ["name"] = "秩序競技場",
                }, -- [4]
                {
                    ["id"] = 373,
                    ["image"] = 607749,
                    ["name"] = "火占師羅格雷恩",
                }, -- [5]
                {
                    ["id"] = 374,
                    ["image"] = 607694,
                    ["name"] = "伊森迪奧斯領主",
                }, -- [6]
                {
                    ["id"] = 375,
                    ["image"] = 607814,
                    ["name"] = "護衛斯迪爾基斯",
                }, -- [7]
                {
                    ["id"] = 376,
                    ["image"] = 607602,
                    ["name"] = "弗諾斯‧達克維爾",
                }, -- [8]
                {
                    ["id"] = 377,
                    ["image"] = 607549,
                    ["name"] = "貝爾加",
                }, -- [9]
                {
                    ["id"] = 378,
                    ["image"] = 607610,
                    ["name"] = "安格弗將軍",
                }, -- [10]
                {
                    ["id"] = 379,
                    ["image"] = 607618,
                    ["name"] = "魔像領主阿格曼奇",
                }, -- [11]
                {
                    ["id"] = 380,
                    ["image"] = 607650,
                    ["name"] = "霍爾雷‧黑息",
                }, -- [12]
                {
                    ["id"] = 381,
                    ["image"] = 607740,
                    ["name"] = "法拉克斯",
                }, -- [13]
                {
                    ["id"] = 383,
                    ["image"] = 607741,
                    ["name"] = "普拉格‧史帕齊林",
                }, -- [14]
                {
                    ["id"] = 384,
                    ["image"] = 607535,
                    ["name"] = "弗萊拉斯大使",
                }, -- [15]
                {
                    ["id"] = 385,
                    ["image"] = 607587,
                    ["name"] = "七賢",
                }, -- [16]
                {
                    ["id"] = 386,
                    ["image"] = 607705,
                    ["name"] = "瑪格姆斯",
                }, -- [17]
                {
                    ["id"] = 387,
                    ["image"] = 607595,
                    ["name"] = "達格蘭‧索瑞森大帝",
                }, -- [18]
            },
        }, -- [24]
    },
    ["軍臨天下"] = {
        {
            ["id"] = 822,
            ["image"] = 1411854,
            ["name"] = "破碎群島",
            ["bosses"] = {
                {
                    ["id"] = 1790,
                    ["image"] = 1411023,
                    ["name"] = "亞娜慕茲",
                }, -- [1]
                {
                    ["id"] = 1956,
                    ["image"] = 1134499,
                    ["name"] = "亞破克隆",
                }, -- [2]
                {
                    ["id"] = 1883,
                    ["image"] = 1385722,
                    ["name"] = "布魯托魯斯",
                }, -- [3]
                {
                    ["id"] = 1774,
                    ["image"] = 1411024,
                    ["name"] = "卡拉米爾",
                }, -- [4]
                {
                    ["id"] = 1789,
                    ["image"] = 1411025,
                    ["name"] = "『霜血』督剛",
                }, -- [5]
                {
                    ["id"] = 1795,
                    ["image"] = 1472454,
                    ["name"] = "弗洛山",
                }, -- [6]
                {
                    ["id"] = 1770,
                    ["image"] = 1411026,
                    ["name"] = "休蒙格里斯",
                }, -- [7]
                {
                    ["id"] = 1769,
                    ["image"] = 1411027,
                    ["name"] = "利薇妲絲",
                }, -- [8]
                {
                    ["id"] = 1884,
                    ["image"] = 1579937,
                    ["name"] = "梅里費克斯",
                }, -- [9]
                {
                    ["id"] = 1783,
                    ["image"] = 1411028,
                    ["name"] = "惡魔納札卡",
                }, -- [10]
                {
                    ["id"] = 1749,
                    ["image"] = 1411029,
                    ["name"] = "尼索格",
                }, -- [11]
                {
                    ["id"] = 1763,
                    ["image"] = 1411030,
                    ["name"] = "薩索斯",
                }, -- [12]
                {
                    ["id"] = 1885,
                    ["image"] = 1579941,
                    ["name"] = "希娃旭",
                }, -- [13]
                {
                    ["id"] = 1756,
                    ["image"] = 1411031,
                    ["name"] = "奪魂者",
                }, -- [14]
                {
                    ["id"] = 1796,
                    ["image"] = 1472455,
                    ["name"] = "凋萎者吉姆",
                }, -- [15]
            },
        }, -- [1]
        {
            ["id"] = 768,
            ["image"] = 1452687,
            ["name"] = "翡翠夢魘",
            ["bosses"] = {
                {
                    ["id"] = 1703,
                    ["image"] = 1410972,
                    ["name"] = "奈珊卓拉",
                }, -- [1]
                {
                    ["id"] = 1738,
                    ["image"] = 1410960,
                    ["name"] = "『腐化之心』伊蓋諾斯",
                }, -- [2]
                {
                    ["id"] = 1744,
                    ["image"] = 1410947,
                    ["name"] = "艾樂瑞斯‧雷弗拉爾",
                }, -- [3]
                {
                    ["id"] = 1667,
                    ["image"] = 1410991,
                    ["name"] = "厄索克",
                }, -- [4]
                {
                    ["id"] = 1704,
                    ["image"] = 1410945,
                    ["name"] = "夢魘之龍",
                }, -- [5]
                {
                    ["id"] = 1750,
                    ["image"] = 1410940,
                    ["name"] = "塞納留斯",
                }, -- [6]
                {
                    ["id"] = 1726,
                    ["image"] = 1410994,
                    ["name"] = "薩維斯",
                }, -- [7]
            },
        }, -- [2]
        {
            ["id"] = 861,
            ["image"] = 1537284,
            ["name"] = "勇氣試煉",
            ["bosses"] = {
                {
                    ["id"] = 1819,
                    ["image"] = 1410974,
                    ["name"] = "歐丁",
                }, -- [1]
                {
                    ["id"] = 1830,
                    ["image"] = 1536491,
                    ["name"] = "加爾姆",
                }, -- [2]
                {
                    ["id"] = 1829,
                    ["image"] = 1410957,
                    ["name"] = "黑爾雅",
                }, -- [3]
            },
        }, -- [3]
        {
            ["id"] = 786,
            ["image"] = 1450575,
            ["name"] = "暗夜堡",
            ["bosses"] = {
                {
                    ["id"] = 1706,
                    ["image"] = 1410981,
                    ["name"] = "斯寇派隆",
                }, -- [1]
                {
                    ["id"] = 1725,
                    ["image"] = 1410941,
                    ["name"] = "時光異象",
                }, -- [2]
                {
                    ["id"] = 1731,
                    ["image"] = 1410989,
                    ["name"] = "提里埃斯",
                }, -- [3]
                {
                    ["id"] = 1751,
                    ["image"] = 1410983,
                    ["name"] = "法刃艾露莉亞",
                }, -- [4]
                {
                    ["id"] = 1762,
                    ["image"] = 1410987,
                    ["name"] = "提克迪奧斯",
                }, -- [5]
                {
                    ["id"] = 1713,
                    ["image"] = 1410965,
                    ["name"] = "克羅索斯",
                }, -- [6]
                {
                    ["id"] = 1761,
                    ["image"] = 1410939,
                    ["name"] = "大植物學家泰亞恩",
                }, -- [7]
                {
                    ["id"] = 1732,
                    ["image"] = 1410984,
                    ["name"] = "星占師伊崔斯",
                }, -- [8]
                {
                    ["id"] = 1743,
                    ["image"] = 1410954,
                    ["name"] = "大博學者艾莉珊德",
                }, -- [9]
                {
                    ["id"] = 1737,
                    ["image"] = 1410955,
                    ["name"] = "古爾丹",
                }, -- [10]
            },
        }, -- [4]
        {
            ["id"] = 875,
            ["image"] = 1616106,
            ["name"] = "薩格拉斯之墓",
            ["bosses"] = {
                {
                    ["id"] = 1862,
                    ["image"] = 1579934,
                    ["name"] = "苟洛斯",
                }, -- [1]
                {
                    ["id"] = 1867,
                    ["image"] = 1579936,
                    ["name"] = "惡魔審判官",
                }, -- [2]
                {
                    ["id"] = 1856,
                    ["image"] = 1579940,
                    ["name"] = "哈亞潭",
                }, -- [3]
                {
                    ["id"] = 1903,
                    ["image"] = 1579935,
                    ["name"] = "月光議會",
                }, -- [4]
                {
                    ["id"] = 1861,
                    ["image"] = 1579939,
                    ["name"] = "薩絲茵女士",
                }, -- [5]
                {
                    ["id"] = 1896,
                    ["image"] = 1579943,
                    ["name"] = "荒寂聚合體",
                }, -- [6]
                {
                    ["id"] = 1897,
                    ["image"] = 1579933,
                    ["name"] = "戒守聖女",
                }, -- [7]
                {
                    ["id"] = 1873,
                    ["image"] = 1579932,
                    ["name"] = "墮落化身",
                }, -- [8]
                {
                    ["id"] = 1898,
                    ["image"] = 1385746,
                    ["name"] = "基爾加丹",
                }, -- [9]
            },
        }, -- [5]
        {
            ["id"] = 959,
            ["image"] = 1718212,
            ["name"] = "侵略點",
            ["bosses"] = {
                {
                    ["id"] = 2010,
                    ["image"] = 1715215,
                    ["name"] = "鬼母佛努娜",
                }, -- [1]
                {
                    ["id"] = 2011,
                    ["image"] = 1715216,
                    ["name"] = "魔女雅露拉黛兒",
                }, -- [2]
                {
                    ["id"] = 2012,
                    ["image"] = 1715212,
                    ["name"] = "審判官梅托",
                }, -- [3]
                {
                    ["id"] = 2013,
                    ["image"] = 1715217,
                    ["name"] = "歐庫雷洛斯",
                }, -- [4]
                {
                    ["id"] = 2014,
                    ["image"] = 1715221,
                    ["name"] = "梭塔納索",
                }, -- [5]
                {
                    ["id"] = 2015,
                    ["image"] = 1715218,
                    ["name"] = "深淵領主邪莫斯",
                }, -- [6]
            },
        }, -- [6]
        {
            ["id"] = 946,
            ["image"] = 1718211,
            ["name"] = "安托洛斯，燃燒王座",
            ["bosses"] = {
                {
                    ["id"] = 1992,
                    ["image"] = 1715210,
                    ["name"] = "加洛斯碎界者",
                }, -- [1]
                {
                    ["id"] = 1987,
                    ["image"] = 1715209,
                    ["name"] = "薩格拉斯惡魔犬",
                }, -- [2]
                {
                    ["id"] = 1997,
                    ["image"] = 1715225,
                    ["name"] = "安托洛斯至高戰事議會",
                }, -- [3]
                {
                    ["id"] = 1985,
                    ["image"] = 1715219,
                    ["name"] = "『守門者』海瑟貝爾",
                }, -- [4]
                {
                    ["id"] = 2025,
                    ["image"] = 1715208,
                    ["name"] = "『生命守縛者』伊歐娜",
                }, -- [5]
                {
                    ["id"] = 2009,
                    ["image"] = 1715211,
                    ["name"] = "『獵魂者』伊莫納爾",
                }, -- [6]
                {
                    ["id"] = 2004,
                    ["image"] = 1715213,
                    ["name"] = "金加洛斯",
                }, -- [7]
                {
                    ["id"] = 1983,
                    ["image"] = 1715223,
                    ["name"] = "瓦里瑪薩斯",
                }, -- [8]
                {
                    ["id"] = 1986,
                    ["image"] = 1715222,
                    ["name"] = "希瓦拉巫女",
                }, -- [9]
                {
                    ["id"] = 1984,
                    ["image"] = 1715207,
                    ["name"] = "阿格拉瑪",
                }, -- [10]
                {
                    ["id"] = 2031,
                    ["image"] = 1715536,
                    ["name"] = "『滅界者』阿古斯",
                }, -- [11]
            },
        }, -- [7]
        {
            ["id"] = 945,
            ["image"] = 1718213,
            ["name"] = "三傑議會之座",
            ["bosses"] = {
                {
                    ["id"] = 1979,
                    ["image"] = 1715226,
                    ["name"] = "『超凡者』祖拉爾",
                }, -- [1]
                {
                    ["id"] = 1980,
                    ["image"] = 1715220,
                    ["name"] = "賽普瑞許",
                }, -- [2]
                {
                    ["id"] = 1981,
                    ["image"] = 1715224,
                    ["name"] = "副將聶薩",
                }, -- [3]
                {
                    ["id"] = 1982,
                    ["image"] = 1715214,
                    ["name"] = "路拉",
                }, -- [4]
            },
        }, -- [8]
        {
            ["id"] = 767,
            ["image"] = 1450574,
            ["name"] = "奈薩里奧巢穴",
            ["bosses"] = {
                {
                    ["id"] = 1662,
                    ["image"] = 1410976,
                    ["name"] = "羅克摩拉",
                }, -- [1]
                {
                    ["id"] = 1665,
                    ["image"] = 1410990,
                    ["name"] = "烏拉羅格‧塑崖者",
                }, -- [2]
                {
                    ["id"] = 1673,
                    ["image"] = 1410971,
                    ["name"] = "納拉薩斯",
                }, -- [3]
                {
                    ["id"] = 1687,
                    ["image"] = 1410944,
                    ["name"] = "『地底之王』達古爾",
                }, -- [4]
            },
        }, -- [9]
        {
            ["id"] = 726,
            ["image"] = 1411857,
            ["name"] = "幽暗地道",
            ["bosses"] = {
                {
                    ["id"] = 1497,
                    ["image"] = 1410963,
                    ["name"] = "伊凡爾",
                }, -- [1]
                {
                    ["id"] = 1498,
                    ["image"] = 1410943,
                    ["name"] = "寇斯提拉斯",
                }, -- [2]
                {
                    ["id"] = 1499,
                    ["image"] = 1410951,
                    ["name"] = "薩卡爾將軍",
                }, -- [3]
                {
                    ["id"] = 1500,
                    ["image"] = 1410970,
                    ["name"] = "納爾提拉",
                }, -- [4]
                {
                    ["id"] = 1501,
                    ["image"] = 1410934,
                    ["name"] = "諫言者凡卓斯",
                }, -- [5]
            },
        }, -- [10]
        {
            ["id"] = 762,
            ["image"] = 1411855,
            ["name"] = "暗心灌木林",
            ["bosses"] = {
                {
                    ["id"] = 1654,
                    ["image"] = 1410936,
                    ["name"] = "大德魯伊葛萊達利斯",
                }, -- [1]
                {
                    ["id"] = 1655,
                    ["image"] = 1410973,
                    ["name"] = "橡心",
                }, -- [2]
                {
                    ["id"] = 1656,
                    ["image"] = 1410946,
                    ["name"] = "德瑞薩隆",
                }, -- [3]
                {
                    ["id"] = 1657,
                    ["image"] = 1410979,
                    ["name"] = "薩維斯之影",
                }, -- [4]
            },
        }, -- [11]
        {
            ["id"] = 900,
            ["image"] = 1616922,
            ["name"] = "永夜聖殿",
            ["bosses"] = {
                {
                    ["id"] = 1905,
                    ["image"] = 1579930,
                    ["name"] = "阿格諾斯",
                }, -- [1]
                {
                    ["id"] = 1906,
                    ["image"] = 1579942,
                    ["name"] = "『厭惡者』痛咬",
                }, -- [2]
                {
                    ["id"] = 1904,
                    ["image"] = 1579931,
                    ["name"] = "多瑪崔斯",
                }, -- [3]
                {
                    ["id"] = 1878,
                    ["image"] = 1579938,
                    ["name"] = "梅菲斯托",
                }, -- [4]
            },
        }, -- [12]
        {
            ["id"] = 740,
            ["image"] = 1411853,
            ["name"] = "玄鴉堡",
            ["bosses"] = {
                {
                    ["id"] = 1518,
                    ["image"] = 1410986,
                    ["name"] = "眾魂融合體",
                }, -- [1]
                {
                    ["id"] = 1653,
                    ["image"] = 1410961,
                    ["name"] = "伊麗珊娜‧黑羽",
                }, -- [2]
                {
                    ["id"] = 1664,
                    ["image"] = 1410982,
                    ["name"] = "『憎恨者』惡擊",
                }, -- [3]
                {
                    ["id"] = 1672,
                    ["image"] = 1410967,
                    ["name"] = "克塔羅斯‧黑羽堡主",
                }, -- [4]
            },
        }, -- [13]
        {
            ["id"] = 707,
            ["image"] = 1411858,
            ["name"] = "看守者鐵獄",
            ["bosses"] = {
                {
                    ["id"] = 1467,
                    ["image"] = 1410988,
                    ["name"] = "泰拉松‧薩瑟里",
                }, -- [1]
                {
                    ["id"] = 1695,
                    ["image"] = 1410962,
                    ["name"] = "酷刑審判官",
                }, -- [2]
                {
                    ["id"] = 1468,
                    ["image"] = 1410937,
                    ["name"] = "艾胥貢",
                }, -- [3]
                {
                    ["id"] = 1469,
                    ["image"] = 1410952,
                    ["name"] = "格雷瑟",
                }, -- [4]
                {
                    ["id"] = 1470,
                    ["image"] = 1410942,
                    ["name"] = "寇達娜‧魔歌",
                }, -- [5]
            },
        }, -- [14]
        {
            ["id"] = 800,
            ["image"] = 1498156,
            ["name"] = "眾星之廷",
            ["bosses"] = {
                {
                    ["id"] = 1718,
                    ["image"] = 1410975,
                    ["name"] = "巡邏隊長葛陀",
                }, -- [1]
                {
                    ["id"] = 1719,
                    ["image"] = 1410985,
                    ["name"] = "塔莉仙‧火冠",
                }, -- [2]
                {
                    ["id"] = 1720,
                    ["image"] = 1410933,
                    ["name"] = "諫言者梅朗卓斯",
                }, -- [3]
            },
        }, -- [15]
        {
            ["id"] = 777,
            ["image"] = 1498155,
            ["name"] = "紫羅蘭堡之襲",
            ["bosses"] = {
                {
                    ["id"] = 1693,
                    ["image"] = 1410950,
                    ["name"] = "膿臉",
                }, -- [1]
                {
                    ["id"] = 1694,
                    ["image"] = 1410980,
                    ["name"] = "顫喉",
                }, -- [2]
                {
                    ["id"] = 1702,
                    ["image"] = 1410938,
                    ["name"] = "血腥公主薩蕾娜",
                }, -- [3]
                {
                    ["id"] = 1686,
                    ["image"] = 1410969,
                    ["name"] = "笞靈者卡哈杰",
                }, -- [4]
                {
                    ["id"] = 1688,
                    ["image"] = 1410968,
                    ["name"] = "米歐菲瑟‧曼納斯頓",
                }, -- [5]
                {
                    ["id"] = 1696,
                    ["image"] = 1410935,
                    ["name"] = "阿努貝賽特",
                }, -- [6]
                {
                    ["id"] = 1697,
                    ["image"] = 1410977,
                    ["name"] = "賽蘿恩",
                }, -- [7]
                {
                    ["id"] = 1711,
                    ["image"] = 1410948,
                    ["name"] = "惡魔領主貝楚格",
                }, -- [8]
            },
        }, -- [16]
        {
            ["id"] = 716,
            ["image"] = 1498157,
            ["name"] = "艾薩拉之眼",
            ["bosses"] = {
                {
                    ["id"] = 1480,
                    ["image"] = 1410992,
                    ["name"] = "督軍帕傑許",
                }, -- [1]
                {
                    ["id"] = 1490,
                    ["image"] = 1410966,
                    ["name"] = "盤恨女士",
                }, -- [2]
                {
                    ["id"] = 1491,
                    ["image"] = 1410964,
                    ["name"] = "深鬍子大王",
                }, -- [3]
                {
                    ["id"] = 1479,
                    ["image"] = 1410978,
                    ["name"] = "巨鱗蛇",
                }, -- [4]
                {
                    ["id"] = 1492,
                    ["image"] = 1410993,
                    ["name"] = "艾薩拉之怒",
                }, -- [5]
            },
        }, -- [17]
        {
            ["id"] = 721,
            ["image"] = 1498158,
            ["name"] = "英靈殿",
            ["bosses"] = {
                {
                    ["id"] = 1485,
                    ["image"] = 1410958,
                    ["name"] = "海姆達爾",
                }, -- [1]
                {
                    ["id"] = 1486,
                    ["image"] = 1410959,
                    ["name"] = "海爾珈",
                }, -- [2]
                {
                    ["id"] = 1487,
                    ["image"] = 1410949,
                    ["name"] = "芬里爾",
                }, -- [3]
                {
                    ["id"] = 1488,
                    ["image"] = 1410953,
                    ["name"] = "神御之王斯寇瓦德",
                }, -- [4]
                {
                    ["id"] = 1489,
                    ["image"] = 1410974,
                    ["name"] = "歐丁",
                }, -- [5]
            },
        }, -- [18]
        {
            ["id"] = 860,
            ["image"] = 1537283,
            ["name"] = "重返卡拉贊",
            ["bosses"] = {
                {
                    ["id"] = 1820,
                    ["image"] = 1536495,
                    ["name"] = "歌劇大廳：綠野巫蹤",
                }, -- [1]
                {
                    ["id"] = 1826,
                    ["image"] = 1536494,
                    ["name"] = "歌劇大廳：西荒故事",
                }, -- [2]
                {
                    ["id"] = 1827,
                    ["image"] = 1536493,
                    ["name"] = "歌劇大廳：美女與猛獸",
                }, -- [3]
                {
                    ["id"] = 1825,
                    ["image"] = 1378997,
                    ["name"] = "貞潔聖女",
                }, -- [4]
                {
                    ["id"] = 1835,
                    ["image"] = 1536490,
                    ["name"] = "獵人阿圖曼",
                }, -- [5]
                {
                    ["id"] = 1837,
                    ["image"] = 1378999,
                    ["name"] = "摩洛斯",
                }, -- [6]
                {
                    ["id"] = 1836,
                    ["image"] = 1379020,
                    ["name"] = "館長",
                }, -- [7]
                {
                    ["id"] = 1817,
                    ["image"] = 1536496,
                    ["name"] = "麥迪文之影",
                }, -- [8]
                {
                    ["id"] = 1818,
                    ["image"] = 1536492,
                    ["name"] = "法力吞噬者",
                }, -- [9]
                {
                    ["id"] = 1838,
                    ["image"] = 1536497,
                    ["name"] = "『監視者』維茲亞頓",
                }, -- [10]
            },
        }, -- [19]
        {
            ["id"] = 727,
            ["image"] = 1411856,
            ["name"] = "靈魂之喉",
            ["bosses"] = {
                {
                    ["id"] = 1502,
                    ["image"] = 1410995,
                    ["name"] = "『墮落之王』伊米倫",
                }, -- [1]
                {
                    ["id"] = 1512,
                    ["image"] = 1410956,
                    ["name"] = "赫柏隆",
                }, -- [2]
                {
                    ["id"] = 1663,
                    ["image"] = 1410957,
                    ["name"] = "黑爾雅",
                }, -- [3]
            },
        }, -- [20]
    },
    ["德拉諾之霸"] = {
        {
            ["id"] = 557,
            ["image"] = 1041995,
            ["name"] = "德拉諾",
            ["bosses"] = {
                {
                    ["id"] = 1291,
                    ["image"] = 1044483,
                    ["name"] = "『毀滅者』德羅夫",
                }, -- [1]
                {
                    ["id"] = 1211,
                    ["image"] = 1044371,
                    ["name"] = "『不朽者』塔爾納",
                }, -- [2]
                {
                    ["id"] = 1262,
                    ["image"] = 1044364,
                    ["name"] = "魯克馬爾",
                }, -- [3]
                {
                    ["id"] = 1452,
                    ["image"] = 1134508,
                    ["name"] = "至高領主卡札克",
                }, -- [4]
            },
        }, -- [1]
        {
            ["id"] = 477,
            ["image"] = 1041997,
            ["name"] = "天槌",
            ["bosses"] = {
                {
                    ["id"] = 1128,
                    ["image"] = 1044352,
                    ["name"] = "卡加斯‧刃拳",
                }, -- [1]
                {
                    ["id"] = 971,
                    ["image"] = 1044375,
                    ["name"] = "屠夫",
                }, -- [2]
                {
                    ["id"] = 1195,
                    ["image"] = 1044372,
                    ["name"] = "泰克塔",
                }, -- [3]
                {
                    ["id"] = 1196,
                    ["image"] = 1044342,
                    ["name"] = "綠蕨孢子巨人",
                }, -- [4]
                {
                    ["id"] = 1148,
                    ["image"] = 1044377,
                    ["name"] = "歐格隆雙胞胎",
                }, -- [5]
                {
                    ["id"] = 1153,
                    ["image"] = 1044343,
                    ["name"] = "寇拉夫",
                }, -- [6]
                {
                    ["id"] = 1197,
                    ["image"] = 1044349,
                    ["name"] = "統治者瑪爾戈克",
                }, -- [7]
            },
        }, -- [2]
        {
            ["id"] = 457,
            ["image"] = 1041993,
            ["name"] = "黑石鑄造場",
            ["bosses"] = {
                {
                    ["id"] = 1202,
                    ["image"] = 1044484,
                    ["name"] = "礦吞",
                }, -- [1]
                {
                    ["id"] = 1155,
                    ["image"] = 1044345,
                    ["name"] = "漢斯格爾和法蘭佐克",
                }, -- [2]
                {
                    ["id"] = 1122,
                    ["image"] = 1044338,
                    ["name"] = "獸王達馬克",
                }, -- [3]
                {
                    ["id"] = 1161,
                    ["image"] = 1044346,
                    ["name"] = "戈魯爾",
                }, -- [4]
                {
                    ["id"] = 1123,
                    ["image"] = 1044344,
                    ["name"] = "控火者卡格拉茲",
                }, -- [5]
                {
                    ["id"] = 1147,
                    ["image"] = 1044357,
                    ["name"] = "站長索加爾",
                }, -- [6]
                {
                    ["id"] = 1154,
                    ["image"] = 1044374,
                    ["name"] = "高爐",
                }, -- [7]
                {
                    ["id"] = 1162,
                    ["image"] = 1044353,
                    ["name"] = "克羅莫格",
                }, -- [8]
                {
                    ["id"] = 1203,
                    ["image"] = 1044350,
                    ["name"] = "鐵娘子軍",
                }, -- [9]
                {
                    ["id"] = 959,
                    ["image"] = 1044378,
                    ["name"] = "黑手",
                }, -- [10]
            },
        }, -- [3]
        {
            ["id"] = 669,
            ["image"] = 1135118,
            ["name"] = "地獄火堡壘",
            ["bosses"] = {
                {
                    ["id"] = 1426,
                    ["image"] = 1134502,
                    ["name"] = "地獄火突襲戰",
                }, -- [1]
                {
                    ["id"] = 1425,
                    ["image"] = 1134499,
                    ["name"] = "鋼鐵劫奪者",
                }, -- [2]
                {
                    ["id"] = 1392,
                    ["image"] = 1134504,
                    ["name"] = "寇姆洛克",
                }, -- [3]
                {
                    ["id"] = 1432,
                    ["image"] = 1134501,
                    ["name"] = "地獄火高階議會",
                }, -- [4]
                {
                    ["id"] = 1396,
                    ["image"] = 1134503,
                    ["name"] = "基爾羅格‧亡眼",
                }, -- [5]
                {
                    ["id"] = 1372,
                    ["image"] = 1134500,
                    ["name"] = "血魔",
                }, -- [6]
                {
                    ["id"] = 1433,
                    ["image"] = 1134506,
                    ["name"] = "暗影領主伊斯卡",
                }, -- [7]
                {
                    ["id"] = 1427,
                    ["image"] = 1134507,
                    ["name"] = "『永恆者』索奎薩爾",
                }, -- [8]
                {
                    ["id"] = 1391,
                    ["image"] = 1134498,
                    ["name"] = "惡魔領主札昆",
                }, -- [9]
                {
                    ["id"] = 1447,
                    ["image"] = 1134510,
                    ["name"] = "祖霍拉克",
                }, -- [10]
                {
                    ["id"] = 1394,
                    ["image"] = 1134509,
                    ["name"] = "女暴君維哈里",
                }, -- [11]
                {
                    ["id"] = 1395,
                    ["image"] = 1134505,
                    ["name"] = "瑪諾洛斯",
                }, -- [12]
                {
                    ["id"] = 1438,
                    ["image"] = 1134497,
                    ["name"] = "阿克蒙德",
                }, -- [13]
            },
        }, -- [4]
        {
            ["id"] = 547,
            ["image"] = 1041992,
            ["name"] = "奧齊頓",
            ["bosses"] = {
                {
                    ["id"] = 1185,
                    ["image"] = 1044336,
                    ["name"] = "警覺的卡薩爾",
                }, -- [1]
                {
                    ["id"] = 1186,
                    ["image"] = 1044370,
                    ["name"] = "縛魂者妮雅蜜",
                }, -- [2]
                {
                    ["id"] = 1216,
                    ["image"] = 1044337,
                    ["name"] = "阿扎克爾",
                }, -- [3]
                {
                    ["id"] = 1225,
                    ["image"] = 1044373,
                    ["name"] = "泰朗戈爾",
                }, -- [4]
            },
        }, -- [5]
        {
            ["id"] = 537,
            ["image"] = 1041998,
            ["name"] = "影月墓地",
            ["bosses"] = {
                {
                    ["id"] = 1139,
                    ["image"] = 1044366,
                    ["name"] = "莎妲娜‧血怒",
                }, -- [1]
                {
                    ["id"] = 1168,
                    ["image"] = 1053564,
                    ["name"] = "納里旭",
                }, -- [2]
                {
                    ["id"] = 1140,
                    ["image"] = 1044341,
                    ["name"] = "骨喉",
                }, -- [3]
                {
                    ["id"] = 1160,
                    ["image"] = 1044356,
                    ["name"] = "耐祖奧",
                }, -- [4]
            },
        }, -- [6]
        {
            ["id"] = 536,
            ["image"] = 1041996,
            ["name"] = "恐軌車站",
            ["bosses"] = {
                {
                    ["id"] = 1138,
                    ["image"] = 1044360,
                    ["name"] = "火箭光和波爾卡",
                }, -- [1]
                {
                    ["id"] = 1163,
                    ["image"] = 1044339,
                    ["name"] = "奈楚格‧雷塔",
                }, -- [2]
                {
                    ["id"] = 1133,
                    ["image"] = 1044376,
                    ["name"] = "傲天者托芙菈",
                }, -- [3]
            },
        }, -- [7]
        {
            ["id"] = 476,
            ["image"] = 1041999,
            ["name"] = "擎天峰",
            ["bosses"] = {
                {
                    ["id"] = 965,
                    ["image"] = 1044362,
                    ["name"] = "蘭吉特",
                }, -- [1]
                {
                    ["id"] = 966,
                    ["image"] = 1044334,
                    ["name"] = "阿拉卡納斯",
                }, -- [2]
                {
                    ["id"] = 967,
                    ["image"] = 1044365,
                    ["name"] = "盧克然",
                }, -- [3]
                {
                    ["id"] = 968,
                    ["image"] = 1044348,
                    ["name"] = "大賢者維瑞思",
                }, -- [4]
            },
        }, -- [8]
        {
            ["id"] = 556,
            ["image"] = 1060547,
            ["name"] = "永茂林",
            ["bosses"] = {
                {
                    ["id"] = 1214,
                    ["image"] = 1044381,
                    ["name"] = "枯木",
                }, -- [1]
                {
                    ["id"] = 1207,
                    ["image"] = 1053563,
                    ["name"] = "古樹保衛者",
                }, -- [2]
                {
                    ["id"] = 1208,
                    ["image"] = 1044335,
                    ["name"] = "大法師蘇兒",
                }, -- [3]
                {
                    ["id"] = 1209,
                    ["image"] = 1044382,
                    ["name"] = "榭里塔克",
                }, -- [4]
                {
                    ["id"] = 1210,
                    ["image"] = 1044383,
                    ["name"] = "亞爾努",
                }, -- [5]
            },
        }, -- [9]
        {
            ["id"] = 385,
            ["image"] = 1041994,
            ["name"] = "血槌熔渣礦場",
            ["bosses"] = {
                {
                    ["id"] = 893,
                    ["image"] = 1044355,
                    ["name"] = "瑪格默拉圖斯",
                }, -- [1]
                {
                    ["id"] = 888,
                    ["image"] = 1044368,
                    ["name"] = "奴隸看守者庫拉多",
                }, -- [2]
                {
                    ["id"] = 887,
                    ["image"] = 1044363,
                    ["name"] = "洛托爾",
                }, -- [3]
                {
                    ["id"] = 889,
                    ["image"] = 1044347,
                    ["name"] = "古格洛克",
                }, -- [4]
            },
        }, -- [10]
        {
            ["id"] = 558,
            ["image"] = 1060548,
            ["name"] = "鋼鐵碼頭",
            ["bosses"] = {
                {
                    ["id"] = 1235,
                    ["image"] = 1044380,
                    ["name"] = "『血肉撕裂者』諾加爾",
                }, -- [1]
                {
                    ["id"] = 1236,
                    ["image"] = 1044340,
                    ["name"] = "恐軌執行者",
                }, -- [2]
                {
                    ["id"] = 1237,
                    ["image"] = 1044359,
                    ["name"] = "歐席爾",
                }, -- [3]
                {
                    ["id"] = 1238,
                    ["image"] = 1044367,
                    ["name"] = "史庫洛克",
                }, -- [4]
            },
        }, -- [11]
        {
            ["id"] = 559,
            ["image"] = 1042000,
            ["name"] = "黑石塔上層",
            ["bosses"] = {
                {
                    ["id"] = 1226,
                    ["image"] = 1044358,
                    ["name"] = "控礦者古拉杉",
                }, -- [1]
                {
                    ["id"] = 1227,
                    ["image"] = 1044354,
                    ["name"] = "凱拉克",
                }, -- [2]
                {
                    ["id"] = 1228,
                    ["image"] = 1044351,
                    ["name"] = "指揮官薩貝克",
                }, -- [3]
                {
                    ["id"] = 1229,
                    ["image"] = 1044361,
                    ["name"] = "狂野的怒翼",
                }, -- [4]
                {
                    ["id"] = 1234,
                    ["image"] = 1044379,
                    ["name"] = "札伊拉酋長",
                }, -- [5]
            },
        }, -- [12]
    },
    ["潘達利亞之謎"] = {
        {
            ["id"] = 322,
            ["image"] = 652218,
            ["name"] = "潘達利亞",
            ["bosses"] = {
                {
                    ["id"] = 691,
                    ["image"] = 630847,
                    ["name"] = "憤怒之煞",
                }, -- [1]
                {
                    ["id"] = 725,
                    ["image"] = 630819,
                    ["name"] = "沙利斯的劫掠兵團",
                }, -- [2]
                {
                    ["id"] = 814,
                    ["image"] = 796778,
                    ["name"] = "『風暴龍王』納拉卡",
                }, -- [3]
                {
                    ["id"] = 826,
                    ["image"] = 796779,
                    ["name"] = "烏達斯塔",
                }, -- [4]
                {
                    ["id"] = 857,
                    ["image"] = 901155,
                    ["name"] = "『紅鶴』赤吉",
                }, -- [5]
                {
                    ["id"] = 858,
                    ["image"] = 901173,
                    ["name"] = "『玉蛟』玉龍",
                }, -- [6]
                {
                    ["id"] = 859,
                    ["image"] = 901165,
                    ["name"] = "『玄牛』怒兆",
                }, -- [7]
                {
                    ["id"] = 860,
                    ["image"] = 901172,
                    ["name"] = "『白虎』雪怒",
                }, -- [8]
                {
                    ["id"] = 861,
                    ["image"] = 901167,
                    ["name"] = "『揚古火神』歐朵斯",
                }, -- [9]
            },
        }, -- [1]
        {
            ["id"] = 317,
            ["image"] = 632273,
            ["name"] = "魔古山寶庫",
            ["bosses"] = {
                {
                    ["id"] = 679,
                    ["image"] = 630820,
                    ["name"] = "石衛士",
                }, -- [1]
                {
                    ["id"] = 689,
                    ["image"] = 630824,
                    ["name"] = "『咒魔』馮",
                }, -- [2]
                {
                    ["id"] = 682,
                    ["image"] = 630826,
                    ["name"] = "『縛靈者』卡拉賈",
                }, -- [3]
                {
                    ["id"] = 687,
                    ["image"] = 630861,
                    ["name"] = "帝王之魂",
                }, -- [4]
                {
                    ["id"] = 726,
                    ["image"] = 630823,
                    ["name"] = "艾拉岡",
                }, -- [5]
                {
                    ["id"] = 677,
                    ["image"] = 630836,
                    ["name"] = "大帝之志",
                }, -- [6]
            },
        }, -- [2]
        {
            ["id"] = 330,
            ["image"] = 632271,
            ["name"] = "恐懼之心",
            ["bosses"] = {
                {
                    ["id"] = 745,
                    ["image"] = 630834,
                    ["name"] = "女皇大臣索拉格",
                }, -- [1]
                {
                    ["id"] = 744,
                    ["image"] = 630817,
                    ["name"] = "刀鋒領主塔亞克",
                }, -- [2]
                {
                    ["id"] = 713,
                    ["image"] = 630827,
                    ["name"] = "加拉隆",
                }, -- [3]
                {
                    ["id"] = 741,
                    ["image"] = 630856,
                    ["name"] = "風領主瑪爾加拉克",
                }, -- [4]
                {
                    ["id"] = 737,
                    ["image"] = 630815,
                    ["name"] = "塑珀者翁索克",
                }, -- [5]
                {
                    ["id"] = 743,
                    ["image"] = 630830,
                    ["name"] = "杉齊爾女皇",
                }, -- [6]
            },
        }, -- [3]
        {
            ["id"] = 320,
            ["image"] = 643264,
            ["name"] = "豐泉台",
            ["bosses"] = {
                {
                    ["id"] = 683,
                    ["image"] = 630844,
                    ["name"] = "豐泉守衛者",
                }, -- [1]
                {
                    ["id"] = 742,
                    ["image"] = 630854,
                    ["name"] = "楚龍",
                }, -- [2]
                {
                    ["id"] = 729,
                    ["image"] = 630837,
                    ["name"] = "蕾希",
                }, -- [3]
                {
                    ["id"] = 709,
                    ["image"] = 630849,
                    ["name"] = "恐懼之煞",
                }, -- [4]
            },
        }, -- [4]
        {
            ["id"] = 362,
            ["image"] = 828453,
            ["name"] = "雷霆王座",
            ["bosses"] = {
                {
                    ["id"] = 827,
                    ["image"] = 796776,
                    ["name"] = "『擊破者』金羅克",
                }, -- [1]
                {
                    ["id"] = 819,
                    ["image"] = 796774,
                    ["name"] = "哈里登",
                }, -- [2]
                {
                    ["id"] = 816,
                    ["image"] = 796770,
                    ["name"] = "長老議會",
                }, -- [3]
                {
                    ["id"] = 825,
                    ["image"] = 796781,
                    ["name"] = "托爾托斯",
                }, -- [4]
                {
                    ["id"] = 821,
                    ["image"] = 796786,
                    ["name"] = "梅賈拉",
                }, -- [5]
                {
                    ["id"] = 828,
                    ["image"] = 796785,
                    ["name"] = "稷坤",
                }, -- [6]
                {
                    ["id"] = 818,
                    ["image"] = 796772,
                    ["name"] = "『遺忘之眼』獨顱目",
                }, -- [7]
                {
                    ["id"] = 820,
                    ["image"] = 796780,
                    ["name"] = "普莫迪斯",
                }, -- [8]
                {
                    ["id"] = 824,
                    ["image"] = 796771,
                    ["name"] = "黑暗憎惡魔像",
                }, -- [9]
                {
                    ["id"] = 817,
                    ["image"] = 796775,
                    ["name"] = "鐵穹",
                }, -- [10]
                {
                    ["id"] = 829,
                    ["image"] = 796773,
                    ["name"] = "孤慍雙絕",
                }, -- [11]
                {
                    ["id"] = 832,
                    ["image"] = 796777,
                    ["name"] = "雷神",
                }, -- [12]
            },
        }, -- [5]
        {
            ["id"] = 369,
            ["image"] = 904981,
            ["name"] = "圍攻奧格瑪",
            ["bosses"] = {
                {
                    ["id"] = 852,
                    ["image"] = 901160,
                    ["name"] = "伊莫爾西斯",
                }, -- [1]
                {
                    ["id"] = 849,
                    ["image"] = 901159,
                    ["name"] = "墮落的保衛者",
                }, -- [2]
                {
                    ["id"] = 866,
                    ["image"] = 901166,
                    ["name"] = "諾努衫",
                }, -- [3]
                {
                    ["id"] = 867,
                    ["image"] = 901168,
                    ["name"] = "傲慢之煞",
                }, -- [4]
                {
                    ["id"] = 868,
                    ["image"] = 901156,
                    ["name"] = "葛拉卡斯",
                }, -- [5]
                {
                    ["id"] = 864,
                    ["image"] = 901161,
                    ["name"] = "鋼鐵破滅邪神",
                }, -- [6]
                {
                    ["id"] = 856,
                    ["image"] = 901163,
                    ["name"] = "柯爾克隆黑暗薩滿",
                }, -- [7]
                {
                    ["id"] = 850,
                    ["image"] = 901158,
                    ["name"] = "納茲格寧姆將軍",
                }, -- [8]
                {
                    ["id"] = 846,
                    ["image"] = 901164,
                    ["name"] = "馬可羅克",
                }, -- [9]
                {
                    ["id"] = 870,
                    ["image"] = 901170,
                    ["name"] = "潘達利亞之寶",
                }, -- [10]
                {
                    ["id"] = 851,
                    ["image"] = 901171,
                    ["name"] = "『嗜血巨龍』梭克",
                }, -- [11]
                {
                    ["id"] = 865,
                    ["image"] = 901169,
                    ["name"] = "攻城機匠黑引信",
                }, -- [12]
                {
                    ["id"] = 853,
                    ["image"] = 901162,
                    ["name"] = "卡拉西聖螳",
                }, -- [13]
                {
                    ["id"] = 869,
                    ["image"] = 901157,
                    ["name"] = "卡爾洛斯‧地獄吼",
                }, -- [14]
            },
        }, -- [6]
        {
            ["id"] = 324,
            ["image"] = 643263,
            ["name"] = "圍攻怒兆寺",
            ["bosses"] = {
                {
                    ["id"] = 693,
                    ["image"] = 630855,
                    ["name"] = "大臣金巴克",
                }, -- [1]
                {
                    ["id"] = 738,
                    ["image"] = 630822,
                    ["name"] = "指揮官沃賈克",
                }, -- [2]
                {
                    ["id"] = 692,
                    ["image"] = 630829,
                    ["name"] = "帕伐拉克將軍",
                }, -- [3]
                {
                    ["id"] = 727,
                    ["image"] = 630857,
                    ["name"] = "飛翼領袖紐若納克",
                }, -- [4]
            },
        }, -- [7]
        {
            ["id"] = 312,
            ["image"] = 632274,
            ["name"] = "影潘僧院",
            ["bosses"] = {
                {
                    ["id"] = 673,
                    ["image"] = 630831,
                    ["name"] = "古‧雲擊",
                }, -- [1]
                {
                    ["id"] = 657,
                    ["image"] = 630841,
                    ["name"] = "雪迅大師",
                }, -- [2]
                {
                    ["id"] = 685,
                    ["image"] = 630850,
                    ["name"] = "暴力之煞",
                }, -- [3]
                {
                    ["id"] = 686,
                    ["image"] = 630852,
                    ["name"] = "塔蘭‧祝",
                }, -- [4]
            },
        }, -- [8]
        {
            ["id"] = 313,
            ["image"] = 632276,
            ["name"] = "玉蛟寺",
            ["bosses"] = {
                {
                    ["id"] = 672,
                    ["image"] = 630858,
                    ["name"] = "智者瑪利",
                }, -- [1]
                {
                    ["id"] = 664,
                    ["image"] = 630840,
                    ["name"] = "博學行者石步",
                }, -- [2]
                {
                    ["id"] = 658,
                    ["image"] = 630839,
                    ["name"] = "劉‧焰心",
                }, -- [3]
                {
                    ["id"] = 335,
                    ["image"] = 630848,
                    ["name"] = "疑惑之煞",
                }, -- [4]
            },
        }, -- [9]
        {
            ["id"] = 303,
            ["image"] = 632270,
            ["name"] = "落陽關",
            ["bosses"] = {
                {
                    ["id"] = 655,
                    ["image"] = 630846,
                    ["name"] = "『破壞者』奇普提拉克",
                }, -- [1]
                {
                    ["id"] = 675,
                    ["image"] = 630851,
                    ["name"] = "打擊者卡多克",
                }, -- [2]
                {
                    ["id"] = 676,
                    ["image"] = 630821,
                    ["name"] = "指揮官黎莫克",
                }, -- [3]
                {
                    ["id"] = 649,
                    ["image"] = 630845,
                    ["name"] = "雷剛",
                }, -- [4]
            },
        }, -- [10]
        {
            ["id"] = 316,
            ["image"] = 608214,
            ["name"] = "血色修道院",
            ["bosses"] = {
                {
                    ["id"] = 688,
                    ["image"] = 630853,
                    ["name"] = "『靈魂撕裂者』薩爾諾斯",
                }, -- [1]
                {
                    ["id"] = 671,
                    ["image"] = 630818,
                    ["name"] = "克羅夫修士",
                }, -- [2]
                {
                    ["id"] = 674,
                    ["image"] = 607643,
                    ["name"] = "高階審判官懷特邁恩",
                }, -- [3]
            },
        }, -- [11]
        {
            ["id"] = 311,
            ["image"] = 643262,
            ["name"] = "血色大廳",
            ["bosses"] = {
                {
                    ["id"] = 660,
                    ["image"] = 630833,
                    ["name"] = "馴犬者布勞恩",
                }, -- [1]
                {
                    ["id"] = 654,
                    ["image"] = 630816,
                    ["name"] = "武器大師哈倫",
                }, -- [2]
                {
                    ["id"] = 656,
                    ["image"] = 630825,
                    ["name"] = "織焰者喀格勒",
                }, -- [3]
            },
        }, -- [12]
        {
            ["id"] = 246,
            ["image"] = 608215,
            ["name"] = "通靈學院",
            ["bosses"] = {
                {
                    ["id"] = 659,
                    ["image"] = 630835,
                    ["name"] = "講師冷心",
                }, -- [1]
                {
                    ["id"] = 663,
                    ["image"] = 607666,
                    ["name"] = "詹迪斯‧巴羅夫",
                }, -- [2]
                {
                    ["id"] = 665,
                    ["image"] = 607755,
                    ["name"] = "血骨傀儡",
                }, -- [3]
                {
                    ["id"] = 666,
                    ["image"] = 630838,
                    ["name"] = "莉莉安‧佛斯",
                }, -- [4]
                {
                    ["id"] = 684,
                    ["image"] = 607582,
                    ["name"] = "黑暗院長加丁",
                }, -- [5]
            },
        }, -- [13]
        {
            ["id"] = 302,
            ["image"] = 632275,
            ["name"] = "風暴烈酒酒坊",
            ["bosses"] = {
                {
                    ["id"] = 668,
                    ["image"] = 630843,
                    ["name"] = "歐克‧歐克",
                }, -- [1]
                {
                    ["id"] = 669,
                    ["image"] = 630832,
                    ["name"] = "跳跳巨兔妖",
                }, -- [2]
                {
                    ["id"] = 670,
                    ["image"] = 630860,
                    ["name"] = "『破罈者』嚴祝",
                }, -- [3]
            },
        }, -- [14]
        {
            ["id"] = 321,
            ["image"] = 632272,
            ["name"] = "魔古山宮",
            ["bosses"] = {
                {
                    ["id"] = 708,
                    ["image"] = 630842,
                    ["name"] = "帝王的試煉",
                }, -- [1]
                {
                    ["id"] = 690,
                    ["image"] = 630828,
                    ["name"] = "蓋肯",
                }, -- [2]
                {
                    ["id"] = 698,
                    ["image"] = 630859,
                    ["name"] = "『武器大師』辛",
                }, -- [3]
            },
        }, -- [15]
    },
    ["巨龍崛起"] = {
        {
            ["id"] = 1205,
            ["image"] = 4742925,
            ["name"] = "巨龍群島",
            ["bosses"] = {
                {
                    ["id"] = 2515,
                    ["image"] = 4757700,
                    ["name"] = "『空之災厄』史珠那朗",
                }, -- [1]
                {
                    ["id"] = 2506,
                    ["image"] = 4757691,
                    ["name"] = "『岩翼』巴斯里隆",
                }, -- [2]
                {
                    ["id"] = 2517,
                    ["image"] = 4757692,
                    ["name"] = "『驚懼之焰』巴祖爾",
                }, -- [3]
                {
                    ["id"] = 2518,
                    ["image"] = 4757697,
                    ["name"] = "『未來災禍』利斯卡諾絲",
                }, -- [4]
                {
                    ["id"] = 2531,
                    ["image"] = 5151696,
                    ["name"] = "薩克利長老",
                }, -- [5]
            },
        }, -- [1]
        {
            ["id"] = 1200,
            ["image"] = 4742931,
            ["name"] = "洪荒化身牢獄",
            ["bosses"] = {
                {
                    ["id"] = 2480,
                    ["image"] = 4757695,
                    ["name"] = "伊拉諾格",
                }, -- [1]
                {
                    ["id"] = 2500,
                    ["image"] = 4757701,
                    ["name"] = "忒羅司",
                }, -- [2]
                {
                    ["id"] = 2486,
                    ["image"] = 4757702,
                    ["name"] = "洪荒議會",
                }, -- [3]
                {
                    ["id"] = 2482,
                    ["image"] = 4757699,
                    ["name"] = "『冰冷之息』賽娜絲",
                }, -- [4]
                {
                    ["id"] = 2502,
                    ["image"] = 4757694,
                    ["name"] = "『超凡者』達西亞",
                }, -- [5]
                {
                    ["id"] = 2491,
                    ["image"] = 4757696,
                    ["name"] = "庫洛格‧恐怖圖騰",
                }, -- [6]
                {
                    ["id"] = 2493,
                    ["image"] = 4757693,
                    ["name"] = "幼龍守衛者戴恩娜",
                }, -- [7]
                {
                    ["id"] = 2499,
                    ["image"] = 4757698,
                    ["name"] = "『噬風者』菈薩葛絲",
                }, -- [8]
            },
        }, -- [2]
        {
            ["id"] = 1208,
            ["image"] = 5149418,
            ["name"] = "『朧影實驗場』亞貝魯斯",
            ["bosses"] = {
                {
                    ["id"] = 2522,
                    ["image"] = 5151370,
                    ["name"] = "『地獄鍛造者』卡扎拉",
                }, -- [1]
                {
                    ["id"] = 2529,
                    ["image"] = 5151374,
                    ["name"] = "融合體之室",
                }, -- [2]
                {
                    ["id"] = 2530,
                    ["image"] = 5151375,
                    ["name"] = "被遺忘的實驗品",
                }, -- [3]
                {
                    ["id"] = 2524,
                    ["image"] = 5151368,
                    ["name"] = "薩克利的襲擊",
                }, -- [4]
                {
                    ["id"] = 2525,
                    ["image"] = 5151372,
                    ["name"] = "拉修克長老",
                }, -- [5]
                {
                    ["id"] = 2532,
                    ["image"] = 5151376,
                    ["name"] = "警戒侍者茲坎",
                }, -- [6]
                {
                    ["id"] = 2527,
                    ["image"] = 5151371,
                    ["name"] = "馬格莫拉克斯",
                }, -- [7]
                {
                    ["id"] = 2523,
                    ["image"] = 5151369,
                    ["name"] = "奈薩里奧的殘影",
                }, -- [8]
                {
                    ["id"] = 2520,
                    ["image"] = 5151373,
                    ["name"] = "龍隊指揮官沙卡瑞斯",
                }, -- [9]
            },
        }, -- [3]
        {
            ["id"] = 1209,
            ["image"] = 5221768,
            ["name"] = "恆龍黎明",
            ["bosses"] = {
                {
                    ["id"] = 2521,
                    ["image"] = 5221761,
                    ["name"] = "柯瓏妮卡",
                }, -- [1]
                {
                    ["id"] = 2528,
                    ["image"] = 5221766,
                    ["name"] = "時間之道化身",
                }, -- [2]
                {
                    ["id"] = 2535,
                    ["image"] = 5221760,
                    ["name"] = "葛拉克朗之疫",
                }, -- [3]
                {
                    ["id"] = 2537,
                    ["image"] = 5221765,
                    ["name"] = "『岩鱗』伊瑞迪柯隆",
                }, -- [4]
                {
                    ["id"] = 2526,
                    ["image"] = 5221764,
                    ["name"] = "恆龍守衛者提爾",
                }, -- [5]
                {
                    ["id"] = 2536,
                    ["image"] = 5221767,
                    ["name"] = "米羅克",
                }, -- [6]
                {
                    ["id"] = 2534,
                    ["image"] = 5221759,
                    ["name"] = "時佚戰場",
                }, -- [7]
                {
                    ["id"] = 2538,
                    ["image"] = 4741507,
                    ["name"] = "時空領主戴歐司",
                }, -- [8]
            },
        }, -- [4]
        {
            ["id"] = 1201,
            ["image"] = 4742929,
            ["name"] = "阿爾蓋薩學院",
            ["bosses"] = {
                {
                    ["id"] = 2509,
                    ["image"] = 4741534,
                    ["name"] = "維薩穆斯",
                }, -- [1]
                {
                    ["id"] = 2512,
                    ["image"] = 4741524,
                    ["name"] = "生長過盛的古樹",
                }, -- [2]
                {
                    ["id"] = 2495,
                    ["image"] = 4741508,
                    ["name"] = "克若絲",
                }, -- [3]
                {
                    ["id"] = 2514,
                    ["image"] = 4741510,
                    ["name"] = "朵拉苟莎的回音",
                }, -- [4]
            },
        }, -- [5]
        {
            ["id"] = 1196,
            ["image"] = 4742923,
            ["name"] = "蕨皮谷",
            ["bosses"] = {
                {
                    ["id"] = 2471,
                    ["image"] = 4741526,
                    ["name"] = "砍爪戰隊",
                }, -- [1]
                {
                    ["id"] = 2473,
                    ["image"] = 4741532,
                    ["name"] = "樹嘴",
                }, -- [2]
                {
                    ["id"] = 2472,
                    ["image"] = 4741518,
                    ["name"] = "穿肚",
                }, -- [3]
                {
                    ["id"] = 2474,
                    ["image"] = 4741509,
                    ["name"] = "『腐朽族母』怒眼",
                }, -- [4]
            },
        }, -- [6]
        {
            ["id"] = 1204,
            ["image"] = 4742926,
            ["name"] = "灌注迴廊",
            ["bosses"] = {
                {
                    ["id"] = 2504,
                    ["image"] = 4741536,
                    ["name"] = "看守者伊力篤斯",
                }, -- [1]
                {
                    ["id"] = 2507,
                    ["image"] = 4741516,
                    ["name"] = "吞嚥巨蛙",
                }, -- [2]
                {
                    ["id"] = 2510,
                    ["image"] = 4741519,
                    ["name"] = "『不撓者』卡金",
                }, -- [3]
                {
                    ["id"] = 2511,
                    ["image"] = 4741525,
                    ["name"] = "洪荒海嘯",
                }, -- [4]
            },
        }, -- [7]
        {
            ["id"] = 1199,
            ["image"] = 4742928,
            ["name"] = "奈薩魯斯堡",
            ["bosses"] = {
                {
                    ["id"] = 2490,
                    ["image"] = 4741506,
                    ["name"] = "『龍鱗之禍』查爾加斯",
                }, -- [1]
                {
                    ["id"] = 2489,
                    ["image"] = 4741513,
                    ["name"] = "鍛造大師戈瑞克",
                }, -- [2]
                {
                    ["id"] = 2494,
                    ["image"] = 4741522,
                    ["name"] = "熔岩之牙",
                }, -- [3]
                {
                    ["id"] = 2501,
                    ["image"] = 4741535,
                    ["name"] = "督軍莎葛哈",
                }, -- [4]
            },
        }, -- [8]
        {
            ["id"] = 1202,
            ["image"] = 4742927,
            ["name"] = "晶紅生命之池",
            ["bosses"] = {
                {
                    ["id"] = 2488,
                    ["image"] = 4741523,
                    ["name"] = "梅莉卓沙‧寒磨",
                }, -- [1]
                {
                    ["id"] = 2485,
                    ["image"] = 4741520,
                    ["name"] = "可幾亞‧焰蹄",
                }, -- [2]
                {
                    ["id"] = 2503,
                    ["image"] = 4867810,
                    ["name"] = "凱拉卡及俄克哈‧風脈",
                }, -- [3]
            },
        }, -- [9]
        {
            ["id"] = 1203,
            ["image"] = 4742829,
            ["name"] = "蒼藍密庫",
            ["bosses"] = {
                {
                    ["id"] = 2492,
                    ["image"] = 4741521,
                    ["name"] = "雷摩",
                }, -- [1]
                {
                    ["id"] = 2505,
                    ["image"] = 4741503,
                    ["name"] = "蒼藍之刃",
                }, -- [2]
                {
                    ["id"] = 2483,
                    ["image"] = 4741529,
                    ["name"] = "泰拉許‧灰翼",
                }, -- [3]
                {
                    ["id"] = 2508,
                    ["image"] = 4741533,
                    ["name"] = "安珀斯庫",
                }, -- [4]
            },
        }, -- [10]
        {
            ["id"] = 1198,
            ["image"] = 4742924,
            ["name"] = "諾庫德進攻據點",
            ["bosses"] = {
                {
                    ["id"] = 2498,
                    ["image"] = 4741514,
                    ["name"] = "葛蘭尼斯",
                }, -- [1]
                {
                    ["id"] = 2497,
                    ["image"] = 4741531,
                    ["name"] = "狂怒風暴",
                }, -- [2]
                {
                    ["id"] = 2478,
                    ["image"] = 4741528,
                    ["name"] = "蹄拉和莫魯克",
                }, -- [3]
                {
                    ["id"] = 2477,
                    ["image"] = 4741504,
                    ["name"] = "巴拉卡可汗",
                }, -- [4]
            },
        }, -- [11]
        {
            ["id"] = 1197,
            ["image"] = 4742930,
            ["name"] = "奧達曼：提爾的遺產",
            ["bosses"] = {
                {
                    ["id"] = 2475,
                    ["image"] = 4741530,
                    ["name"] = "失落的矮人",
                }, -- [1]
                {
                    ["id"] = 2487,
                    ["image"] = 4741505,
                    ["name"] = "布洛麥",
                }, -- [2]
                {
                    ["id"] = 2484,
                    ["image"] = 4741527,
                    ["name"] = "哨兵泰龍爪斯",
                }, -- [3]
                {
                    ["id"] = 2476,
                    ["image"] = 4741511,
                    ["name"] = "焰博熔",
                }, -- [4]
                {
                    ["id"] = 2479,
                    ["image"] = 4741507,
                    ["name"] = "時空領主戴歐司",
                }, -- [5]
            },
        }, -- [12]
    },
    ["巫妖王之怒"] = {
        {
            ["id"] = 753,
            ["image"] = 1396596,
            ["name"] = "亞夏梵穹殿",
            ["bosses"] = {
                {
                    ["id"] = 1597,
                    ["image"] = 1385715,
                    ["name"] = "『石之看守者』亞夏梵",
                }, -- [1]
                {
                    ["id"] = 1598,
                    ["image"] = 1385727,
                    ["name"] = "『風暴看守者』艾瑪隆",
                }, -- [2]
                {
                    ["id"] = 1599,
                    ["image"] = 1385748,
                    ["name"] = "『烈焰看守者』寇拉隆",
                }, -- [3]
                {
                    ["id"] = 1600,
                    ["image"] = 1385767,
                    ["name"] = "『寒冰看守者』拓拉梵",
                }, -- [4]
            },
        }, -- [1]
        {
            ["id"] = 754,
            ["image"] = 1396587,
            ["name"] = "納克薩瑪斯",
            ["bosses"] = {
                {
                    ["id"] = 1601,
                    ["image"] = 1378964,
                    ["name"] = "阿努比瑞克漢",
                }, -- [1]
                {
                    ["id"] = 1602,
                    ["image"] = 1378980,
                    ["name"] = "大寡婦費琳娜",
                }, -- [2]
                {
                    ["id"] = 1603,
                    ["image"] = 1378994,
                    ["name"] = "梅克絲娜",
                }, -- [3]
                {
                    ["id"] = 1604,
                    ["image"] = 1379004,
                    ["name"] = "『瘟疫使者』諾斯",
                }, -- [4]
                {
                    ["id"] = 1605,
                    ["image"] = 1378984,
                    ["name"] = "『不潔者』海根",
                }, -- [5]
                {
                    ["id"] = 1606,
                    ["image"] = 1378991,
                    ["name"] = "憎恨者",
                }, -- [6]
                {
                    ["id"] = 1607,
                    ["image"] = 1378988,
                    ["name"] = "講師拉祖維斯",
                }, -- [7]
                {
                    ["id"] = 1608,
                    ["image"] = 1378979,
                    ["name"] = "『收割者』高希",
                }, -- [8]
                {
                    ["id"] = 1609,
                    ["image"] = 1385732,
                    ["name"] = "四騎士",
                }, -- [9]
                {
                    ["id"] = 1610,
                    ["image"] = 1379005,
                    ["name"] = "縫補者",
                }, -- [10]
                {
                    ["id"] = 1611,
                    ["image"] = 1378981,
                    ["name"] = "葛羅巴斯",
                }, -- [11]
                {
                    ["id"] = 1612,
                    ["image"] = 1378977,
                    ["name"] = "古魯斯",
                }, -- [12]
                {
                    ["id"] = 1613,
                    ["image"] = 1379019,
                    ["name"] = "泰迪斯",
                }, -- [13]
                {
                    ["id"] = 1614,
                    ["image"] = 1379010,
                    ["name"] = "薩菲隆",
                }, -- [14]
                {
                    ["id"] = 1615,
                    ["image"] = 1378989,
                    ["name"] = "科爾蘇加德",
                }, -- [15]
            },
        }, -- [2]
        {
            ["id"] = 755,
            ["image"] = 1396588,
            ["name"] = "黑曜聖所",
            ["bosses"] = {
                {
                    ["id"] = 1616,
                    ["image"] = 1385765,
                    ["name"] = "撒爾薩里安",
                }, -- [1]
            },
        }, -- [3]
        {
            ["id"] = 756,
            ["image"] = 1396581,
            ["name"] = "永恆之眼",
            ["bosses"] = {
                {
                    ["id"] = 1617,
                    ["image"] = 1385753,
                    ["name"] = "瑪里苟斯",
                }, -- [1]
            },
        }, -- [4]
        {
            ["id"] = 759,
            ["image"] = 1396595,
            ["name"] = "奧杜亞",
            ["bosses"] = {
                {
                    ["id"] = 1637,
                    ["image"] = 1385731,
                    ["name"] = "烈焰戰輪",
                }, -- [1]
                {
                    ["id"] = 1638,
                    ["image"] = 1385742,
                    ["name"] = "『火爐之主』伊格尼司",
                }, -- [2]
                {
                    ["id"] = 1639,
                    ["image"] = 1385763,
                    ["name"] = "銳鱗",
                }, -- [3]
                {
                    ["id"] = 1640,
                    ["image"] = 1385773,
                    ["name"] = "XT-002拆解者",
                }, -- [4]
                {
                    ["id"] = 1641,
                    ["image"] = 1390439,
                    ["name"] = "鐵之集會",
                }, -- [5]
                {
                    ["id"] = 1642,
                    ["image"] = 1385747,
                    ["name"] = "柯洛剛恩",
                }, -- [6]
                {
                    ["id"] = 1643,
                    ["image"] = 1385717,
                    ["name"] = "奧芮雅",
                }, -- [7]
                {
                    ["id"] = 1644,
                    ["image"] = 1385740,
                    ["name"] = "霍迪爾",
                }, -- [8]
                {
                    ["id"] = 1645,
                    ["image"] = 1385770,
                    ["name"] = "索林姆",
                }, -- [9]
                {
                    ["id"] = 1646,
                    ["image"] = 1385733,
                    ["name"] = "芙蕾雅",
                }, -- [10]
                {
                    ["id"] = 1647,
                    ["image"] = 1385754,
                    ["name"] = "彌米倫",
                }, -- [11]
                {
                    ["id"] = 1648,
                    ["image"] = 1385735,
                    ["name"] = "威札斯將軍",
                }, -- [12]
                {
                    ["id"] = 1649,
                    ["image"] = 1385774,
                    ["name"] = "尤格薩倫",
                }, -- [13]
                {
                    ["id"] = 1650,
                    ["image"] = 1385713,
                    ["name"] = "『觀察者』艾爾加隆",
                }, -- [14]
            },
        }, -- [5]
        {
            ["id"] = 757,
            ["image"] = 1396594,
            ["name"] = "十字軍試煉",
            ["bosses"] = {
                {
                    ["id"] = 1618,
                    ["image"] = 1390440,
                    ["name"] = "北裂境野獸",
                }, -- [1]
                {
                    ["id"] = 1619,
                    ["image"] = 1385752,
                    ["name"] = "賈拉克瑟斯領主",
                }, -- [2]
                {
                    ["id"] = 1620,
                    ["image"] = 1390442,
                    ["name"] = "聯盟勇士",
                }, -- [3]
                {
                    ["id"] = 1622,
                    ["image"] = 1390443,
                    ["name"] = "華爾琪雙子",
                }, -- [4]
                {
                    ["id"] = 1623,
                    ["image"] = 607542,
                    ["name"] = "阿努巴拉克",
                }, -- [5]
            },
        }, -- [6]
        {
            ["id"] = 760,
            ["image"] = 1396589,
            ["name"] = "奧妮克希亞的巢穴",
            ["bosses"] = {
                {
                    ["id"] = 1651,
                    ["image"] = 1379025,
                    ["name"] = "奧妮克希亞",
                }, -- [1]
            },
        }, -- [7]
        {
            ["id"] = 758,
            ["image"] = 1396583,
            ["name"] = "冰冠城塞",
            ["bosses"] = {
                {
                    ["id"] = 1624,
                    ["image"] = 1378992,
                    ["name"] = "瑪洛嘉領主",
                }, -- [1]
                {
                    ["id"] = 1625,
                    ["image"] = 1378990,
                    ["name"] = "亡語女士",
                }, -- [2]
                {
                    ["id"] = 1627,
                    ["image"] = 1385736,
                    ["name"] = "冰冠城塞砲艇戰",
                }, -- [3]
                {
                    ["id"] = 1628,
                    ["image"] = 1378970,
                    ["name"] = "死亡使者薩魯法爾",
                }, -- [4]
                {
                    ["id"] = 1629,
                    ["image"] = 1378972,
                    ["name"] = "膿腸",
                }, -- [5]
                {
                    ["id"] = 1630,
                    ["image"] = 1379009,
                    ["name"] = "腐臉",
                }, -- [6]
                {
                    ["id"] = 1631,
                    ["image"] = 1379007,
                    ["name"] = "普崔希德教授",
                }, -- [7]
                {
                    ["id"] = 1632,
                    ["image"] = 1385721,
                    ["name"] = "血親王議會",
                }, -- [8]
                {
                    ["id"] = 1633,
                    ["image"] = 1378967,
                    ["name"] = "血腥女王菈娜薩爾",
                }, -- [9]
                {
                    ["id"] = 1634,
                    ["image"] = 1379023,
                    ["name"] = "瓦莉絲瑞雅‧夢行者",
                }, -- [10]
                {
                    ["id"] = 1635,
                    ["image"] = 1379014,
                    ["name"] = "辛德拉苟莎",
                }, -- [11]
                {
                    ["id"] = 1636,
                    ["image"] = 607688,
                    ["name"] = "巫妖王",
                }, -- [12]
            },
        }, -- [8]
        {
            ["id"] = 761,
            ["image"] = 1396590,
            ["name"] = "晶紅聖所",
            ["bosses"] = {
                {
                    ["id"] = 1652,
                    ["image"] = 1385738,
                    ["name"] = "海萊恩",
                }, -- [1]
            },
        }, -- [9]
        {
            ["id"] = 286,
            ["image"] = 608227,
            ["name"] = "俄特加德之巔",
            ["bosses"] = {
                {
                    ["id"] = 641,
                    ["image"] = 607778,
                    ["name"] = "絲瓦拉‧悲傷亡墓",
                }, -- [1]
                {
                    ["id"] = 642,
                    ["image"] = 607620,
                    ["name"] = "戈托克‧白蹄",
                }, -- [2]
                {
                    ["id"] = 643,
                    ["image"] = 607773,
                    ["name"] = "無情的斯卡迪",
                }, -- [3]
                {
                    ["id"] = 644,
                    ["image"] = 607674,
                    ["name"] = "依米倫王",
                }, -- [4]
            },
        }, -- [10]
        {
            ["id"] = 285,
            ["image"] = 608226,
            ["name"] = "俄特加德要塞",
            ["bosses"] = {
                {
                    ["id"] = 638,
                    ["image"] = 607743,
                    ["name"] = "凱雷希斯親王",
                }, -- [1]
                {
                    ["id"] = 639,
                    ["image"] = 607774,
                    ["name"] = "史卡沃&達隆恩",
                }, -- [2]
                {
                    ["id"] = 640,
                    ["image"] = 607659,
                    ["name"] = "『盜掠者』因格瓦",
                }, -- [3]
            },
        }, -- [11]
        {
            ["id"] = 276,
            ["image"] = 608205,
            ["name"] = "倒影大廳",
            ["bosses"] = {
                {
                    ["id"] = 601,
                    ["image"] = 607601,
                    ["name"] = "法勒瑞克",
                }, -- [1]
                {
                    ["id"] = 602,
                    ["image"] = 607710,
                    ["name"] = "麥爾溫",
                }, -- [2]
                {
                    ["id"] = 603,
                    ["image"] = 607688,
                    ["name"] = "逃離阿薩斯",
                }, -- [3]
            },
        }, -- [12]
        {
            ["id"] = 274,
            ["image"] = 608203,
            ["name"] = "剛德拉克",
            ["bosses"] = {
                {
                    ["id"] = 592,
                    ["image"] = 607776,
                    ["name"] = "史拉德銳",
                }, -- [1]
                {
                    ["id"] = 593,
                    ["image"] = 607589,
                    ["name"] = "德拉克瑞巨像",
                }, -- [2]
                {
                    ["id"] = 594,
                    ["image"] = 607716,
                    ["name"] = "慕拉比",
                }, -- [3]
                {
                    ["id"] = 596,
                    ["image"] = 607605,
                    ["name"] = "蓋爾達拉",
                }, -- [4]
            },
        }, -- [13]
        {
            ["id"] = 284,
            ["image"] = 608224,
            ["name"] = "勇士試煉",
            ["bosses"] = {
                {
                    ["id"] = 834,
                    ["image"] = 607621,
                    ["name"] = "大勇士",
                }, -- [1]
                {
                    ["id"] = 635,
                    ["image"] = 607591,
                    ["name"] = "『純淨者』埃卓克",
                }, -- [2]
                {
                    ["id"] = 636,
                    ["image"] = 607547,
                    ["name"] = "銀白告解者帕爾璀絲",
                }, -- [3]
                {
                    ["id"] = 637,
                    ["image"] = 607787,
                    ["name"] = "黑騎士",
                }, -- [4]
            },
        }, -- [14]
        {
            ["id"] = 281,
            ["image"] = 608221,
            ["name"] = "奧核之心",
            ["bosses"] = {
                {
                    ["id"] = 618,
                    ["image"] = 607623,
                    ["name"] = "大魔導師特雷斯翠",
                }, -- [1]
                {
                    ["id"] = 619,
                    ["image"] = 607540,
                    ["name"] = "艾諾瑪路斯",
                }, -- [2]
                {
                    ["id"] = 620,
                    ["image"] = 607735,
                    ["name"] = "『塑樹者』歐爾莫洛克",
                }, -- [3]
                {
                    ["id"] = 621,
                    ["image"] = 607671,
                    ["name"] = "凱瑞史卓莎",
                }, -- [4]
            },
        }, -- [15]
        {
            ["id"] = 282,
            ["image"] = 608222,
            ["name"] = "奧核之眼",
            ["bosses"] = {
                {
                    ["id"] = 622,
                    ["image"] = 607590,
                    ["name"] = "『審問者』德拉高斯",
                }, -- [1]
                {
                    ["id"] = 623,
                    ["image"] = 607802,
                    ["name"] = "瓦羅斯‧雲行者",
                }, -- [2]
                {
                    ["id"] = 624,
                    ["image"] = 607702,
                    ["name"] = "法師領主厄隆",
                }, -- [3]
                {
                    ["id"] = 625,
                    ["image"] = 607687,
                    ["name"] = "地脈守護者伊瑞茍斯",
                }, -- [4]
            },
        }, -- [16]
        {
            ["id"] = 271,
            ["image"] = 608192,
            ["name"] = "安卡罕特：古王國",
            ["bosses"] = {
                {
                    ["id"] = 580,
                    ["image"] = 607593,
                    ["name"] = "那杜斯長老",
                }, -- [1]
                {
                    ["id"] = 581,
                    ["image"] = 607744,
                    ["name"] = "泰爾達朗親王",
                }, -- [2]
                {
                    ["id"] = 582,
                    ["image"] = 607667,
                    ["name"] = "潔杜佳‧尋影者",
                }, -- [3]
                {
                    ["id"] = 584,
                    ["image"] = 607639,
                    ["name"] = "信使沃菈齊",
                }, -- [4]
            },
        }, -- [17]
        {
            ["id"] = 273,
            ["image"] = 608201,
            ["name"] = "德拉克薩隆要塞",
            ["bosses"] = {
                {
                    ["id"] = 588,
                    ["image"] = 607798,
                    ["name"] = "血角食人妖",
                }, -- [1]
                {
                    ["id"] = 589,
                    ["image"] = 607727,
                    ["name"] = "『召喚者』諾沃司",
                }, -- [2]
                {
                    ["id"] = 590,
                    ["image"] = 607672,
                    ["name"] = "崔德王",
                }, -- [3]
                {
                    ["id"] = 591,
                    ["image"] = 607790,
                    ["name"] = "預言者薩隆杰",
                }, -- [4]
            },
        }, -- [18]
        {
            ["id"] = 279,
            ["image"] = 608219,
            ["name"] = "斯坦索姆的抉擇",
            ["bosses"] = {
                {
                    ["id"] = 611,
                    ["image"] = 607711,
                    ["name"] = "肉鉤",
                }, -- [1]
                {
                    ["id"] = 612,
                    ["image"] = 607763,
                    ["name"] = "『血肉工匠』塞歐朗姆",
                }, -- [2]
                {
                    ["id"] = 613,
                    ["image"] = 607567,
                    ["name"] = "紀元時間領主",
                }, -- [3]
                {
                    ["id"] = 614,
                    ["image"] = 607708,
                    ["name"] = "瑪爾加尼斯",
                }, -- [4]
            },
        }, -- [19]
        {
            ["id"] = 280,
            ["image"] = 608220,
            ["name"] = "眾魂熔爐",
            ["bosses"] = {
                {
                    ["id"] = 615,
                    ["image"] = 607559,
                    ["name"] = "布朗吉姆",
                }, -- [1]
                {
                    ["id"] = 616,
                    ["image"] = 607585,
                    ["name"] = "眾魂吞噬者",
                }, -- [2]
            },
        }, -- [20]
        {
            ["id"] = 277,
            ["image"] = 608206,
            ["name"] = "石之大廳",
            ["bosses"] = {
                {
                    ["id"] = 604,
                    ["image"] = 607679,
                    ["name"] = "克利斯托魯斯",
                }, -- [1]
                {
                    ["id"] = 605,
                    ["image"] = 607706,
                    ["name"] = "悲嘆少女",
                }, -- [2]
                {
                    ["id"] = 606,
                    ["image"] = 607797,
                    ["name"] = "歲月議庭",
                }, -- [3]
                {
                    ["id"] = 607,
                    ["image"] = 607772,
                    ["name"] = "『塑鐵者』斯雍尼爾",
                }, -- [4]
            },
        }, -- [21]
        {
            ["id"] = 283,
            ["image"] = 608228,
            ["name"] = "紫羅蘭堡",
            ["bosses"] = {
                {
                    ["id"] = 626,
                    ["image"] = 607597,
                    ["name"] = "伊銳坎",
                }, -- [1]
                {
                    ["id"] = 627,
                    ["image"] = 607717,
                    ["name"] = "摩拉革",
                }, -- [2]
                {
                    ["id"] = 628,
                    ["image"] = 607654,
                    ["name"] = "艾克膿",
                }, -- [3]
                {
                    ["id"] = 629,
                    ["image"] = 607821,
                    ["name"] = "基沃滋",
                }, -- [4]
                {
                    ["id"] = 630,
                    ["image"] = 607685,
                    ["name"] = "拉方索",
                }, -- [5]
                {
                    ["id"] = 631,
                    ["image"] = 607825,
                    ["name"] = "『消滅者』舒拉邁特",
                }, -- [6]
                {
                    ["id"] = 632,
                    ["image"] = 607573,
                    ["name"] = "霞妮苟莎",
                }, -- [7]
            },
        }, -- [22]
        {
            ["id"] = 278,
            ["image"] = 608210,
            ["name"] = "薩倫之淵",
            ["bosses"] = {
                {
                    ["id"] = 608,
                    ["image"] = 607603,
                    ["name"] = "鍛造大師加弗羅斯",
                }, -- [1]
                {
                    ["id"] = 609,
                    ["image"] = 607677,
                    ["name"] = "艾克與克瑞克",
                }, -- [2]
                {
                    ["id"] = 610,
                    ["image"] = 607765,
                    ["name"] = "天譴領主提朗紐斯",
                }, -- [3]
            },
        }, -- [23]
        {
            ["id"] = 272,
            ["image"] = 608194,
            ["name"] = "阿茲歐-奈幽",
            ["bosses"] = {
                {
                    ["id"] = 585,
                    ["image"] = 607678,
                    ["name"] = "『守門者』齊力克西爾",
                }, -- [1]
                {
                    ["id"] = 586,
                    ["image"] = 607633,
                    ["name"] = "哈卓諾克斯",
                }, -- [2]
                {
                    ["id"] = 587,
                    ["image"] = 607542,
                    ["name"] = "阿努巴拉克",
                }, -- [3]
            },
        }, -- [24]
        {
            ["id"] = 275,
            ["image"] = 608204,
            ["name"] = "雷光大廳",
            ["bosses"] = {
                {
                    ["id"] = 597,
                    ["image"] = 607611,
                    ["name"] = "畢亞格林將軍",
                }, -- [1]
                {
                    ["id"] = 598,
                    ["image"] = 607809,
                    ["name"] = "渥克瀚",
                }, -- [2]
                {
                    ["id"] = 599,
                    ["image"] = 607663,
                    ["name"] = "埃歐納",
                }, -- [3]
                {
                    ["id"] = 600,
                    ["image"] = 607690,
                    ["name"] = "洛肯",
                }, -- [4]
            },
        }, -- [25]
    },
    ["浩劫與重生"] = {
        {
            ["id"] = 75,
            ["image"] = 522349,
            ["name"] = "巴拉丁堡",
            ["bosses"] = {
                {
                    ["id"] = 139,
                    ["image"] = 522198,
                    ["name"] = "阿加羅斯",
                }, -- [1]
                {
                    ["id"] = 140,
                    ["image"] = 523207,
                    ["name"] = "歐庫薩",
                }, -- [2]
                {
                    ["id"] = 339,
                    ["image"] = 571742,
                    ["name"] = "『仇恨仕女』阿利札巴",
                }, -- [3]
            },
        }, -- [1]
        {
            ["id"] = 74,
            ["image"] = 522359,
            ["name"] = "四風王座",
            ["bosses"] = {
                {
                    ["id"] = 154,
                    ["image"] = 522196,
                    ["name"] = "風之議會",
                }, -- [1]
                {
                    ["id"] = 155,
                    ["image"] = 522191,
                    ["name"] = "奧拉基爾",
                }, -- [2]
            },
        }, -- [2]
        {
            ["id"] = 72,
            ["image"] = 522355,
            ["name"] = "暮光堡壘",
            ["bosses"] = {
                {
                    ["id"] = 156,
                    ["image"] = 522232,
                    ["name"] = "哈福斯‧破龍者",
                }, -- [1]
                {
                    ["id"] = 157,
                    ["image"] = 522274,
                    ["name"] = "瑟拉里恩和瓦莉歐娜",
                }, -- [2]
                {
                    ["id"] = 158,
                    ["image"] = 522224,
                    ["name"] = "卓越者議會",
                }, -- [3]
                {
                    ["id"] = 167,
                    ["image"] = 522212,
                    ["name"] = "丘加利",
                }, -- [4]
                {
                    ["id"] = 168,
                    ["image"] = 522270,
                    ["name"] = "賽絲特拉",
                }, -- [5]
            },
        }, -- [3]
        {
            ["id"] = 73,
            ["image"] = 522351,
            ["name"] = "黑翼陷窟",
            ["bosses"] = {
                {
                    ["id"] = 169,
                    ["image"] = 522250,
                    ["name"] = "全能魔像防衛系統",
                }, -- [1]
                {
                    ["id"] = 170,
                    ["image"] = 522251,
                    ["name"] = "熔喉",
                }, -- [2]
                {
                    ["id"] = 171,
                    ["image"] = 522202,
                    ["name"] = "亞特拉米德",
                }, -- [3]
                {
                    ["id"] = 172,
                    ["image"] = 522211,
                    ["name"] = "奇瑪隆",
                }, -- [4]
                {
                    ["id"] = 173,
                    ["image"] = 522252,
                    ["name"] = "瑪洛里亞克",
                }, -- [5]
                {
                    ["id"] = 174,
                    ["image"] = 522255,
                    ["name"] = "奈法利安的末路",
                }, -- [6]
            },
        }, -- [4]
        {
            ["id"] = 78,
            ["image"] = 522353,
            ["name"] = "火源之界",
            ["bosses"] = {
                {
                    ["id"] = 192,
                    ["image"] = 522208,
                    ["name"] = "貝絲堤拉克",
                }, -- [1]
                {
                    ["id"] = 193,
                    ["image"] = 522248,
                    ["name"] = "萊爾利斯領主",
                }, -- [2]
                {
                    ["id"] = 194,
                    ["image"] = 522193,
                    ["name"] = "艾里絲拉卓",
                }, -- [3]
                {
                    ["id"] = 195,
                    ["image"] = 522268,
                    ["name"] = "夏諾克斯",
                }, -- [4]
                {
                    ["id"] = 196,
                    ["image"] = 522204,
                    ["name"] = "巴勒羅克，守門人",
                }, -- [5]
                {
                    ["id"] = 197,
                    ["image"] = 522223,
                    ["name"] = "管理者鹿盔",
                }, -- [6]
                {
                    ["id"] = 198,
                    ["image"] = 522261,
                    ["name"] = "拉格納羅斯",
                }, -- [7]
            },
        }, -- [5]
        {
            ["id"] = 187,
            ["image"] = 571753,
            ["name"] = "巨龍之魂",
            ["bosses"] = {
                {
                    ["id"] = 311,
                    ["image"] = 536058,
                    ["name"] = "魔寇",
                }, -- [1]
                {
                    ["id"] = 324,
                    ["image"] = 536061,
                    ["name"] = "督軍松奧茲",
                }, -- [2]
                {
                    ["id"] = 325,
                    ["image"] = 536062,
                    ["name"] = "未眠者尤沙吉",
                }, -- [3]
                {
                    ["id"] = 317,
                    ["image"] = 536057,
                    ["name"] = "『暴風守縛者』哈甲拉",
                }, -- [4]
                {
                    ["id"] = 331,
                    ["image"] = 571750,
                    ["name"] = "奧特拉賽恩",
                }, -- [5]
                {
                    ["id"] = 332,
                    ["image"] = 571752,
                    ["name"] = "將領黑角",
                }, -- [6]
                {
                    ["id"] = 318,
                    ["image"] = 536056,
                    ["name"] = "死亡之翼的脊椎",
                }, -- [7]
                {
                    ["id"] = 333,
                    ["image"] = 536055,
                    ["name"] = "死亡之翼的狂亂",
                }, -- [8]
            },
        }, -- [6]
        {
            ["id"] = 64,
            ["image"] = 522358,
            ["name"] = "影牙城堡",
            ["bosses"] = {
                {
                    ["id"] = 96,
                    ["image"] = 522205,
                    ["name"] = "艾胥柏利男爵",
                }, -- [1]
                {
                    ["id"] = 97,
                    ["image"] = 522206,
                    ["name"] = "席瓦萊恩男爵",
                }, -- [2]
                {
                    ["id"] = 98,
                    ["image"] = 522213,
                    ["name"] = "指揮官斯普林瓦爾",
                }, -- [3]
                {
                    ["id"] = 99,
                    ["image"] = 522249,
                    ["name"] = "瓦爾登領主",
                }, -- [4]
                {
                    ["id"] = 100,
                    ["image"] = 522247,
                    ["name"] = "高佛雷領主",
                }, -- [5]
            },
        }, -- [7]
        {
            ["id"] = 69,
            ["image"] = 522357,
            ["name"] = "托維爾的失落之城",
            ["bosses"] = {
                {
                    ["id"] = 117,
                    ["image"] = 523205,
                    ["name"] = "胡薩姆將軍",
                }, -- [1]
                {
                    ["id"] = 118,
                    ["image"] = 522246,
                    ["name"] = "鎖喉",
                }, -- [2]
                {
                    ["id"] = 119,
                    ["image"] = 522239,
                    ["name"] = "高階預言者巴瑞姆",
                }, -- [3]
                {
                    ["id"] = 122,
                    ["image"] = 522269,
                    ["name"] = "希亞梅特",
                }, -- [4]
            },
        }, -- [8]
        {
            ["id"] = 186,
            ["image"] = 571755,
            ["name"] = "暮光之時",
            ["bosses"] = {
                {
                    ["id"] = 322,
                    ["image"] = 571743,
                    ["name"] = "阿奇里森",
                }, -- [1]
                {
                    ["id"] = 342,
                    ["image"] = 536054,
                    ["name"] = "阿希拉黎明殺戮者",
                }, -- [2]
                {
                    ["id"] = 341,
                    ["image"] = 536053,
                    ["name"] = "大主教本尼迪塔斯",
                }, -- [3]
            },
        }, -- [9]
        {
            ["id"] = 71,
            ["image"] = 522354,
            ["name"] = "格瑞姆巴托",
            ["bosses"] = {
                {
                    ["id"] = 131,
                    ["image"] = 522227,
                    ["name"] = "昂布里斯將軍",
                }, -- [1]
                {
                    ["id"] = 132,
                    ["image"] = 522226,
                    ["name"] = "鍛造大師瑟隆葛斯",
                }, -- [2]
                {
                    ["id"] = 133,
                    ["image"] = 522218,
                    ["name"] = "德拉卡‧燃影者",
                }, -- [3]
                {
                    ["id"] = 134,
                    ["image"] = 522222,
                    ["name"] = "伊魯達克斯，地獄公爵",
                }, -- [4]
            },
        }, -- [10]
        {
            ["id"] = 63,
            ["image"] = 522352,
            ["name"] = "死亡礦坑",
            ["bosses"] = {
                {
                    ["id"] = 89,
                    ["image"] = 522228,
                    ["name"] = "格魯巴托克",
                }, -- [1]
                {
                    ["id"] = 90,
                    ["image"] = 522234,
                    ["name"] = "赫利克斯‧碎輪者",
                }, -- [2]
                {
                    ["id"] = 91,
                    ["image"] = 522225,
                    ["name"] = "敵人收割者5000型",
                }, -- [3]
                {
                    ["id"] = 92,
                    ["image"] = 522189,
                    ["name"] = "利普斯納爾上將",
                }, -- [4]
                {
                    ["id"] = 93,
                    ["image"] = 522210,
                    ["name"] = "『船長』餅乾",
                }, -- [5]
            },
        }, -- [11]
        {
            ["id"] = 185,
            ["image"] = 571756,
            ["name"] = "永恆之井",
            ["bosses"] = {
                {
                    ["id"] = 290,
                    ["image"] = 536060,
                    ["name"] = "佩洛薩恩",
                }, -- [1]
                {
                    ["id"] = 291,
                    ["image"] = 571747,
                    ["name"] = "艾薩拉女王",
                }, -- [2]
                {
                    ["id"] = 292,
                    ["image"] = 571746,
                    ["name"] = "瑪諾洛斯與瓦羅森",
                }, -- [3]
            },
        }, -- [12]
        {
            ["id"] = 65,
            ["image"] = 522362,
            ["name"] = "海潮王座",
            ["bosses"] = {
                {
                    ["id"] = 101,
                    ["image"] = 522245,
                    ["name"] = "納茲賈爾女士",
                }, -- [1]
                {
                    ["id"] = 102,
                    ["image"] = 522214,
                    ["name"] = "指揮官烏索克，膿瘡王子",
                }, -- [2]
                {
                    ["id"] = 103,
                    ["image"] = 522253,
                    ["name"] = "屈心者哥爾薩",
                }, -- [3]
                {
                    ["id"] = 104,
                    ["image"] = 522259,
                    ["name"] = "歐蘇瑪特",
                }, -- [4]
            },
        }, -- [13]
        {
            ["id"] = 68,
            ["image"] = 522361,
            ["name"] = "漩渦尖塔",
            ["bosses"] = {
                {
                    ["id"] = 114,
                    ["image"] = 522229,
                    ["name"] = "首相伊爾丹",
                }, -- [1]
                {
                    ["id"] = 115,
                    ["image"] = 522192,
                    ["name"] = "艾塔伊洛斯",
                }, -- [2]
                {
                    ["id"] = 116,
                    ["image"] = 522200,
                    ["name"] = "『微風統治者』亞沙德",
                }, -- [3]
            },
        }, -- [14]
        {
            ["id"] = 67,
            ["image"] = 522360,
            ["name"] = "石岩之心",
            ["bosses"] = {
                {
                    ["id"] = 110,
                    ["image"] = 522215,
                    ["name"] = "寇伯拉斯",
                }, -- [1]
                {
                    ["id"] = 111,
                    ["image"] = 522271,
                    ["name"] = "岩革",
                }, -- [2]
                {
                    ["id"] = 112,
                    ["image"] = 522258,
                    ["name"] = "歐茲魯克",
                }, -- [3]
                {
                    ["id"] = 113,
                    ["image"] = 522237,
                    ["name"] = "高階祭司艾吉兒",
                }, -- [4]
            },
        }, -- [15]
        {
            ["id"] = 76,
            ["image"] = 522364,
            ["name"] = "祖爾格拉布",
            ["bosses"] = {
                {
                    ["id"] = 175,
                    ["image"] = 522236,
                    ["name"] = "高階祭司溫諾希斯",
                }, -- [1]
                {
                    ["id"] = 176,
                    ["image"] = 522209,
                    ["name"] = "血領主曼多基爾",
                }, -- [2]
                {
                    ["id"] = 177,
                    ["image"] = 522230,
                    ["name"] = "狂性儲納所:格里雷克",
                }, -- [3]
                {
                    ["id"] = 178,
                    ["image"] = 522233,
                    ["name"] = "狂性儲納所:哈札拉爾",
                }, -- [4]
                {
                    ["id"] = 179,
                    ["image"] = 522263,
                    ["name"] = "狂性儲納所:雷納塔基",
                }, -- [5]
                {
                    ["id"] = 180,
                    ["image"] = 522279,
                    ["name"] = "狂性儲納所:烏蘇雷",
                }, -- [6]
                {
                    ["id"] = 181,
                    ["image"] = 522238,
                    ["name"] = "高階祭司基爾娜拉",
                }, -- [7]
                {
                    ["id"] = 184,
                    ["image"] = 522280,
                    ["name"] = "贊吉爾",
                }, -- [8]
                {
                    ["id"] = 185,
                    ["image"] = 522243,
                    ["name"] = "破神者金度",
                }, -- [9]
            },
        }, -- [16]
        {
            ["id"] = 77,
            ["image"] = 522363,
            ["name"] = "祖阿曼",
            ["bosses"] = {
                {
                    ["id"] = 186,
                    ["image"] = 522190,
                    ["name"] = "阿奇爾森",
                }, -- [1]
                {
                    ["id"] = 187,
                    ["image"] = 522254,
                    ["name"] = "納羅拉克",
                }, -- [2]
                {
                    ["id"] = 188,
                    ["image"] = 522242,
                    ["name"] = "賈納雷",
                }, -- [3]
                {
                    ["id"] = 189,
                    ["image"] = 522231,
                    ["name"] = "哈拉齊",
                }, -- [4]
                {
                    ["id"] = 190,
                    ["image"] = 522235,
                    ["name"] = "妖術領主瑪拉克雷斯",
                }, -- [5]
                {
                    ["id"] = 191,
                    ["image"] = 522217,
                    ["name"] = "達卡拉",
                }, -- [6]
            },
        }, -- [17]
        {
            ["id"] = 184,
            ["image"] = 571754,
            ["name"] = "終焉之刻",
            ["bosses"] = {
                {
                    ["id"] = 340,
                    ["image"] = 571744,
                    ["name"] = "貝恩的回音",
                }, -- [1]
                {
                    ["id"] = 285,
                    ["image"] = 571745,
                    ["name"] = "珍娜的回音",
                }, -- [2]
                {
                    ["id"] = 323,
                    ["image"] = 571748,
                    ["name"] = "希瓦娜斯的回音",
                }, -- [3]
                {
                    ["id"] = 283,
                    ["image"] = 571749,
                    ["name"] = "泰蘭妲的回音",
                }, -- [4]
                {
                    ["id"] = 289,
                    ["image"] = 536059,
                    ["name"] = "姆多茲諾",
                }, -- [5]
            },
        }, -- [18]
        {
            ["id"] = 70,
            ["image"] = 522356,
            ["name"] = "起源大廳",
            ["bosses"] = {
                {
                    ["id"] = 124,
                    ["image"] = 522272,
                    ["name"] = "神殿守護者安胡爾",
                }, -- [1]
                {
                    ["id"] = 125,
                    ["image"] = 522219,
                    ["name"] = "地怒者普塔",
                }, -- [2]
                {
                    ["id"] = 126,
                    ["image"] = 522195,
                    ["name"] = "安拉斐特",
                }, -- [3]
                {
                    ["id"] = 127,
                    ["image"] = 522241,
                    ["name"] = "伊希賽特，魔法造物",
                }, -- [4]
                {
                    ["id"] = 128,
                    ["image"] = 522194,
                    ["name"] = "安姆內，生命造物",
                }, -- [5]
                {
                    ["id"] = 129,
                    ["image"] = 522267,
                    ["name"] = "賽特胥，毀滅造物",
                }, -- [6]
                {
                    ["id"] = 130,
                    ["image"] = 522262,
                    ["name"] = "拉頡，太陽造物",
                }, -- [7]
            },
        }, -- [19]
        {
            ["id"] = 66,
            ["image"] = 522350,
            ["name"] = "黑石洞穴",
            ["bosses"] = {
                {
                    ["id"] = 105,
                    ["image"] = 522266,
                    ["name"] = "羅姆歐格‧裂骨者",
                }, -- [1]
                {
                    ["id"] = 106,
                    ["image"] = 522216,
                    ["name"] = "暮光信使柯爾菈",
                }, -- [2]
                {
                    ["id"] = 107,
                    ["image"] = 522244,
                    ["name"] = "卡爾許‧控鋼者",
                }, -- [3]
                {
                    ["id"] = 108,
                    ["image"] = 522207,
                    ["name"] = "美麗",
                }, -- [4]
                {
                    ["id"] = 109,
                    ["image"] = 522201,
                    ["name"] = "卓越者統領奧希迪厄斯",
                }, -- [5]
            },
        }, -- [20]
    },
    ["暗影之境"] = {
        {
            ["id"] = 1192,
            ["image"] = 3850569,
            ["name"] = "暗影之境",
            ["bosses"] = {
                {
                    ["id"] = 2430,
                    ["image"] = 3752195,
                    ["name"] = "瓦立諾，紀元光輝",
                }, -- [1]
                {
                    ["id"] = 2431,
                    ["image"] = 3752183,
                    ["name"] = "莫塔尼斯",
                }, -- [2]
                {
                    ["id"] = 2432,
                    ["image"] = 3752188,
                    ["name"] = "『恆枝』奧蘭諾莫諾斯",
                }, -- [3]
                {
                    ["id"] = 2433,
                    ["image"] = 3752187,
                    ["name"] = "『淤泥化身』納苟許",
                }, -- [4]
                {
                    ["id"] = 2456,
                    ["image"] = 4071436,
                    ["name"] = "『譴罪折磨者』莫傑斯",
                }, -- [5]
                {
                    ["id"] = 2468,
                    ["image"] = 4529365,
                    ["name"] = "安托斯",
                }, -- [6]
            },
        }, -- [1]
        {
            ["id"] = 1190,
            ["image"] = 3759906,
            ["name"] = "納撒亞城",
            ["bosses"] = {
                {
                    ["id"] = 2393,
                    ["image"] = 3752190,
                    ["name"] = "石嘯翼蝠",
                }, -- [1]
                {
                    ["id"] = 2429,
                    ["image"] = 3753151,
                    ["name"] = "獵人亞提默",
                }, -- [2]
                {
                    ["id"] = 2422,
                    ["image"] = 3753157,
                    ["name"] = "太陽之王的救贖",
                }, -- [3]
                {
                    ["id"] = 2418,
                    ["image"] = 3752156,
                    ["name"] = "工藝師希莫斯",
                }, -- [4]
                {
                    ["id"] = 2428,
                    ["image"] = 3752174,
                    ["name"] = "飢餓破壞者",
                }, -- [5]
                {
                    ["id"] = 2420,
                    ["image"] = 3752178,
                    ["name"] = "茵娜瓦‧暗脈女士",
                }, -- [6]
                {
                    ["id"] = 2426,
                    ["image"] = 3753159,
                    ["name"] = "血之議會",
                }, -- [7]
                {
                    ["id"] = 2394,
                    ["image"] = 3752191,
                    ["name"] = "泥拳",
                }, -- [8]
                {
                    ["id"] = 2425,
                    ["image"] = 3753156,
                    ["name"] = "石源魔軍團將軍",
                }, -- [9]
                {
                    ["id"] = 2424,
                    ["image"] = 3752159,
                    ["name"] = "戴納瑟斯王",
                }, -- [10]
            },
        }, -- [2]
        {
            ["id"] = 1193,
            ["image"] = 4182020,
            ["name"] = "統御聖所",
            ["bosses"] = {
                {
                    ["id"] = 2435,
                    ["image"] = 4071444,
                    ["name"] = "泰拉古魯",
                }, -- [1]
                {
                    ["id"] = 2442,
                    ["image"] = 4071426,
                    ["name"] = "獄主之眼",
                }, -- [2]
                {
                    ["id"] = 2439,
                    ["image"] = 4071445,
                    ["name"] = "九魂使",
                }, -- [3]
                {
                    ["id"] = 2444,
                    ["image"] = 4071439,
                    ["name"] = "耐祖奧的殘骸",
                }, -- [4]
                {
                    ["id"] = 2445,
                    ["image"] = 4071442,
                    ["name"] = "靈魂撕裂者多瑪贊",
                }, -- [5]
                {
                    ["id"] = 2443,
                    ["image"] = 4079051,
                    ["name"] = "苦痛工匠拉茲內爾",
                }, -- [6]
                {
                    ["id"] = 2446,
                    ["image"] = 4071428,
                    ["name"] = "首創者的守護者",
                }, -- [7]
                {
                    ["id"] = 2447,
                    ["image"] = 4071427,
                    ["name"] = "述命者羅卡洛",
                }, -- [8]
                {
                    ["id"] = 2440,
                    ["image"] = 4071435,
                    ["name"] = "科爾蘇加德",
                }, -- [9]
                {
                    ["id"] = 2441,
                    ["image"] = 4071443,
                    ["name"] = "希瓦娜斯‧風行者",
                }, -- [10]
            },
        }, -- [3]
        {
            ["id"] = 1195,
            ["image"] = 4423752,
            ["name"] = "首創者聖塚",
            ["bosses"] = {
                {
                    ["id"] = 2458,
                    ["image"] = 4465340,
                    ["name"] = "戒備守護者",
                }, -- [1]
                {
                    ["id"] = 2465,
                    ["image"] = 4465339,
                    ["name"] = "貪婪掠食者史寇雷斯",
                }, -- [2]
                {
                    ["id"] = 2470,
                    ["image"] = 4423749,
                    ["name"] = "工藝師希莫斯",
                }, -- [3]
                {
                    ["id"] = 2459,
                    ["image"] = 4465333,
                    ["name"] = "墮落神諭者達奧賽恩",
                }, -- [4]
                {
                    ["id"] = 2460,
                    ["image"] = 4465337,
                    ["name"] = "原型萬神殿",
                }, -- [5]
                {
                    ["id"] = 2461,
                    ["image"] = 4465335,
                    ["name"] = "首席設計者利胡敏",
                }, -- [6]
                {
                    ["id"] = 2463,
                    ["image"] = 4423738,
                    ["name"] = "回收者哈隆德魯斯",
                }, -- [7]
                {
                    ["id"] = 2469,
                    ["image"] = 4423747,
                    ["name"] = "安杜因‧烏瑞恩",
                }, -- [8]
                {
                    ["id"] = 2457,
                    ["image"] = 4465336,
                    ["name"] = "驚懼領主",
                }, -- [9]
                {
                    ["id"] = 2467,
                    ["image"] = 4465338,
                    ["name"] = "雷吉隆",
                }, -- [10]
                {
                    ["id"] = 2464,
                    ["image"] = 4465334,
                    ["name"] = "閻獄之主",
                }, -- [11]
            },
        }, -- [4]
        {
            ["id"] = 1194,
            ["image"] = 4182022,
            ["name"] = "『帷幕市集』塔札維許",
            ["bosses"] = {
                {
                    ["id"] = 2437,
                    ["image"] = 4071449,
                    ["name"] = "哨兵佐菲克斯",
                }, -- [1]
                {
                    ["id"] = 2454,
                    ["image"] = 4071447,
                    ["name"] = "大展示廳",
                }, -- [2]
                {
                    ["id"] = 2436,
                    ["image"] = 4071438,
                    ["name"] = "收發室大騷動",
                }, -- [3]
                {
                    ["id"] = 2452,
                    ["image"] = 4071448,
                    ["name"] = "奧彌薩的綠洲",
                }, -- [4]
                {
                    ["id"] = 2451,
                    ["image"] = 4071440,
                    ["name"] = "索阿茲米",
                }, -- [5]
                {
                    ["id"] = 2448,
                    ["image"] = 4071429,
                    ["name"] = "海布藍德",
                }, -- [6]
                {
                    ["id"] = 2449,
                    ["image"] = 4071446,
                    ["name"] = "時光船長鉤尾",
                }, -- [7]
                {
                    ["id"] = 2455,
                    ["image"] = 4071441,
                    ["name"] = "索利亞",
                }, -- [8]
            },
        }, -- [5]
        {
            ["id"] = 1188,
            ["image"] = 3759915,
            ["name"] = "彼界境地",
            ["bosses"] = {
                {
                    ["id"] = 2408,
                    ["image"] = 3752170,
                    ["name"] = "『奪魂者』哈卡",
                }, -- [1]
                {
                    ["id"] = 2409,
                    ["image"] = 3752193,
                    ["name"] = "曼納斯頓夫婦",
                }, -- [2]
                {
                    ["id"] = 2398,
                    ["image"] = 3753147,
                    ["name"] = "商人希夏",
                }, -- [3]
                {
                    ["id"] = 2410,
                    ["image"] = 3752184,
                    ["name"] = "繆薩拉",
                }, -- [4]
            },
        }, -- [6]
        {
            ["id"] = 1186,
            ["image"] = 3759913,
            ["name"] = "晉升之巔",
            ["bosses"] = {
                {
                    ["id"] = 2399,
                    ["image"] = 3752177,
                    ["name"] = "金塔拉",
                }, -- [1]
                {
                    ["id"] = 2416,
                    ["image"] = 3752198,
                    ["name"] = "溫圖納斯",
                }, -- [2]
                {
                    ["id"] = 2414,
                    ["image"] = 3752189,
                    ["name"] = "奧利菲翁",
                }, -- [3]
                {
                    ["id"] = 2412,
                    ["image"] = 3752160,
                    ["name"] = "『猜疑楷模』德沃絲",
                }, -- [4]
            },
        }, -- [7]
        {
            ["id"] = 1182,
            ["image"] = 3759910,
            ["name"] = "死靈戰地",
            ["bosses"] = {
                {
                    ["id"] = 2395,
                    ["image"] = 3752157,
                    ["name"] = "荒骨",
                }, -- [1]
                {
                    ["id"] = 2391,
                    ["image"] = 3753146,
                    ["name"] = "『收割者』亞瑪斯",
                }, -- [2]
                {
                    ["id"] = 2392,
                    ["image"] = 3753158,
                    ["name"] = "縫補師縫肉",
                }, -- [3]
                {
                    ["id"] = 2396,
                    ["image"] = 3753155,
                    ["name"] = "『霜縛者』納爾索",
                }, -- [4]
            },
        }, -- [8]
        {
            ["id"] = 1184,
            ["image"] = 3759909,
            ["name"] = "特那希迷霧",
            ["bosses"] = {
                {
                    ["id"] = 2400,
                    ["image"] = 3753152,
                    ["name"] = "英拉馬洛克",
                }, -- [1]
                {
                    ["id"] = 2402,
                    ["image"] = 3752181,
                    ["name"] = "喚霧者",
                }, -- [2]
                {
                    ["id"] = 2405,
                    ["image"] = 3752194,
                    ["name"] = "崔朵瓦",
                }, -- [3]
            },
        }, -- [9]
        {
            ["id"] = 1183,
            ["image"] = 3759911,
            ["name"] = "瘟疫之臨",
            ["bosses"] = {
                {
                    ["id"] = 2419,
                    ["image"] = 3752168,
                    ["name"] = "葛洛格羅",
                }, -- [1]
                {
                    ["id"] = 2403,
                    ["image"] = 3752162,
                    ["name"] = "伊克思博士",
                }, -- [2]
                {
                    ["id"] = 2423,
                    ["image"] = 3752163,
                    ["name"] = "多米娜‧毒刃",
                }, -- [3]
                {
                    ["id"] = 2404,
                    ["image"] = 3752180,
                    ["name"] = "藩侯史特拉達瑪",
                }, -- [4]
            },
        }, -- [10]
        {
            ["id"] = 1187,
            ["image"] = 3759914,
            ["name"] = "苦痛劇場",
            ["bosses"] = {
                {
                    ["id"] = 2397,
                    ["image"] = 3752153,
                    ["name"] = "蔑視挑戰者",
                }, -- [1]
                {
                    ["id"] = 2401,
                    ["image"] = 3752169,
                    ["name"] = "肉排",
                }, -- [2]
                {
                    ["id"] = 2390,
                    ["image"] = 3752199,
                    ["name"] = "『未逝者』薩夫",
                }, -- [3]
                {
                    ["id"] = 2389,
                    ["image"] = 3753154,
                    ["name"] = "庫薩洛克",
                }, -- [4]
                {
                    ["id"] = 2417,
                    ["image"] = 3752182,
                    ["name"] = "『不朽女皇』莫瑞莎",
                }, -- [5]
            },
        }, -- [11]
        {
            ["id"] = 1189,
            ["image"] = 3759912,
            ["name"] = "血紅深淵",
            ["bosses"] = {
                {
                    ["id"] = 2388,
                    ["image"] = 3753153,
                    ["name"] = "貪婪的奎西斯",
                }, -- [1]
                {
                    ["id"] = 2415,
                    ["image"] = 3753148,
                    ["name"] = "處決者塔沃德",
                }, -- [2]
                {
                    ["id"] = 2421,
                    ["image"] = 3753149,
                    ["name"] = "總監督者貝莉亞",
                }, -- [3]
                {
                    ["id"] = 2407,
                    ["image"] = 3752167,
                    ["name"] = "凱厄將軍",
                }, -- [4]
            },
        }, -- [12]
        {
            ["id"] = 1185,
            ["image"] = 3759908,
            ["name"] = "贖罪之殿",
            ["bosses"] = {
                {
                    ["id"] = 2406,
                    ["image"] = 3752171,
                    ["name"] = "『罪污巨人』哈奇厄斯",
                }, -- [1]
                {
                    ["id"] = 2387,
                    ["image"] = 3752165,
                    ["name"] = "艾可隆",
                }, -- [2]
                {
                    ["id"] = 2411,
                    ["image"] = 3753150,
                    ["name"] = "至高判決者阿利茲",
                }, -- [3]
                {
                    ["id"] = 2413,
                    ["image"] = 3752179,
                    ["name"] = "宮務大臣",
                }, -- [4]
            },
        }, -- [13]
    },
    ["決戰艾澤拉斯"] = {
        {
            ["id"] = 1028,
            ["image"] = 2178279,
            ["name"] = "艾澤拉斯",
            ["bosses"] = {
                {
                    ["id"] = 2378,
                    ["image"] = 3284400,
                    ["name"] = "杉札拉女皇",
                }, -- [1]
                {
                    ["id"] = 2381,
                    ["image"] = 3284401,
                    ["name"] = "『碎地者』巫克拉茲",
                }, -- [2]
                {
                    ["id"] = 2363,
                    ["image"] = 3012063,
                    ["name"] = "威克瑪拉",
                }, -- [3]
                {
                    ["id"] = 2362,
                    ["image"] = 3012061,
                    ["name"] = "『縛魂者』烏爾瑪斯",
                }, -- [4]
                {
                    ["id"] = 2329,
                    ["image"] = 2497782,
                    ["name"] = "『森林之王』伊弗斯",
                }, -- [5]
                {
                    ["id"] = 2212,
                    ["image"] = 2176752,
                    ["name"] = "雄獅之吼",
                }, -- [6]
                {
                    ["id"] = 2139,
                    ["image"] = 2176755,
                    ["name"] = "特薩恩",
                }, -- [7]
                {
                    ["id"] = 2141,
                    ["image"] = 2176734,
                    ["name"] = "吉亞拉克",
                }, -- [8]
                {
                    ["id"] = 2197,
                    ["image"] = 2176731,
                    ["name"] = "冰雹傀儡",
                }, -- [9]
                {
                    ["id"] = 2198,
                    ["image"] = 2176760,
                    ["name"] = "戰爭使者葉南茲",
                }, -- [10]
                {
                    ["id"] = 2199,
                    ["image"] = 2176716,
                    ["name"] = "艾索埃瑟斯，飛翼颱風",
                }, -- [11]
                {
                    ["id"] = 2210,
                    ["image"] = 2176723,
                    ["name"] = "『噬漠者』夸勞克",
                }, -- [12]
            },
        }, -- [1]
        {
            ["id"] = 1031,
            ["image"] = 2178277,
            ["name"] = "奧迪爾",
            ["bosses"] = {
                {
                    ["id"] = 2168,
                    ["image"] = 2176749,
                    ["name"] = "塔羅克",
                }, -- [1]
                {
                    ["id"] = 2167,
                    ["image"] = 2176741,
                    ["name"] = "母親大人",
                }, -- [2]
                {
                    ["id"] = 2146,
                    ["image"] = 2176725,
                    ["name"] = "噬臭者",
                }, -- [3]
                {
                    ["id"] = 2169,
                    ["image"] = 2176761,
                    ["name"] = "『恩若司信使』札克沃茲",
                }, -- [4]
                {
                    ["id"] = 2166,
                    ["image"] = 2176757,
                    ["name"] = "維克提斯",
                }, -- [5]
                {
                    ["id"] = 2195,
                    ["image"] = 2176762,
                    ["name"] = "重生的祖爾",
                }, -- [6]
                {
                    ["id"] = 2194,
                    ["image"] = 2176742,
                    ["name"] = "揭滅者謎思拉克斯",
                }, -- [7]
                {
                    ["id"] = 2147,
                    ["image"] = 2176728,
                    ["name"] = "古翰",
                }, -- [8]
            },
        }, -- [2]
        {
            ["id"] = 1176,
            ["image"] = 2482729,
            ["name"] = "達薩亞洛之戰",
            ["bosses"] = {
                {
                    ["id"] = 2333,
                    ["image"] = 2497778,
                    ["name"] = "聖光勇士",
                }, -- [1]
                {
                    ["id"] = 2325,
                    ["image"] = 2497783,
                    ["name"] = "『森林之王』葛隆",
                }, -- [2]
                {
                    ["id"] = 2341,
                    ["image"] = 2529383,
                    ["name"] = "碧火大師",
                }, -- [3]
                {
                    ["id"] = 2342,
                    ["image"] = 2497790,
                    ["name"] = "金輝魔靈",
                }, -- [4]
                {
                    ["id"] = 2330,
                    ["image"] = 2497779,
                    ["name"] = "天選者衛隊",
                }, -- [5]
                {
                    ["id"] = 2335,
                    ["image"] = 2497784,
                    ["name"] = "神王拉斯塔哈",
                }, -- [6]
                {
                    ["id"] = 2334,
                    ["image"] = 2497788,
                    ["name"] = "大工匠梅卡托克",
                }, -- [7]
                {
                    ["id"] = 2337,
                    ["image"] = 2497786,
                    ["name"] = "風暴屏障封鎖部隊",
                }, -- [8]
                {
                    ["id"] = 2343,
                    ["image"] = 2497785,
                    ["name"] = "珍娜‧普勞德摩爾女士",
                }, -- [9]
            },
        }, -- [3]
        {
            ["id"] = 1177,
            ["image"] = 2498193,
            ["name"] = "風暴邪淵",
            ["bosses"] = {
                {
                    ["id"] = 2328,
                    ["image"] = 2497795,
                    ["name"] = "不息者秘教",
                }, -- [1]
                {
                    ["id"] = 2332,
                    ["image"] = 2497794,
                    ["name"] = "『虛無使者』烏納特",
                }, -- [2]
            },
        }, -- [4]
        {
            ["id"] = 1179,
            ["image"] = 3025320,
            ["name"] = "永恆宮殿",
            ["bosses"] = {
                {
                    ["id"] = 2352,
                    ["image"] = 3012047,
                    ["name"] = "深淵指揮官希瓦菈",
                }, -- [1]
                {
                    ["id"] = 2347,
                    ["image"] = 3012062,
                    ["name"] = "黑水巨鰻",
                }, -- [2]
                {
                    ["id"] = 2353,
                    ["image"] = 3012058,
                    ["name"] = "艾薩拉光輝",
                }, -- [3]
                {
                    ["id"] = 2354,
                    ["image"] = 3012055,
                    ["name"] = "艾胥凡女士",
                }, -- [4]
                {
                    ["id"] = 2351,
                    ["image"] = 3012054,
                    ["name"] = "歐格澤亞",
                }, -- [5]
                {
                    ["id"] = 2359,
                    ["image"] = 3012057,
                    ["name"] = "女王法庭",
                }, -- [6]
                {
                    ["id"] = 2349,
                    ["image"] = 3012064,
                    ["name"] = "『奈奧羅薩使者』札奎爾",
                }, -- [7]
                {
                    ["id"] = 2361,
                    ["image"] = 3012056,
                    ["name"] = "艾薩拉女王",
                }, -- [8]
            },
        }, -- [5]
        {
            ["id"] = 1180,
            ["image"] = 3221463,
            ["name"] = "奈奧羅薩，甦醒之城",
            ["bosses"] = {
                {
                    ["id"] = 2368,
                    ["image"] = 3256385,
                    ["name"] = "『黑暗帝王』怒西昂",
                }, -- [1]
                {
                    ["id"] = 2365,
                    ["image"] = 3256380,
                    ["name"] = "默特",
                }, -- [2]
                {
                    ["id"] = 2369,
                    ["image"] = 3256384,
                    ["name"] = "預言者斯奇崔",
                }, -- [3]
                {
                    ["id"] = 2377,
                    ["image"] = 3256386,
                    ["name"] = "黑暗審判官克珊內絲",
                }, -- [4]
                {
                    ["id"] = 2372,
                    ["image"] = 3256378,
                    ["name"] = "蟲群首腦",
                }, -- [5]
                {
                    ["id"] = 2367,
                    ["image"] = 3256383,
                    ["name"] = "『無盡飢餓』薩德哈",
                }, -- [6]
                {
                    ["id"] = 2373,
                    ["image"] = 3256377,
                    ["name"] = "卓雷阿葛斯",
                }, -- [7]
                {
                    ["id"] = 2374,
                    ["image"] = 3256379,
                    ["name"] = "『腐化重生』伊蓋諾斯",
                }, -- [8]
                {
                    ["id"] = 2370,
                    ["image"] = 3257677,
                    ["name"] = "薇希歐娜",
                }, -- [9]
                {
                    ["id"] = 2364,
                    ["image"] = 3256382,
                    ["name"] = "『掠心喪神』萊公",
                }, -- [10]
                {
                    ["id"] = 2366,
                    ["image"] = 3256376,
                    ["name"] = "恩若司的外殼",
                }, -- [11]
                {
                    ["id"] = 2375,
                    ["image"] = 3256381,
                    ["name"] = "『腐化者』恩若司",
                }, -- [12]
            },
        }, -- [6]
        {
            ["id"] = 1021,
            ["image"] = 2178278,
            ["name"] = "威奎斯特莊園",
            ["bosses"] = {
                {
                    ["id"] = 2125,
                    ["image"] = 2176732,
                    ["name"] = "禍心女巫三姊妹",
                }, -- [1]
                {
                    ["id"] = 2126,
                    ["image"] = 2176747,
                    ["name"] = "縛魂巨怪",
                }, -- [2]
                {
                    ["id"] = 2127,
                    ["image"] = 2176744,
                    ["name"] = "『貪吃鬼』雷爾",
                }, -- [3]
                {
                    ["id"] = 2128,
                    ["image"] = 2176736,
                    ["name"] = "威奎斯特領主和夫人",
                }, -- [4]
                {
                    ["id"] = 2129,
                    ["image"] = 2176729,
                    ["name"] = "勾拉圖爾",
                }, -- [5]
            },
        }, -- [7]
        {
            ["id"] = 1022,
            ["image"] = 2178275,
            ["name"] = "幽腐深窟",
            ["bosses"] = {
                {
                    ["id"] = 2157,
                    ["image"] = 2176724,
                    ["name"] = "黎克沙長老",
                }, -- [1]
                {
                    ["id"] = 2131,
                    ["image"] = 2176719,
                    ["name"] = "感染者岩喉",
                }, -- [2]
                {
                    ["id"] = 2130,
                    ["image"] = 2176748,
                    ["name"] = "喚孢者贊查",
                }, -- [3]
                {
                    ["id"] = 2158,
                    ["image"] = 2176756,
                    ["name"] = "無縛異怪",
                }, -- [4]
            },
        }, -- [8]
        {
            ["id"] = 1002,
            ["image"] = 2178276,
            ["name"] = "托達戈爾",
            ["bosses"] = {
                {
                    ["id"] = 2097,
                    ["image"] = 2176753,
                    ["name"] = "沙后",
                }, -- [1]
                {
                    ["id"] = 2098,
                    ["image"] = 2176733,
                    ["name"] = "傑斯‧嚎里斯",
                }, -- [2]
                {
                    ["id"] = 2099,
                    ["image"] = 2176735,
                    ["name"] = "騎士隊長瓦萊麗",
                }, -- [3]
                {
                    ["id"] = 2096,
                    ["image"] = 2176743,
                    ["name"] = "監督者寇格斯",
                }, -- [4]
            },
        }, -- [9]
        {
            ["id"] = 1012,
            ["image"] = 2178274,
            ["name"] = "晶喜鎮！",
            ["bosses"] = {
                {
                    ["id"] = 2109,
                    ["image"] = 2176718,
                    ["name"] = "投幣式群眾鎮壓機器人",
                }, -- [1]
                {
                    ["id"] = 2114,
                    ["image"] = 2176714,
                    ["name"] = "艾澤洛克",
                }, -- [2]
                {
                    ["id"] = 2115,
                    ["image"] = 2176745,
                    ["name"] = "芮克莎‧熔焰",
                }, -- [3]
                {
                    ["id"] = 2116,
                    ["image"] = 2176740,
                    ["name"] = "瑞茲當克老大",
                }, -- [4]
            },
        }, -- [10]
        {
            ["id"] = 1178,
            ["image"] = 3025325,
            ["name"] = "機械岡行動",
            ["bosses"] = {
                {
                    ["id"] = 2357,
                    ["image"] = 3012050,
                    ["name"] = "勾巴馬克王",
                }, -- [1]
                {
                    ["id"] = 2358,
                    ["image"] = 3012048,
                    ["name"] = "髒克",
                }, -- [2]
                {
                    ["id"] = 2360,
                    ["image"] = 3012059,
                    ["name"] = "崔克西和奈洛",
                }, -- [3]
                {
                    ["id"] = 2355,
                    ["image"] = 3012049,
                    ["name"] = "HK-8型空中壓制單位",
                }, -- [4]
                {
                    ["id"] = 2336,
                    ["image"] = 3012060,
                    ["name"] = "暴力機兵",
                }, -- [5]
                {
                    ["id"] = 2339,
                    ["image"] = 3012052,
                    ["name"] = "K.U.-J.0.機械犬",
                }, -- [6]
                {
                    ["id"] = 2348,
                    ["image"] = 3012053,
                    ["name"] = "機械工花園",
                }, -- [7]
                {
                    ["id"] = 2331,
                    ["image"] = 3012051,
                    ["name"] = "機械岡國王",
                }, -- [8]
            },
        }, -- [11]
        {
            ["id"] = 1023,
            ["image"] = 2178272,
            ["name"] = "波拉勒斯圍城戰",
            ["bosses"] = {
                {
                    ["id"] = 2133,
                    ["image"] = 2176746,
                    ["name"] = "班布里吉中士",
                }, -- [1]
                {
                    ["id"] = 2173,
                    ["image"] = 2176722,
                    ["name"] = "恐怖船長洛克伍德",
                }, -- [2]
                {
                    ["id"] = 2134,
                    ["image"] = 2176730,
                    ["name"] = "哈達爾‧黑淵",
                }, -- [3]
                {
                    ["id"] = 2140,
                    ["image"] = 2176758,
                    ["name"] = "維克高斯",
                }, -- [4]
            },
        }, -- [12]
        {
            ["id"] = 1030,
            ["image"] = 2178273,
            ["name"] = "瑟沙利斯神廟",
            ["bosses"] = {
                {
                    ["id"] = 2142,
                    ["image"] = 2176710,
                    ["name"] = "阿德利斯和艾斯匹",
                }, -- [1]
                {
                    ["id"] = 2143,
                    ["image"] = 2176739,
                    ["name"] = "莫芮克莎",
                }, -- [2]
                {
                    ["id"] = 2144,
                    ["image"] = 2176727,
                    ["name"] = "加瓦茲特",
                }, -- [3]
                {
                    ["id"] = 2145,
                    ["image"] = 2176713,
                    ["name"] = "瑟沙利斯化身",
                }, -- [4]
            },
        }, -- [13]
        {
            ["id"] = 1001,
            ["image"] = 1778893,
            ["name"] = "自由港",
            ["bosses"] = {
                {
                    ["id"] = 2102,
                    ["image"] = 1778351,
                    ["name"] = "天空隊長克拉格",
                }, -- [1]
                {
                    ["id"] = 2093,
                    ["image"] = 1778346,
                    ["name"] = "船長議會",
                }, -- [2]
                {
                    ["id"] = 2094,
                    ["image"] = 1778350,
                    ["name"] = "藏寶競技場",
                }, -- [3]
                {
                    ["id"] = 2095,
                    ["image"] = 1778347,
                    ["name"] = "哈蘭‧史威特",
                }, -- [4]
            },
        }, -- [14]
        {
            ["id"] = 1041,
            ["image"] = 2178269,
            ["name"] = "諸王之眠",
            ["bosses"] = {
                {
                    ["id"] = 2165,
                    ["image"] = 2176751,
                    ["name"] = "黃金風蛇",
                }, -- [1]
                {
                    ["id"] = 2171,
                    ["image"] = 2176738,
                    ["name"] = "『墓葬者』瑪欽巴",
                }, -- [2]
                {
                    ["id"] = 2170,
                    ["image"] = 2176750,
                    ["name"] = "部族議會",
                }, -- [3]
                {
                    ["id"] = 2172,
                    ["image"] = 2176720,
                    ["name"] = "達薩，開國神王",
                }, -- [4]
            },
        }, -- [15]
        {
            ["id"] = 968,
            ["image"] = 1778892,
            ["name"] = "阿塔達薩",
            ["bosses"] = {
                {
                    ["id"] = 2082,
                    ["image"] = 1778348,
                    ["name"] = "女祭司艾露薩",
                }, -- [1]
                {
                    ["id"] = 2036,
                    ["image"] = 1778352,
                    ["name"] = "沃卡爾",
                }, -- [2]
                {
                    ["id"] = 2083,
                    ["image"] = 1778349,
                    ["name"] = "瑞贊",
                }, -- [3]
                {
                    ["id"] = 2030,
                    ["image"] = 1778353,
                    ["name"] = "亞茲瑪",
                }, -- [4]
            },
        }, -- [16]
        {
            ["id"] = 1036,
            ["image"] = 2178271,
            ["name"] = "風暴聖壇",
            ["bosses"] = {
                {
                    ["id"] = 2153,
                    ["image"] = 2176712,
                    ["name"] = "渦庫瑟",
                }, -- [1]
                {
                    ["id"] = 2154,
                    ["image"] = 2176754,
                    ["name"] = "浪潮賢者議會",
                }, -- [2]
                {
                    ["id"] = 2155,
                    ["image"] = 2176737,
                    ["name"] = "斯陀頌恩領主",
                }, -- [3]
                {
                    ["id"] = 2156,
                    ["image"] = 2176759,
                    ["name"] = "『低語者』沃澤斯",
                }, -- [4]
            },
        }, -- [17]
    },
    ["燃燒的遠征"] = {
        {
            ["id"] = 745,
            ["image"] = 1396584,
            ["name"] = "卡拉贊",
            ["bosses"] = {
                {
                    ["id"] = 1552,
                    ["image"] = 1385766,
                    ["name"] = "佣人區",
                }, -- [1]
                {
                    ["id"] = 1553,
                    ["image"] = 1378965,
                    ["name"] = "獵人阿圖曼",
                }, -- [2]
                {
                    ["id"] = 1554,
                    ["image"] = 1378999,
                    ["name"] = "摩洛斯",
                }, -- [3]
                {
                    ["id"] = 1555,
                    ["image"] = 1378997,
                    ["name"] = "貞潔聖女",
                }, -- [4]
                {
                    ["id"] = 1556,
                    ["image"] = 1385758,
                    ["name"] = "歌劇大廳",
                }, -- [5]
                {
                    ["id"] = 1557,
                    ["image"] = 1379020,
                    ["name"] = "館長",
                }, -- [6]
                {
                    ["id"] = 1559,
                    ["image"] = 1379012,
                    ["name"] = "埃蘭之影",
                }, -- [7]
                {
                    ["id"] = 1560,
                    ["image"] = 1379017,
                    ["name"] = "泰瑞斯提安‧疫蹄",
                }, -- [8]
                {
                    ["id"] = 1561,
                    ["image"] = 1379002,
                    ["name"] = "尼德斯",
                }, -- [9]
                {
                    ["id"] = 1764,
                    ["image"] = 1385724,
                    ["name"] = "西洋棋事件",
                }, -- [10]
                {
                    ["id"] = 1563,
                    ["image"] = 1379006,
                    ["name"] = "莫克札王子",
                }, -- [11]
            },
        }, -- [1]
        {
            ["id"] = 746,
            ["image"] = 1396582,
            ["name"] = "戈魯爾之巢",
            ["bosses"] = {
                {
                    ["id"] = 1564,
                    ["image"] = 1378985,
                    ["name"] = "大君王莫卡爾",
                }, -- [1]
                {
                    ["id"] = 1565,
                    ["image"] = 1378982,
                    ["name"] = "弒龍者戈魯爾",
                }, -- [2]
            },
        }, -- [2]
        {
            ["id"] = 747,
            ["image"] = 1396585,
            ["name"] = "瑪瑟里頓的巢穴",
            ["bosses"] = {
                {
                    ["id"] = 1566,
                    ["image"] = 1378996,
                    ["name"] = "瑪瑟里頓",
                }, -- [1]
            },
        }, -- [3]
        {
            ["id"] = 748,
            ["image"] = 608199,
            ["name"] = "毒蛇神殿洞穴",
            ["bosses"] = {
                {
                    ["id"] = 1567,
                    ["image"] = 1385741,
                    ["name"] = "不穩定者海卓司",
                }, -- [1]
                {
                    ["id"] = 1568,
                    ["image"] = 1385768,
                    ["name"] = "海底潛伏者",
                }, -- [2]
                {
                    ["id"] = 1569,
                    ["image"] = 1385751,
                    ["name"] = "『盲目者』李奧薩拉斯",
                }, -- [3]
                {
                    ["id"] = 1570,
                    ["image"] = 1385729,
                    ["name"] = "深淵之王卡拉薩瑞斯",
                }, -- [4]
                {
                    ["id"] = 1571,
                    ["image"] = 1385756,
                    ["name"] = "莫洛葛利姆‧潮行者",
                }, -- [5]
                {
                    ["id"] = 1572,
                    ["image"] = 1385750,
                    ["name"] = "瓦許女士",
                }, -- [6]
            },
        }, -- [4]
        {
            ["id"] = 749,
            ["image"] = 608218,
            ["name"] = "風暴核心",
            ["bosses"] = {
                {
                    ["id"] = 1573,
                    ["image"] = 1385712,
                    ["name"] = "歐爾",
                }, -- [1]
                {
                    ["id"] = 1574,
                    ["image"] = 1385772,
                    ["name"] = "虛無劫奪者",
                }, -- [2]
                {
                    ["id"] = 1575,
                    ["image"] = 1385739,
                    ["name"] = "高階星術師索拉瑞恩",
                }, -- [3]
                {
                    ["id"] = 1576,
                    ["image"] = 607669,
                    ["name"] = "凱爾薩斯‧逐日者",
                }, -- [4]
            },
        }, -- [5]
        {
            ["id"] = 750,
            ["image"] = 608198,
            ["name"] = "海加爾山之戰",
            ["bosses"] = {
                {
                    ["id"] = 1577,
                    ["image"] = 1385762,
                    ["name"] = "瑞齊‧凜冬",
                }, -- [1]
                {
                    ["id"] = 1578,
                    ["image"] = 1385714,
                    ["name"] = "安納塞隆",
                }, -- [2]
                {
                    ["id"] = 1579,
                    ["image"] = 1385745,
                    ["name"] = "卡茲洛加",
                }, -- [3]
                {
                    ["id"] = 1580,
                    ["image"] = 1385719,
                    ["name"] = "亞茲加洛",
                }, -- [4]
                {
                    ["id"] = 1581,
                    ["image"] = 1385716,
                    ["name"] = "阿克蒙德",
                }, -- [5]
            },
        }, -- [6]
        {
            ["id"] = 751,
            ["image"] = 1396579,
            ["name"] = "黑暗神廟",
            ["bosses"] = {
                {
                    ["id"] = 1582,
                    ["image"] = 1378986,
                    ["name"] = "高階督軍納珍塔斯",
                }, -- [1]
                {
                    ["id"] = 1583,
                    ["image"] = 1379016,
                    ["name"] = "瑟普莫斯",
                }, -- [2]
                {
                    ["id"] = 1584,
                    ["image"] = 1379011,
                    ["name"] = "阿卡瑪的黑暗面",
                }, -- [3]
                {
                    ["id"] = 1585,
                    ["image"] = 1379018,
                    ["name"] = "泰朗‧血魔",
                }, -- [4]
                {
                    ["id"] = 1586,
                    ["image"] = 1378983,
                    ["name"] = "葛塔格‧血沸",
                }, -- [5]
                {
                    ["id"] = 1587,
                    ["image"] = 1385764,
                    ["name"] = "靈魂聖匣",
                }, -- [6]
                {
                    ["id"] = 1588,
                    ["image"] = 1379000,
                    ["name"] = "薩拉茲女士",
                }, -- [7]
                {
                    ["id"] = 1589,
                    ["image"] = 1385743,
                    ["name"] = "伊利達瑞議會",
                }, -- [8]
                {
                    ["id"] = 1590,
                    ["image"] = 1378987,
                    ["name"] = "伊利丹‧怒風",
                }, -- [9]
            },
        }, -- [7]
        {
            ["id"] = 752,
            ["image"] = 1396592,
            ["name"] = "太陽之井高地",
            ["bosses"] = {
                {
                    ["id"] = 1591,
                    ["image"] = 1385744,
                    ["name"] = "卡雷苟斯",
                }, -- [1]
                {
                    ["id"] = 1592,
                    ["image"] = 1385722,
                    ["name"] = "布魯托魯斯",
                }, -- [2]
                {
                    ["id"] = 1593,
                    ["image"] = 1385730,
                    ["name"] = "魔龍謎霧",
                }, -- [3]
                {
                    ["id"] = 1594,
                    ["image"] = 1390438,
                    ["name"] = "埃雷達爾雙子",
                }, -- [4]
                {
                    ["id"] = 1595,
                    ["image"] = 1385757,
                    ["name"] = "莫魯",
                }, -- [5]
                {
                    ["id"] = 1596,
                    ["image"] = 1385746,
                    ["name"] = "基爾加丹",
                }, -- [6]
            },
        }, -- [8]
        {
            ["id"] = 254,
            ["image"] = 608218,
            ["name"] = "亞克崔茲",
            ["bosses"] = {
                {
                    ["id"] = 548,
                    ["image"] = 607823,
                    ["name"] = "無約束的希瑞奇斯",
                }, -- [1]
                {
                    ["id"] = 549,
                    ["image"] = 607574,
                    ["name"] = "末日預言者達利亞",
                }, -- [2]
                {
                    ["id"] = 550,
                    ["image"] = 607820,
                    ["name"] = "怒鐮者索寇斯瑞特",
                }, -- [3]
                {
                    ["id"] = 551,
                    ["image"] = 607635,
                    ["name"] = "先驅者史蓋力司",
                }, -- [4]
            },
        }, -- [9]
        {
            ["id"] = 249,
            ["image"] = 608208,
            ["name"] = "博學者殿堂",
            ["bosses"] = {
                {
                    ["id"] = 530,
                    ["image"] = 607767,
                    ["name"] = "賽林‧炎心",
                }, -- [1]
                {
                    ["id"] = 531,
                    ["image"] = 607806,
                    ["name"] = "維克索魯斯",
                }, -- [2]
                {
                    ["id"] = 532,
                    ["image"] = 607742,
                    ["name"] = "女牧師戴利莎",
                }, -- [3]
                {
                    ["id"] = 533,
                    ["image"] = 607669,
                    ["name"] = "凱爾薩斯‧逐日者",
                }, -- [4]
            },
        }, -- [10]
        {
            ["id"] = 248,
            ["image"] = 608207,
            ["name"] = "地獄火壁壘",
            ["bosses"] = {
                {
                    ["id"] = 527,
                    ["image"] = 607817,
                    ["name"] = "看護者卡爾古瑪",
                }, -- [1]
                {
                    ["id"] = 528,
                    ["image"] = 607734,
                    ["name"] = "『無疤者』歐瑪爾",
                }, -- [2]
                {
                    ["id"] = 529,
                    ["image"] = 607803,
                    ["name"] = "『信使』維斯路登",
                }, -- [3]
            },
        }, -- [11]
        {
            ["id"] = 252,
            ["image"] = 608193,
            ["name"] = "塞司克大廳",
            ["bosses"] = {
                {
                    ["id"] = 541,
                    ["image"] = 607583,
                    ["name"] = "暗織者希斯",
                }, -- [1]
                {
                    ["id"] = 543,
                    ["image"] = 607780,
                    ["name"] = "鷹王伊奇斯",
                }, -- [2]
            },
        }, -- [12]
        {
            ["id"] = 247,
            ["image"] = 608193,
            ["name"] = "奧奇奈地穴",
            ["bosses"] = {
                {
                    ["id"] = 523,
                    ["image"] = 607771,
                    ["name"] = "死亡看守者辛瑞克",
                }, -- [1]
                {
                    ["id"] = 524,
                    ["image"] = 607600,
                    ["name"] = "瑪拉達爾主教",
                }, -- [2]
            },
        }, -- [13]
        {
            ["id"] = 260,
            ["image"] = 608199,
            ["name"] = "奴隸監獄",
            ["bosses"] = {
                {
                    ["id"] = 570,
                    ["image"] = 607715,
                    ["name"] = "『背叛者』曼紐",
                }, -- [1]
                {
                    ["id"] = 571,
                    ["image"] = 607759,
                    ["name"] = "『爆裂者』洛克瑪",
                }, -- [2]
                {
                    ["id"] = 572,
                    ["image"] = 607750,
                    ["name"] = "奎克米瑞",
                }, -- [3]
            },
        }, -- [14]
        {
            ["id"] = 251,
            ["image"] = 608198,
            ["name"] = "希爾斯布萊德丘陵舊址",
            ["bosses"] = {
                {
                    ["id"] = 538,
                    ["image"] = 607689,
                    ["name"] = "中尉崔克",
                }, -- [1]
                {
                    ["id"] = 539,
                    ["image"] = 607561,
                    ["name"] = "史卡拉克上尉",
                }, -- [2]
                {
                    ["id"] = 540,
                    ["image"] = 607596,
                    ["name"] = "紀元狩獵者",
                }, -- [3]
            },
        }, -- [15]
        {
            ["id"] = 253,
            ["image"] = 608193,
            ["name"] = "暗影迷宮",
            ["bosses"] = {
                {
                    ["id"] = 544,
                    ["image"] = 607536,
                    ["name"] = "海爾瑪大使",
                }, -- [1]
                {
                    ["id"] = 545,
                    ["image"] = 607555,
                    ["name"] = "『煽動者』黑心",
                }, -- [2]
                {
                    ["id"] = 546,
                    ["image"] = 607625,
                    ["name"] = "宗師瓦皮歐",
                }, -- [3]
                {
                    ["id"] = 547,
                    ["image"] = 607720,
                    ["name"] = "莫爾墨",
                }, -- [4]
            },
        }, -- [16]
        {
            ["id"] = 250,
            ["image"] = 608193,
            ["name"] = "法力墓地",
            ["bosses"] = {
                {
                    ["id"] = 534,
                    ["image"] = 607738,
                    ["name"] = "班提蒙尼厄斯",
                }, -- [1]
                {
                    ["id"] = 535,
                    ["image"] = 607782,
                    ["name"] = "塔瓦洛克",
                }, -- [2]
                {
                    ["id"] = 537,
                    ["image"] = 607726,
                    ["name"] = "奈薩斯王子薩法爾",
                }, -- [3]
            },
        }, -- [17]
        {
            ["id"] = 257,
            ["image"] = 608218,
            ["name"] = "波塔尼卡",
            ["bosses"] = {
                {
                    ["id"] = 558,
                    ["image"] = 607570,
                    ["name"] = "指揮官薩瑞尼斯",
                }, -- [1]
                {
                    ["id"] = 559,
                    ["image"] = 607641,
                    ["name"] = "大植物學家費瑞衛恩",
                }, -- [2]
                {
                    ["id"] = 560,
                    ["image"] = 607794,
                    ["name"] = "『看管者』索古林",
                }, -- [3]
                {
                    ["id"] = 561,
                    ["image"] = 607683,
                    ["name"] = "拉杰",
                }, -- [4]
                {
                    ["id"] = 562,
                    ["image"] = 607816,
                    ["name"] = "扭曲分裂者",
                }, -- [5]
            },
        }, -- [18]
        {
            ["id"] = 262,
            ["image"] = 608199,
            ["name"] = "深幽泥沼",
            ["bosses"] = {
                {
                    ["id"] = 576,
                    ["image"] = 607649,
                    ["name"] = "飢餓之牙",
                }, -- [1]
                {
                    ["id"] = 577,
                    ["image"] = 607614,
                    ["name"] = "高薩安",
                }, -- [2]
                {
                    ["id"] = 578,
                    ["image"] = 607779,
                    ["name"] = "沼澤之王莫斯萊克",
                }, -- [3]
                {
                    ["id"] = 579,
                    ["image"] = 607788,
                    ["name"] = "黑色潛獵者",
                }, -- [4]
            },
        }, -- [19]
        {
            ["id"] = 259,
            ["image"] = 608207,
            ["name"] = "破碎大廳",
            ["bosses"] = {
                {
                    ["id"] = 566,
                    ["image"] = 607624,
                    ["name"] = "大術士奈德克斯",
                }, -- [1]
                {
                    ["id"] = 568,
                    ["image"] = 607811,
                    ["name"] = "戰爭使者歐姆拉格",
                }, -- [2]
                {
                    ["id"] = 569,
                    ["image"] = 607812,
                    ["name"] = "大酋長卡加斯‧刃拳",
                }, -- [3]
            },
        }, -- [20]
        {
            ["id"] = 261,
            ["image"] = 608199,
            ["name"] = "蒸汽洞窟",
            ["bosses"] = {
                {
                    ["id"] = 573,
                    ["image"] = 607651,
                    ["name"] = "水占師希斯比亞",
                }, -- [1]
                {
                    ["id"] = 574,
                    ["image"] = 607713,
                    ["name"] = "機電師蒸汽操控者",
                }, -- [2]
                {
                    ["id"] = 575,
                    ["image"] = 607815,
                    ["name"] = "督軍卡利斯瑞",
                }, -- [3]
            },
        }, -- [21]
        {
            ["id"] = 256,
            ["image"] = 608207,
            ["name"] = "血熔爐",
            ["bosses"] = {
                {
                    ["id"] = 555,
                    ["image"] = 607789,
                    ["name"] = "造物者",
                }, -- [1]
                {
                    ["id"] = 556,
                    ["image"] = 607558,
                    ["name"] = "布洛克",
                }, -- [2]
                {
                    ["id"] = 557,
                    ["image"] = 607670,
                    ["name"] = "『破壞者』凱利丹",
                }, -- [3]
            },
        }, -- [22]
        {
            ["id"] = 258,
            ["image"] = 608218,
            ["name"] = "麥克納爾",
            ["bosses"] = {
                {
                    ["id"] = 563,
                    ["image"] = 607712,
                    ["name"] = "機械領主卡帕希特斯",
                }, -- [1]
                {
                    ["id"] = 564,
                    ["image"] = 607725,
                    ["name"] = "虛空術師賽菲瑞雅",
                }, -- [2]
                {
                    ["id"] = 565,
                    ["image"] = 607739,
                    ["name"] = "操縱者帕薩里歐",
                }, -- [3]
            },
        }, -- [23]
        {
            ["id"] = 255,
            ["image"] = 608198,
            ["name"] = "黑色沼澤",
            ["bosses"] = {
                {
                    ["id"] = 552,
                    ["image"] = 607566,
                    ["name"] = "時間領主迪賈",
                }, -- [1]
                {
                    ["id"] = 553,
                    ["image"] = 607784,
                    ["name"] = "坦普拉斯",
                }, -- [2]
                {
                    ["id"] = 554,
                    ["image"] = 607529,
                    ["name"] = "艾奧那斯",
                }, -- [3]
            },
        }, -- [24]
    },
}